[
{"date_time": "Jul 9, 2020 • 6:37 pm CDT", "title": "These Airports Confirmed The Most COVID-19 Infected Staff", "content": "As of July 7, 2020, the US Transportation Security Administration (TSA) reported 1,018 federal employees have tested positive for COVID-19 disease. Unfortunately, there have been 6 fatalities related to coronavirus infections during 2020.The airports reporting the most infected TSA staff are New York's JFK (109), Newark (60), Miami (52), and Chicago O'Hare (41)."},
{"date_time": "Jul 9, 2020 • 6:17 pm CDT", "title": "171 Coronavirus Tests Now Approved", "content": "As of July 9, 2020, the U.S. FDA has authorized 171 coronavirus diagnostic tests under EUAs, which include 142 molecular tests, 27 antibody tests, and 2 antigen tests."},
{"date_time": "Jul 9, 2020 • 12:30 pm CDT", "title": "Canada Launches Cancer - Coronavirus Treatment Study", "content": "In the race to find new ways to prevent and treat COVID-19 disease, the Canadian Cancer Trials Group announced on July 8, 2020, it has launched an innovative clinical trial focussed on strengthening the immune system for one of the most vulnerable populations – cancer patients.This phase 3 study is called CCTG IC.8, which is evaluating coronavirus treatment with IMM-101, a preparation of safe, heat-killed bacteria that broadly stimulates the innate, or “first-response,” arm of the immune system."},
{"date_time": "Jul 9, 2020 • 12:18 pm CDT", "title": "WHO Briefing: How is COVID-19 Transmitted?", "content": "A scientific brief published by the WHO on July 9, 2020, provides an overview of the modes of transmission of SARS-CoV-2, what is known about when infected people transmit the virus, and the implications for infection prevention and control precautions within and outside health facilities.This brief reflects the consolidation of rapid reviews of publications in peer-reviewed journals and of non-peer-reviewed manuscripts on preprint servers, undertaken by WHO and partners."},
{"date_time": "Jul 9, 2020 • 9:39 am CDT", "title": "Reduced Travel Demand Increases Airline Layoffs", "content": "United Airlines announced on July 8, 2020, it is warning about 36,000 employees, which is more than a third of its entire staff, there is a risk of furloughs later in 2020, as the SARS-CoV-2 coronavirus pandemic continues to reduce travel demand, both in the USA and around the world, reported CNBC."},
{"date_time": "Jul 9, 2020 • 9:10 am CDT", "title": "COVID-19 Infections in UK Hospitals Reached 10%", "content": "Using publicly available data, researchers estimate that at least 10% of all COVID-19 infections in England were among patient-facing healthcare staff and resident-facing social care workers during the period from April 26th to June 7, 2020.'In the medium-term, we envisage an ambitious and comprehensive approach to prevention of infection transmitted through respiratory droplets and aerosol routes in hospitals,' said these researchers on July 6, 2020."},
{"date_time": "Jul 9, 2020 • 5:10 am CDT", "title": "Rural Matters — Coronavirus Outbreak and the Navajo Nation", "content": "The Navajo Nation is 27,000 square miles of high-altitude desert with a population density among the lowest in the contiguous United States: seven people per square mile. If you didn’t know better, the vast landscape would seem a perfect setup for social distancing regarding the COVID-19 outbreak, said Heather Kovich, M.D., in an editorial published in the NEJM on July 9, 2020.'But this is an especially tough concept for Navajo extended families. The virus takes advantage of the expansive Navajo definitions of “auntie” and “cousin-brother.”The national media reports on the severity of the Navajo Nation outbreak and these reports are factually accurate. The virus landed in the middle of the reservation during March and exploded outward, from a remote region with an emergency department, but no hospital. In response, the president of the Navajo Nation has issued curfew notices.The men on horses, if they don’t get sick, will be trotting up the highway each morning. They will still be wearing masks.'Since this editorial was written, the Navajo Nation, which includes parts of Arizona, New Mexico, and Utah, has reported 7,981 cases and 382 confirmed fatalities related to coronavirus disease, as of July 8, 2020."},
{"date_time": "Jul 8, 2020 • 7:09 pm CDT", "title": "Ivy League Cancels Athletics For 2020", "content": "The Ivy League became the first Division I conference to suspend all fall sports, including football. With the safety and well-being of students as their highest priority, Ivy League institutions are implementing campus-wide policies including restrictions on student and staff activities.'As athletics is expected to operate consistent with campus policies, it will not be possible for Ivy League teams to participate in intercollegiate athletics competition prior to the end of the fall semester,' said this July 8, 2020, statement."},
{"date_time": "Jul 8, 2020 • 6:59 pm CDT", "title": "Mission Impossible: Launching Vaccines in Just 6-Weeks ", "content": "According to a BMJ article published on July 8, 2020, researchers have accused the Indian Council of Medical Research of 'buckling under political pressure after it sent a letter to doctors instructing them to fast track clinical trials of a vaccine candidate against COVID-19. This letter proposed launching the vaccine for “public health use” by August 15, 2020.Doctors and researchers pointed out that it is impossible to expect a candidate vaccine to launch within 6-weeks.... when the clinical trials have not even started."},
{"date_time": "Jul 8, 2020 • 6:40 pm CDT", "title": "Delirium, Rare Brain Inflammation and Stroke Linked to COVID-19 Disease", "content": "Published in the journal Brain on July 8, 2020, a new study identified 1 rare and sometimes fatal inflammatory condition, known as Acute disseminated encephalomyelitis (ADEM), which appears to be increasing in prevalence due to the COVID-19 disease pandemic.Some patients in the study did not experience severe respiratory symptoms, and the neurological disorder was the first and main presentation of Covid-19.Neurological complications of COVID-19 can include delirium, brain inflammation, stroke, and nerve damage."},
{"date_time": "Jul 8, 2020 • 6:27 pm CDT", "title": "Can Coronavirus Infected People Correctly Describe Their Symptoms?", "content": "A new study published in JAMA on July 8, 2020, revealed that most patients with coronavirus disease presenting to emergency medical services (EMS), such as 911 call services, were older and had multiple chronic health conditions.Symptoms most often reported to EMS were fever (46% of patients), shortness of breath (44%), fatigue (40%), cough (29%), and altered mental state (28%).This finding indicates the early identification of COVID-19 and strategies to mitigate serious health risk during emergency care need to be expanded."},
{"date_time": "Jul 8, 2020 • 6:15 pm CDT", "title": "Brazil Leads the PAHO in COVID-19, Dengue and Yellow Fever Cases", "content": "During the Pan American Health Organization briefing on July 7, 2020, director Carissa Etienne said 'about 100,000 coronavirus cases each day are now reported from the region. However, she noted Brazil alone accounts for 25% of the cases outside of the USA.In addition to the COVID-19 pandemic, Brazil is confronted with Dengue and Yellow Fever outbreaks, says the U.S. CDC."},
{"date_time": "Jul 8, 2020 • 1:39 pm CDT", "title": "As Coronavirus Cases Increase, Driving Slows Down", "content": "The four USA states that are the leaders in reporting new coronavirus cases over the past week, Florida, Texas, California, and Arizona, have realized a decline in driving directions requests at Apple Maps, reported CNBC on July 8, 2020.On April 14, 2020, Apple released a mobility data trends tool from Apple Maps, which offers insights to governments and health authorities by showing the change in volume of people driving, walking, or taking public transit in their communities."},
{"date_time": "Jul 8, 2020 • 11:41 am CDT", "title": "Frequent Proton Pump Inhibitor Use Increases COVID-19 Risk", "content": "Proton pump inhibitors (PPIs) are among the most commonly used medications in the USA but have been linked to various side effects. A new study published on July 7, 2020, found that the use of PPIs is associated with increased odds for reporting a positive COVID-19 test.The highest risk was seen among individuals taking PPIs 2x daily, as they are nearly 4x more likely to report COVID-19 disease positivity when compared to those not on PPIs.'Since meta-analysis reveals that 2x daily PPIs do not offer clinically meaningful benefits over 1x dosing for gastroesophageal reflux disease, our findings further emphasize that PPIs should only be used when clinically indicated at the lowest effective dose,' concluded these researchers."},
{"date_time": "Jul 8, 2020 • 10:09 am CDT", "title": "Who is Exempt From Wearing Face-Masks?", "content": "As more jurisdictions around the world mandate facial coverings in public, many people are claiming they are unable to wear masks because of breathing problems. Recently, these individuals began asking doctors for medical exemptions from wearing masks, reported Medscape on July 7, 2020.These individuals cite the U.S. CDC recommendations on mask-wearing, which say, 'Cloth face coverings should not be placed on anyone who has trouble breathing.'The CDC indicates that on a case-by-case basis, some individuals may need to be exempted. However, one suggestion for those who don’t like wearing masks is using the clear face shields, which offer similar protections against infectious coronavirus droplets."},
{"date_time": "Jul 8, 2020 • 4:29 am CDT", "title": "Surge Testing For COVID-19 Announced in 3 Cities", "content": "The U.S. Department of Health and Human Services (HHS) announced on July 7, 2020, free COVID-19 testing in Jacksonville, Florida; Baton Rouge, Louisiana; and Edinburg, Texas. HHS, in partnership with eTrueNorth, will perform surge testing by offering 5,000 tests per-city per-day, at no charge, to those tested for SARS-CoV-2 virus infections.The temporary surge testing sites will be live for up to 12 days.Individuals seeking COVID-19 testing at any of these sites should pre-register for testing in advance at: www.DoINeedaCOVID19test.com."},
{"date_time": "Jul 8, 2020 • 2:34 am CDT", "title": "Study: In-Flight Coronavirus Risk", "content": "Between January 24th and February 15, 2020, an outbreak of COVID-19 disease occurred among 335 passengers on a flight from Singapore to Hangzhou in China. A total of 16 coronavirus patients were diagnosed among all passengers, which represents an infection rate of 4.8%.'COVID-19 disease transmission may have occurred during the flight.''However, the majority of the cases in the flight-associated outbreak could not be attributed to transmission on the flight, but were associated with exposure to the virus in Wuhan, China, or to infected members in a single tour group,' concluded this travel study published on July 6, 2020."},
{"date_time": "Jul 8, 2020 • 2:24 am CDT", "title": "Obesity Increases Coronavirus Morbidity Risk", "content": "Researchers at Weill Cornell Medicine studied 1,687 hospitalized coronavirus patients at New York City hospitals and found that 31% were obese, with about 5% of all patients being morbidly obese.These findings published on July 6, 2020, support the need to consider the prevalence of obesity when planning a community's COVID-19 disease prevention program."},
{"date_time": "Jul 8, 2020 • 2:05 am CDT", "title": "Alaska's Contact-Tracing Changes Tactics", "content": "Anchorage Mayor Ethan Berkowitz explained his decision on July 7, 2020, to name establishments, mostly bars, where there was COVID-19 exposure. Berkowitz said the city would prefer to privately notify people who were at an establishment where they could have been exposed to the virus.But last week, the city reported its contact-tracing ability was maxed out.The Municipality of Anchorage named more than a dozen bars where people “who were infectious with COVID-19 spent extended time.”"},
{"date_time": "Jul 7, 2020 • 3:27 pm CDT", "title": "Contrasting SARS-2 with SARS-1 and Influenza Pandemics", "content": "A new study published in The Lancet on July 3, 2020, reported SARS-CoV-2 is less deadly but far more transmissible than SARS-1 or previous flu pandemics. The reproductive rate (R0) for SARS-CoV-2 is estimated to be 2.5, compared with 2.4 for SARS-1, Pandemic Influenza of 1918 of 2.0, and for the 2009 influenza pandemic, the RO was 1.7.And, SARS-CoV-2 causes mild or asymptomatic disease in most cases. However, severe illness occurs in a small proportion of infected individuals older than 70 years of age."},
{"date_time": "Jul 7, 2020 • 1:45 pm CDT", "title": "Is Now Time to Address Airborne Transmission of Coronaviruses?", "content": "An open letter published on July 6, 2020, by 239 scientists from 32 countries urges the World Health Organization and other bodies to address the potential for airborne transmission of the new coronavirus.The debate between the potential health risks caused by respiratory droplets and aerosols dates back to the 1930s.Separately, researchers stated in an early-release study to be published in September 2020, ‘that existing evidence is sufficiently strong to warrant engineering controls targeting airborne transmission as part of an overall strategy to limit infection risk indoors.’"},
{"date_time": "Jul 7, 2020 • 1:23 pm CDT", "title": "Japan May Contribute $800 Million To Purchase Coronavirus Vaccines ", "content": "Japan is in talks with potential partners to set up a $20 billion fund to jointly buy coronavirus vaccines, Nikkei reported on July 8, 2020. Japan is expected to contribute as much as $800 million, according to people familiar with the matter.Around 30 nations have said they intend to join the joint purchases, including Italy, Spain, Norway, Canada, and the European Union.Participating countries would agree to take no more than enough coronavirus vaccine for 20% of their population."},
{"date_time": "Jul 7, 2020 • 1:14 pm CDT", "title": "GSK and Medicago Collaboration to Develop COVID-19 Vaccine", "content": "GSK and Medicago announced on July 7, 2020, a collaboration to develop a COVID-19 candidate vaccine combining Medicago’s recombinant Coronavirus Virus-Like Particles (CoVLP) with GSK’s pandemic adjuvant system.Pre-clinical results with Medicago’s CoVLP vaccine candidate demonstrated high levels of neutralizing antibodies following a single dose when administered with an adjuvant. CoVLPs mimic the structure of the virus responsible for COVID-19 disease, allowing them to be recognized by the immune system."},
{"date_time": "Jul 7, 2020 • 12:50 pm CDT", "title": "Regeneron Announces $450 Million Agreement With BARDA and U.S. DoD for Antiviral Antibody Cocktail", "content": "Regeneron announced on July 7, 2020, the Biomedical Advanced Research and Development Authority has awarded a $450 million contract to manufacture and supply REGN-COV2, Regeneron's investigational double-antibody cocktail.REGN-COV2 is currently in Phase 2/3 clinical trials for the treatment of COVID-19 disease, and in a Phase 3 trial, for the prevention of COVID-19 infection, which is caused by the SARS-CoV-2 virus."},
{"date_time": "Jul 7, 2020 • 11:13 am CDT", "title": "Brazil's President Tests Positive for Coronavirus", "content": "Brazil's President Bolsonaro announced on TV on July 7, 2020, that he has tested positive for the coronavirus. This was Mr. Bolsonaro's 4th test, reported the BBC. Mr. Bolsonaro said that he had started experiencing symptoms on July 5th, when he had a high temperature, a cough, and had felt unwell.Brazil has reported over 65,000 fatalities related to COVID-19 disease during 2020.Previously, on June 30th, Brazil extended through July 29, 2020, its travel decree banning foreigners from entering the country by air, land, and sea."},
{"date_time": "Jul 7, 2020 • 8:34 am CDT", "title": "Over 2/3 of Infected Russians Have Recovered", "content": "Russia has documented 6,368 cases of COVID-19, a disease caused by the novel coronavirus, in the past 24 hours, with the daily increase rate reaching a record low of 0.9%, the anti-coronavirus crisis center informed TASS on July 7, 2020.In the past week, TASS reported the increase rate has not surpassed 1%. The total number of those infected in Russia has reached 694,230.Currently, 219,856 people (31.7%) diagnosed with COVID-19 are undergoing treatment in Russia."},
{"date_time": "Jul 7, 2020 • 8:19 am CDT", "title": "Most British Adults Will Get COVID-19 Vaccine", "content": "Nearly 5 in 6 Britons said they will get a coronavirus vaccine if and when one becomes available, according to the polling carried out by YouGov for the Center for Countering Digital Hate, reported the Guardian on July 6, 2020."},
{"date_time": "Jul 7, 2020 • 8:03 am CDT", "title": "California Firm Solves the UK's Ventilator Shortage", "content": "In an effort to overcome the shortage of ventilators in the UK, Veeva Systems announced on July 7, 2020, that it successfully scaled production to deliver more than 13,000 ventilators to the National Health Service."},
{"date_time": "Jul 7, 2020 • 6:58 am CDT", "title": "Lysol Products Found Effective Against Coronavirus", "content": "Late on July 6, 2020, the U.S. Environmental Protection Agency (EPA) announced the approval for 2 common products, Lysol Disinfectant Spray (EPA Reg No. 777-99) and Lysol Disinfectant Max Cover Mist (EPA Reg No. 777-127) are effective against the SARS-CoV-2 virus.Because novel viruses are typically not immediately available for laboratory testing, the EPA has now established guidance for Emerging Viral Pathogens."},
{"date_time": "Jul 7, 2020 • 5:46 am CDT", "title": "$1.6 Billion Funding Announced for Coronavirus Vaccine Development", "content": "The U.S. government's Operation Warp Speed announced on July 7, 2020, it has awarded Novavax $1.6 Billion in funding for the large-scale manufacturing of NVX-CoV2373, including the production of 100 million vaccine doses starting in late 2020."},
{"date_time": "Jul 7, 2020 • 5:28 am CDT", "title": "Updated: Coronations Vaccine Candidates", "content": "The SARS-CoV-2 vaccine development landscape includes innovative platforms such as nucleic acid (DNA and RNA), virus-like particle, peptide, viral vector (replicating and non-replicating), recombinant protein, live attenuated virus and inactivated virus approaches.This listing is updated as of July 7, 2020."},
{"date_time": "Jul 7, 2020 • 5:19 am CDT", "title": "Double-Antibody Cocktail Launches Late-Stage Study", "content": "On July 6, 2020, Regeneron Pharmaceuticals, Inc. announced the initiation of phase 3 clinical trials evaluating REGN-COV2, Regeneron's investigational double-antibody cocktail for the treatment and prevention of COVID-19 disease.REGN-COV2's two antibodies bind non-competitively to the critical receptor binding domain of the virus's spike protein, which diminishes the ability of mutant viruses to escape treatment and protects against spike variants that have arisen in the human population."},
{"date_time": "Jul 6, 2020 • 6:30 pm CDT", "title": "COVID-19 Molecular Testing Demand Surges", "content": "Quest Diagnostics says 'Since June 29, 2020, demand has continued to rise nationwide, particularly in the South, Southwest, and West regions of the USA, outpacing our testing capacity. As a result, the average turnaround time for reporting test results is now 1 day for priority 1 patients .... and 4-6 days for all other populations.''Over the month of July, we will continue to ramp up our capacity from 115,000 last week, to reach 150,000 molecular diagnostic tests a day,' stated a Quest press statement on July 6, 2020."},
{"date_time": "Jul 6, 2020 • 5:30 pm CDT", "title": "Spain's Herd Immunity Reaches Just 5%", "content": "The first nationwide population-based study in Spain presents seroprevalence estimates just 5% of people have antibodies against SARS-CoV-2. This study 's findings published on July 6, 2020, also indicate that children and adolescents have lower seroprevalence than adults, and seroprevalence does not vary by sex."},
{"date_time": "Jul 6, 2020 • 2:50 pm CDT", "title": "Loss of Smell & Taste Does Return", "content": "The loss of smell or taste is among the most common and persistent symptoms of mildly symptomatic COVID19 disease patients. However, a new study published in JAMA on July 2, 2020, found at 4 weeks from the onset, 89% of the SARS-CoV-2–positive mildly symptomatic patients who had had an altered sense of smell or taste .... experienced a complete resolution or improvement of these symptoms."},
{"date_time": "Jul 6, 2020 • 2:27 pm CDT", "title": "3rd Coronavirus and Influenza Combination Test Approved", "content": "On July 2, 2020, the U.S. FDA issued an authorization for the 3rd diagnostic test for detection and differentiation of the viruses that cause influenza and COVID-19, in individuals suspected of COVID-19. The CDC Influenza SARS-CoV-2 (Flu SC2) Multiplex Assay is a real-time reverse-transcriptase polymerase chain reaction test that detects and differentiates RNA from SARS-CoV-2, influenza A virus, and influenza B virus in upper or lower respiratory specimens.The FDA has previously issued authorizations to BioFire Diagnostics LLC and QIAGEN GmbH for their duel tests.These combination tests work by testing a single sample from a patient for multiple respiratory diseases, such as COVID-19 and the seasonal flu which can show similar symptoms, says the FDA."},
{"date_time": "Jul 6, 2020 • 2:15 pm CDT", "title": "2nd Antigen Test Authorized in the USA", "content": "The U.S. FDA issued an Emergency Use Authorization on July 6, 2020, for a COVID-19 antigen diagnostic test, the Becton Dickinson Veritor System for Rapid Detection of SARS-CoV-2. This is the 2nd antigen test the FDA has authorized for the detection of SARS-CoV-2 antigens."},
{"date_time": "Jul 6, 2020 • 2:06 pm CDT", "title": "Remdesivir (DESREM) Will Cost About $64 in India", "content": "Mylan N.V. announced on July 6, 2020, that the Drug Controller General of India has approved its remdesivir 100 mg/vial for restricted emergency use in COVID-19 patients in India.In India, Mylan will launch the drug under the brand name DESREM. It will be available to patients in July at a price of 4,800 Indian rupees, which is about USD $64.Mylan said it continues to work to expand emergency use access for patients in the 127 low- and middle-income countries where it is licensed by Gilead Sciences to do so."},
{"date_time": "Jul 6, 2020 • 12:47 pm CDT", "title": "CDC Report: Influenza-like illness & COVID-19-like illness activity remain lower than peaks", "content": "On July 3, 2020, the U.S. CDC reported 'Nationally, levels of influenza-like illness (ILI) and COVID-19-like illness (CLI) activity remain lower than peaks seen in March and April 2020 but are increasing in most regions.And, the percentage of specimens testing positive for SARS-CoV-2, the virus that causes COVID-19, increased from last week's report.Fortunately, the CDC said mortality attributed to COVID-19 disease decreased compared to last week."},
{"date_time": "Jul 6, 2020 • 12:22 pm CDT", "title": "Airborne Virus Transmissions Can Be Reduced Indoors ", "content": "During the COVID-19 pandemic, questions have been voiced about routes of transmission for this contagious disease. A September 2020 study, pending publishing, found inhaling small airborne droplets is probable as the 3rd route of coronavirus infection.These researchers said 'While uncertainties remain regarding the relative contributions of the different transmission pathways, we argue that existing evidence is sufficiently strong to warrant engineering controls targeting airborne transmission as part of an overall strategy to limit infection risk indoors.'Specifically, 'appropriate building engineering controls can be enhanced by particle filtration, air disinfection, and avoiding air recirculation."},
{"date_time": "Jul 6, 2020 • 10:37 am CDT", "title": "Coronaviruses Don't 'Linger in the Air'", "content": "Contrary to an NYTimes article published on July 4, 2020, which says 'coronavirus lingers in the air indoors', the U.S. CDC says how the SARS-CoV-2 coronavirus spreads is very similar to 4 of the 100 other known coronaviruses.Coronaviruses are a large family of viruses that usually cause mild to moderate upper-respiratory tract illnesses, like the common cold, says the U.S. NIH.The CDC stated on June 16, 2020, that the COVID-19 disease, which is caused by the SARS-CoV-2 coronavirus, is thought to spread mainly through close contact from person-to-person through respiratory droplets produced when an infected person coughs, sneezes, or talks.These 'infected-droplets' can land in the mouths or noses of people who are nearby or possibly be inhaled into the lungs. In general, the more closely a person interacts with others, and the longer that interaction, the higher the risk of spreading this coronavirus.It may be possible that a person can get COVID-19 by touching a surface or object that has the coronavirus on it and then touching their own mouth, nose, or possibly their eyes. This is not thought to be the main way the virus spreads, but we are still learning more about how this virus spreads, says the CDC."},
{"date_time": "Jul 6, 2020 • 5:05 am CDT", "title": "CureVac Signs €75 Million Vaccine Development Funding", "content": "On July 6, 2020, European Investment Bank and CureVac sign a €75 million loan agreement for the development and large-scale production of vaccines, including CureVac’s vaccine candidate against SARS-CoV-2, CVnCoV.The principle of CureVac's proprietary vaccine technology is the use of mRNA as a data carrier to instruct the human body to produce its own proteins capable of fighting a wide range of diseases."},
{"date_time": "Jul 5, 2020 • 1:05 pm CDT", "title": "Potent Antibodies Found in COVID-19 Patients", "content": "To better understand antibodies against the spike protein that are naturally produced after an infection, a research team at the Rockefeller University studied 149 people who had recovered from COVID-19 disease, reported the NIH on June 30, 2020. Only 1% of the study participants had high levels of antibodies that could neutralize the coronavirus.Even in those with modest neutralizing activity in their plasma, the team found potent antibodies against the SARS-CoV-2 receptor-binding domain (RBD). Further analysis showed that the neutralizing antibodies fell into 3 groups, each binding to a different part of the RBD.Together, these insights could help guide the design of COVID-19 vaccines or antibodies as potential treatments."},
{"date_time": "Jul 5, 2020 • 10:14 am CDT", "title": "Can Measles Vaccination Reduce COVID-19 Risks?", "content": "A recent study published in the journal mBio suggests that the measles, mumps, rubella (MMR) vaccine, which is routinely administered during childhood, could reduce the inflammation associated with COVID-19 disease.Published on June 19, 2020, these researchers stated: There is mounting evidence that live attenuated vaccines provide nonspecific protection against lethal infections unrelated to the target pathogen of the vaccine by ... inducing “trained” nonspecific innate immune cells for improved host responses against subsequent infections.\"However, a clinical trial is required to validate this suggestion, said these researchers."},
{"date_time": "Jul 5, 2020 • 6:37 am CDT", "title": "UK Discussing $624 Million Vaccine Deal", "content": "GlaxoSmithKline (GSK) and Sanofi are close to agreeing to supply the British government with 60 million doses of their SARS-CoV-2 coronavirus preventive vaccine should it work in human trials, which are due to begin in September 2020. The potential value of this supply agreement is £500m.The Sunday Times reported on July 5, 2020, this pending agreement for an as-yet unproven vaccine underlines UK ministers’ desperation to secure a vaccine as countries around the world buy up potential COVID-19 preventive treatments."},
{"date_time": "Jul 5, 2020 • 6:14 am CDT", "title": "The WHO Discontinues Studying Hydroxychloroquine", "content": "The WHO announced the acceptance of the recommendation from the Solidarity Trial’s International Steering Committee on July 4, 2020, to discontinue the clinical trial of hydroxychloroquine, as known as Plaquenil.The WHO's Solidarity Trial was established to find an effective treatment for hospitalized COVID-19 disease patients."},
{"date_time": "Jul 5, 2020 • 6:04 am CDT", "title": "While Focused on COVID-19, Measles Has Returned", "content": "As every country is struggling to defeat the new SARS-CoV-2 coronavirus, many are unintentionally enabling common diseases to regain footholds. The rates of childhood vaccinations have dropped significantly due to the fear of contracting the novel coronavirus.Many of these known diseases have preventive vaccines available, such as measles.According to the NYTimes on July 1, 2020, most WHO regions are experiencing large, often extended, measles outbreaks. Measles is reported in children living in Bangladesh, Brazil, Cambodia, Central African Republic, Iraq, Kazakhstan, Nepal, Nigeria, and Uzbekistan.This is unfortunate news since around 90% of unvaccinated children will become infected following exposure to the measles virus. Measles caused an estimated 110,000 deaths in 2017, reports the U.S. CDC."},
{"date_time": "Jul 5, 2020 • 5:26 am CDT", "title": "Sunlight Rapidly Inactivates SARS-CoV-2 on Surfaces", "content": "This May 20, 2020 study provides the first evidence that sunlight rapidly inactivates the SARS-CoV-2 virus on surfaces, suggesting that the coronavirus exposure risk, may vary significantly between .... indoor and outdoor environments."},
{"date_time": "Jul 5, 2020 • 5:20 am CDT", "title": "Chlorine Protects Swimming Pools From Coronavirus", "content": "According to the U.S. CDC, there is no evidence that COVID-19 disease can be spread to humans when swimming in pools or hot tubs. Disinfection with chlorine should remove or inactivate the SARS-CoV2 virus that causes COVID-19.And, chlorine bleach is effective against coronavirus when used properly, according to the U.S. Environmental Protection Agency. While surface disinfectant products on List N have not been tested specifically against SARS-CoV-2, the cause of COVID-19, EPA expects them to kill the virus.Saltwater pools are also likely to be low-risk because pool equipment called salt cells use electrolysis to generate chlorine from the salt in the water."},
{"date_time": "Jul 4, 2020 • 10:14 am CDT", "title": "Could Green Tea and Spirulina Become Antiviral Agents Against Coronaviruses", "content": "An early-stage study found Spirulina and Green tea extracts against CoVpvs. SARSpv, MERSpv, and SARS-2pv entry were blocked with higher efficiency when preincubated with either green tea or spirulina extracts.And, Green tea provided a better inhibitory effect than the spirulina extracts.In summary, this non-peer-reviewed study published on June 23, 2020, concluded saying 'we demonstrate that pseudotyped virus is an ideal tool for screening viral entry inhibitors', but requires further research before being considered a viable coronavirus antibody."},
{"date_time": "Jul 4, 2020 • 7:57 am CDT", "title": "Changes in the SARS-CoV-2 Coronavirus", "content": "A SARS-CoV-2 variant carrying the Spike protein amino acid change D614G has become the most prevalent form in the global COVID-19 pandemic reported a study published on July 2, 2020. G614 is associated with lower RT PCR Ct’s, which is suggestive of higher viral loads in patients.This new data indicates further mutations are likely, which could increase the spread of the new coronavirus and the severity of COVID-19 disease, even in younger patients."},
{"date_time": "Jul 4, 2020 • 4:27 am CDT", "title": "Diplomats Depart Saudi Arabia As COVID-19 Outbreak Develops", "content": "Dozens of U.S. diplomats and their families were departing the Kindom of Saudi Arabia amid a surge in new SARS-CoV-2 coronavirus cases, reported the WSJ on July 3, 2020. On June 26, 2020, the Department of State authorized the voluntary departure of non-emergency U.S. personnel and family members from the U.S. Mission to Saudi Arabia.Previously, the US Department of State issued a Level 4 Travel Advisory which stated: 'As the COVID-19 situation develops, our ability to provide assistance working with commercial airlines or arranging for evacuation flights may become limited.'Recently, on June 29, 2020, the State Department issued a Level 2: Exercise Increased Caution Travel Advisory for Saudi Arabia.Saudi Arabia passed the milestone of 202,000 confirmed COVID-19 cases, weeks ahead of an annual Hajj pilgrimage. However, the Kingdom has only confirmed 1,802 fatalities related to coronavirus during 2020."},
{"date_time": "Jul 4, 2020 • 3:58 am CDT", "title": "Australian Researchers Repurposed Old Vaccine to Protect Against COVID-19", "content": "Researchers at the University of Sydney and Centenary Institute announced on July 3, 2020, they are repurposing the old tuberculosis vaccine to see if it can be used as a preventive vaccine against the SARS-CoV-2 virus.The vaccine candidate, which Australian researchers have called BCG:CoVac, combines the vaccine for tuberculosis, Bacille Calmette-Guérin (BCG) with major components of the SARS-CoV-2 virus."},
{"date_time": "Jul 3, 2020 • 7:39 am CDT", "title": "Oxford Professor Is Seeing 'The Right Sort of Immune Response'", "content": "Speaking at a parliamentary hearing on July 1, 2020, Sarah Gilbert, professor of vaccinology at the University of Oxford, said 8,000 volunteers had been enrolled for the Phase III clinical trial into the SARS-CoV-2 vaccine candidate, AZD1222, which is now licensed to AstraZeneca.“We’re very happy that we’re seeing the right sort of immune response that will give protection, and not the wrong sort,” Reuters reported."},
{"date_time": "Jul 3, 2020 • 7:23 am CDT", "title": "Flying Delta This Summer Comes With Restrictions", "content": "'The travel experience looks a little different now and we’re here to help you arrive prepared' says a recent Delta Airlines posting. Some US States have imposed temporary entry requirements or restricting essential travel.As travel restrictions may change on short notice, please visit the CDC State and Territorial Health before traveling this summer."},
{"date_time": "Jul 3, 2020 • 6:55 am CDT", "title": "Should Masks Be Worn When Exercising? ", "content": "Wearing a mask during exercise reduces the risk that we will infect someone else with the SARS-CoV-2 virus. But wearing a mask while exercising also affects how the exercise affects us, according to the NYTimes on June 18, 2020.There is growing evidence that masks can affect breathing in general, yet there is little scientific evidence about how wearing a mask changes the physical impacts of exercise.A recent, small study, found 'the use of masks by athletes causes hypoxic and hypercapnic breathing.'According to RunnersWorld on July 1, 2020, 'runs should be in areas where you can be alone or maintain at least 6-feet between yourself and others to reduce the risk of spreading the virus.'"},
{"date_time": "Jul 3, 2020 • 6:10 am CDT", "title": "PAHO Expands Protections During COVID-19 Pandemic", "content": "On June 30, 2020, Dr. Carissa F. Etienne, said in a video briefing ‘PAHO countries planning to relax public health measures must take a phased approach based on local conditions and be prepared to impose preventive measures again if the epidemiological situation changes. Our region has reported more COVID-19 cases than any other, but the overall numbers only tell part of the story.’As an example, starting July 15th, all Puerto Rico visitors, including USA citizens, must take a coronavirus test 72 hours prior to their arrival and submit the test results to officials at the airport."},
{"date_time": "Jul 2, 2020 • 6:05 pm CDT", "title": "Kroger Offers Coronavirus Testing Service", "content": "Kroger Health's COVID-19 Test Home Collection Kit will be available to frontline associates across Kroger's Family of Companies, based on medical need, announced Kroger in a July 1, 2020 press statement.Kroger patients will be provided access to a website where they will answer screening questions, input their organization's benefit code, and an individual code, and complete a clinical assessment. If a patient qualifies, a healthcare professional will issue a prescription and the home collection kit is shipped to their home within 24-48 hours.In partnership with Gravity Diagnostics, a full-service clinical laboratory located in Covington, KY, Kroger Health plans to process up to 60,000 tests per week by the end of July 2020."},
{"date_time": "Jul 2, 2020 • 1:40 pm CDT", "title": "Hydroxychloroquine Reduced Fatality Rate at Henry Ford Health", "content": "Treatment with hydroxychloroquine reduced the fatality rate in patients hospitalized with COVID-19 disease, and without heart-related side-effects, according to a new, observational study published by Henry Ford Health System on July 2, 2020.Hydroxychloroquine provided a 66% hazard ratio reduction, and hydroxychloroquine + azithromycin produced a 71% reduction compared to neither treatment."},
{"date_time": "Jul 2, 2020 • 1:25 pm CDT", "title": " $2.67 Billion In Funding for Texas Hospitals", "content": "Texas Governor Greg Abbott and the Texas Health and Human Services Commission announced on June 2, 2020, that $2.67 billion in federal funding has been approved to support Texas hospitals that provide care for people receiving Medicaid."},
{"date_time": "Jul 2, 2020 • 12:41 pm CDT", "title": "Elon Musk To Develop “RNA Microfactories” For CureVac", "content": "Elon Musk Tweeted on July 2, 2020, that Tesla Inc. is building mobile molecule printers to help make the potential COVID-19 vaccine candidate named CVnCoV, currently conducting a phase 1 study, being developed by CureVac, based in Germany."},
{"date_time": "Jul 2, 2020 • 10:32 am CDT", "title": "UK Begins 'Green-Lighting' Certain Countries", "content": "The UK government is expected to announce by June 3, 2020, its new travel alert system, under which UK citizens can return from an array of countries without being subject to a 2-week quarantine.Countries will either be graded green, meaning they are safer than the UK; amber, meaning they are less safe than green countries; or red, which will result in any passengers returning to the UK to be quarantined.Almost all of Europe will be included in the approved listed, with the possible exception of Portugal and Sweden, reported the Telegraph."},
{"date_time": "Jul 2, 2020 • 9:51 am CDT", "title": "Japan's Flu Medicine Avigan Gains Coronavirus Therapeutic Partners", "content": "Tokyo Japan-based FUJIFILM Corporation announced a partnership with India's Dr. Reddy’s Laboratories Ltd., and Dubai-based Global Response Aid on June 1, 2020, concerning the global development, manufacture, and sales of Avigan® Tablets (favipiravir), excluding Japan, China, and Russia.Because it has a mechanism of action that selectively inhibits viral RNA polymerase, thereby preventing viral proliferation, Avigan may have an antiviral effect on the novel SARS-CoV-2 coronavirus, as it is classified into the same type of RNA virus as influenza viruses."},
{"date_time": "Jul 2, 2020 • 7:25 am CDT", "title": "Hydroxychloroquine Study COPCOV Restarts", "content": "Oxford University’s Professor Nicholas White, who is co-leading the COPCOV trial, said on June 30, 2020, “Hydroxychloroquine (Plaquenil) could still prevent infections, and this needs to be determined in a randomized controlled trial. The question of whether (it) can prevent COVID-19 or not remains as pertinent as ever.”On June 16, 2020, the UK's Medicines and Healthcare products Regulatory Agency instructed clinical trialists using hydroxychloroquine to treat or prevent coronavirus (COVID-19) to suspend the recruitment of study participants.Previously, the US FDA issued a letter revoking the Emergency Use Authorization for emergency use of hydroxychloroquine sulfate (HCQ) on June 15, 2020."},
{"date_time": "Jul 2, 2020 • 6:08 am CDT", "title": "Smell Tests... Not Temperature ... Are The Best Coronavirus Checks", "content": "A recent study found that COVID-19 disease patients were 27 times more likely to have lost their sense of smell (anosmia), but they were only 2.6 times more likely to have fever or chills.This data published on June 11, 2020, suggests anosmia tests should be deployed at airports as a priority over thermal cameras that screen body temperatures."},
{"date_time": "Jul 2, 2020 • 5:55 am CDT", "title": "Tokyo's Uptick Indicates Close-Contact Spreading", "content": "The Tokyo Metropolitan Government announced on July 1, 2020, that 107 new people in Tokyo, Japan, were confirmed infected with the SARS-CoV-2 coronavirus, the most cases since the declaration of emergency was canceled on May 25th.Also, out of these 107 people, data indicate 62 people are close-contacts of those who were previously confirmed to be COVID-19 infected, reported NHK.This suggests ' contact-tracing ' is an important disease prevention tactic."},
{"date_time": "Jul 1, 2020 • 4:48 pm CDT", "title": "Defense Department Authorizes Travel to Just 47 US States", "content": "The US Secretary of Defense recently signed a memo, moving to a conditions-based approach to personnel travel. The Secretary 's #1 priority during the COVID-19 pandemic is protecting the military workforce.As of June 29, 2020, there are 47 US states that meet the new conditions to lift travel restrictions, subject to individual military installation assessments. However, if installation conditions are subsequently not met, the approval authority decides if travel restrictions should be reinstated, stated this DoD press statement.California, Florida, and Michigan are the only US states to which service members are not authorized to travel for permanent-change-of-station moves, temporary duty, and other non-essential purposes.As of July 1, 2020, there were 12,521 US troops diagnosed with COVID-19, but only 3 related-fatalities."},
{"date_time": "Jul 1, 2020 • 1:32 pm CDT", "title": "Alert: Contact-Tracing Scams in the USA", "content": "Part of the continued effort to fight fraud connected to the COVID-19 pandemic, the US Department of Justice, the Department of Health and Human Services, and the Federal Trade Commission announced on June 30, 2020, they are partnering to alert the public of emerging threats to steal money and sensitive information through contact tracing scams.Scammers may send text messages or emails with fake links, or call people pretending to be contact tracers.Their goal is to get money, Social Security numbers, or other sensitive information not required for authentic contact tracing."},
{"date_time": "Jul 1, 2020 • 12:50 pm CDT", "title": "Treating COVID-19 Patients with Convalescent Plasma Found Safe", "content": "The first peer-reviewed study of COVID-19 and convalescent plasma therapy in the USA shows the treatment to be safe, with 76% of patients improving after receiving the treatment. No adverse events as a result of plasma transfusion were observed. Whole-genome sequencing data did not identify a strain genotype-disease severity correlation.This study's data indicate that the administration of convalescent plasma is a safe treatment option for those with severe COVID-19 disease."},
{"date_time": "Jul 1, 2020 • 8:55 am CDT", "title": "Puerto Rico Requires American Visitors Pass COVID-19 Test", "content": "Puerto Rico's governor announced on June 30, 2020, new rules for all airline passengers arriving into Puerto Rico. Starting July 15th, all visitors, including USA citizens, must take a coronavirus test 72 hours prior to their arrival and submit the results to officials at the airport, reported Fox13 news.Those who refuse to do so, or tested positive, or do not have the test results available, will be forced into a 2-week quarantine.During that time, these visitors have to undergo a COVID-19 test and share the results if they want to be released from quarantine, said Puerto Rico Health Secretary Lorenzo Gonzalez."},
{"date_time": "Jul 1, 2020 • 5:58 am CDT", "title": "USA Consolidates Coronavirus Treatment Market", "content": "On June 29, 2020, the US Department of Health and Human Services announced an agreement to secure large supplies - about 90% of all production - of the drug remdesivir for use by American hospitals.According to international media, this implies European health authorities may not be able to acquire any supplies of remdesivir until the Fall of 2020."},
{"date_time": "Jul 1, 2020 • 5:47 am CDT", "title": "Far-UVC Light Safely Inactivates Airborne Coronaviruses", "content": "A direct approach to limit airborne viral transmissions is to inactivate them within a short time of their production. Germicidal ultraviolet light, typically at 254 nm, is effective in this context, reports a new study published in Nature on 24, June 2020.However, far-UVC light (207–222 nm) efficiently kills pathogens ... potentially without harm ... to exposed human tissues."},
{"date_time": "Jul 1, 2020 • 5:33 am CDT", "title": "Goodbye Health Privacy ... Hello 'Digital Health Passport'", "content": "A British cybersecurity company, VTS, in partnership with several tech firms, is rolling out the COVI-PASS, which is a “digital health passport” that will contain your “relevant health information,\" reported mintpressnews.In May 2020, VST signed with the owner of COVI-PASS, Circle Pass Enterprises (CPE) to integrate VST’s VCode into the biometric RFID-enabled “passports” which can be accessed via mobile phone or a key fob that will flash colored lights to denote if an individual is to be denied entry to public locations.According to Twitter posts, VST now has a direct partnership with the UK government and has secured contracts to deploy its technology in 15 countries, including Italy, Portugal, France, India, the USA, Canada, Sweden, Spain, South Africa, Mexico, United Arab Emirates, and the Netherlands.This type of ' contact-tracing ' app is currently being deployed throughout the USA, which suspended aspects of the HIPAA privacy law during the COVID-19 pandemic."},
{"date_time": "Jul 1, 2020 • 5:15 am CDT", "title": "New Yorker's Were Infected During February 2020", "content": "A new study offers the first physical evidence that SARS-CoV-2 was circulating at low levels in New York City as early as the first week of February 2020, reported the NYTimes on June 30, 2020.This study using 5,000 plasma samples from patients at Mount Sinai Hospital also confirms about 20% of New Yorkers had been exposed to the coronavirus by late April, which is consistent with data just released by the U.S. CDC."},
{"date_time": "Jun 30, 2020 • 5:44 pm CDT", "title": "USA's Coronavirus Version Could be 10x More Contagious", "content": "A non-peer-reviewed study by the Scripps Research Institute posted on June 12, 2020, shows that the original SARS-CoV-2 strain in China is dubbed D614, while the virus found in the UK, Italy, and North America by May 2020 is now called G614. And this S protein mutation results in more transmissible SARS-CoV-2 but also limits shedding of the S1 domain, which increases the S-protein incorporation into the virion.This indicates the coronavirus version spreading in the USA could be about 10 times more infectious, meaning higher amounts of coronavirus are circulating in their body. reported these Scripps researchers based in Jupiter, Florida."},
{"date_time": "Jun 30, 2020 • 1:41 pm CDT", "title": "Scotland On-Track to Eliminate Coronavirus", "content": "Fatalities and new infections from the SARS-CoV-2 virus have fallen to such low levels in the country of Scotland that the first minister Nicola Sturgeon says the country is close to eliminating the virus', reported the BMJ on June 29, 2020.Sturgeon described this trend as 'really significant.'With a population of about 5.5 million, Scotland has reported 2,485 fatalities related to COVID-19 disease during 2020."},
{"date_time": "Jun 30, 2020 • 9:03 am CDT", "title": "Americans Barred From Entering the EU for Nonessential Travel", "content": "EU ambassadors plan to reopen external borders on July 1, 2020, but travellers from the USA could be among those not allowed into the EU, says the BBC.This action by the EU could be related to the U.S. CDC 's June 5, 2020, recommendation that travelers avoid all nonessential international travel."},
{"date_time": "Jun 30, 2020 • 7:35 am CDT", "title": "Another Coronavirus Vaccine Candidate Joins Operation Warp Speed", "content": "Based on positive phase 1 clinical trial results, the INO-4800 vaccine candidate has been selected to participate in a non-human primate challenge study as part of the U.S. government's Operation Warp Speed program.And, INOVIO announced positive interim clinical data of its vaccine candidate against SARS-CoV-2, from the 1st, of two, Phase 1 clinical trial cohorts."},
{"date_time": "Jun 30, 2020 • 6:49 am CDT", "title": "30 Million SARS-CoV-2 IgG Antibody Test Become Available", "content": "Beckman Coulter announced on June 29, 2020, that its Access SARS-CoV-2 IgG assay has received Emergency Use Authorization from the U.S. FDA. Beckman Coulter has already shipped tests to more than 400 hospitals, clinics, and diagnostics laboratories in the USA.The company said it is able to deliver more than 30 million tests per month."},
{"date_time": "Jun 30, 2020 • 6:35 am CDT", "title": "NuvOx Pharma's Oxygen Therapeutic Launches Phase IIa Clinical Trial in Canada", "content": "On June 29, 2020, NuvOx Pharma announced it received a “No Objection Letter” from Health Canada to proceed with a Phase IIa clinical trial of NanO2 in COVID-19 subjects with acute hypoxic respiratory failure (AHRF).Some patients with AHRF can progress to a more severe form of the disease called acute respiratory distress syndrome, which is associated with lung inflammation leading to low blood oxygenation, which is the major cause of COVID-19 disease fatalities."},
{"date_time": "Jun 30, 2020 • 6:24 am CDT", "title": "Seniors Need Flu Shots When Traveling", "content": "The European Commission has given regulatory approval for the 1st adjuvanted quadrivalent influenza vaccine designed to protect those aged 65 and over.Announced by UK-based Seqirus on June 8, 2020, this new vaccine is designed to give enhanced protection to people aged 65 and over in comparison to standard influenza vaccines."},
{"date_time": "Jun 30, 2020 • 6:20 am CDT", "title": "United Airlines Will Investigate Non-Compliant Passengers", "content": "United Airlines announced that it will strengthen mandatory mask-wearing policies to further mitigate against the spread of the SARS-CoV-2 coronavirus while flying.United said in a press statement on June 15, 2020, this effort will ‘help continue to keep passengers and crew safe.’ United continued saying ‘While the overwhelming majority of passengers are complying with United's mandatory policy, starting on June 18, 2020, any passenger that does not comply when onboard a United flight will be placed on an internal travel restriction list.’‘Customers on this list will lose their travel privileges on United for a duration of time to be determined pending a comprehensive incident review.’"},
{"date_time": "Jun 30, 2020 • 6:17 am CDT", "title": "ICE Reports 1% Coronavirus Infection Rate", "content": "As part of U.S. Immigration and Customs Enforcement’s (ICE) proactive efforts to expand COVID-19 testing capabilities, ICE began offering voluntary testing to all detainees at the Aurora, Colorado facility.The initial testing period took place from June 9 to June 18, 2020, ICE announced 427 detainees tested negative for COVID-19, 49 declined to be tested, and one test was inconclusive and 4 individuals were positive and are being treated.Current ICE guidance encourages facilities to isolate new admissions into the detention network for 14 days before introducing them to the general population."},
{"date_time": "Jun 30, 2020 • 6:12 am CDT", "title": "Pneumonia, Influenza, or COVID-19 Fatalities Decreased Again", "content": "The percentage of specimens testing positive for SARS-CoV-2, the virus that causes COVID-19 disease, decreased from Week #23 in some regions, reported the Centers for Disease Control and Prevention (CDC) on June 19, 2020.Furthermore, based on death certificate data, the CDC stated the percentage of deaths attributed to pneumonia, influenza, or COVID-19 (PIC) decreased from 11.4 percent during week #23 to 7.1 percent during week #24."},
{"date_time": "Jun 29, 2020 • 7:13 pm CDT", "title": "67% of Parents Say Their Kids Will Go To School", "content": "A University of Michigan poll published on June 26, 2020, found about 2/3 of public school parents in Illinois, Michigan, and Ohio indicate they will send their children to K-12 classrooms for the Fall 2020 semester.However, 12% of these guardians/parents indicated the would not send their children to a physical school this year.\"On the one hand, sending children to school could increase the risk of COVID-19 among children and family members. On the other hand, children who don't return to in-person school may experience disruptions in their education,\" said these researchers in a press statement."},
{"date_time": "Jun 29, 2020 • 7:03 pm CDT", "title": "Study's Identify Multisystem Inflammatory Syndrome in Children ", "content": "On June 29, 2020, the NEJM published 3 studies/article focused on the suspected COVID-19 disease-related inflammatory syndrome reported in children. The 1st study involving 186 kids in 26 states, concluded saying the 'multisystem inflammatory syndrome in children associated with SARS-CoV-2 led to serious and life-threatening illness in previously healthy children and adolescents.'While the 2nd study involving 191 suspected patients in New York during early May 2020, the New York State Department of Health said 'this hyperinflammatory syndrome with dermatologic, mucocutaneous, and gastrointestinal manifestations was associated with cardiac dysfunction.'In a related commentary, Michael Levin, Ph.D., of the Imperial College of London, said 'a consistent clinical picture is emerging... multisystem inflammatory syndrome in children occurs 2 to 4 weeks after infection with SARS-CoV-2.'"},
{"date_time": "Jun 29, 2020 • 2:03 pm CDT", "title": "CDC Publishes Commercial Lab Seroprevalence Data", "content": "The U.S. CDC published updated regional COVID-19 seroprevalence data from Connecticut, South Florida, the New York City metro area, Missouri, Utah, and Western Washington State for SARS-CoV-2 antibodies.As more data become available, tables and data charts will be added to this CDC page to show the early antibody test results for patient specimens tested in these areas."},
{"date_time": "Jun 29, 2020 • 1:52 pm CDT", "title": "Gargling Salt Water May Reduce COVID-19 Symptoms", "content": "Researchers at the University of Edinburgh said on June 25, 2020, sea salt may work by boosting cells’ antiviral defense that kicks in when they are affected by a common cold. These researchers now aim to investigate whether the same solution will benefit those who are experiencing symptoms of the new strain of coronavirus, which causes COVID-19.The ELVIS COVID-19 study is recruiting adults in Scotland with recent COVID-19 symptoms or a confirmed case of COVID-19 disease. One study group will be asked to gargle and clear their nose with saltwater.A secondary analysis of data from the Edinburgh and Lothians Viral Intervention Study (ELVIS) pilot randomized controlled trial, indicates that hypertonic saline nasal irrigation and gargling reduced the duration of coronavirus upper respiratory tract infection by an average of 2.5 days."},
{"date_time": "Jun 29, 2020 • 10:25 am CDT", "title": "China Approves 1st Coronavirus Vaccine", "content": "China's Central Military Commission approved the use of the vaccine by the military on June 25, 2020, for a period of 1-year, according to media reports.The Ad5-nCoV vaccine is a genetically engineered vaccine candidate with the replication-defective adenovirus type 5 as the vector to express SARS-CoV-2 spike protein."},
{"date_time": "Jun 29, 2020 • 8:54 am CDT", "title": "Houston's Coronavirus Tests May Be Fake", "content": "Criminals have found yet another way to take advantage of the COVID-19 pandemic in Houston, Texas, by selling fake antibody tests. According to ABC13 News on June 29, 2020, in addition to producing incorrect coronavirus infection test results, the FBI says these criminals are really after your personal information.These test scammers are interested in private information such as your name, birth date, social security number, Medicare, or health insurance information."},
{"date_time": "Jun 29, 2020 • 7:56 am CDT", "title": "Summer Cruise Voyages Canceled", "content": "Cruise ships announced an extension of the suspension of voyages embarking between August 1 and September 30, 2020. Previously, the U.S. CDC issued a Level 3 Travel Alert that recommends travelers defer all cruise travel worldwide."},
{"date_time": "Jun 29, 2020 • 7:48 am CDT", "title": "Airport Screening Heats-Up", "content": "Airports around the world, such as Los Angeles International (LAX), have installed thermal cameras that scan passengers for high temperatures. If a passenger is found to have a body temperature of 100.4 or higher, LAX staff will request the 2nd screening.And, that passenger could be referred to the Centers for Disease Control and Prevention staff, which could instruct that person into quarantine."},
{"date_time": "Jun 29, 2020 • 7:17 am CDT", "title": "Oral COVID-19 Vaccine Selected For Operation Warp Speed", "content": "A South San Francisco based biotechnology company announced on June 26, 2020, that its oral COVID-19 vaccine candidate has been selected to participate in a non-human primate challenge study, organized and funded by the U.S. government’s Operation Warp Speed.“Our vaccine is a room temperature-stable tablet, an enormous logistical advantage in large vaccination campaigns.”"},
{"date_time": "Jun 29, 2020 • 7:12 am CDT", "title": "Coronaviruses Follow Similar Seasonal Influenza Patterns", "content": "University of Michigan researchers conclude human coronaviruses and influenza are primarily seasonal. Furthermore, coronaviruses appear to transmit similarly to influenza in the same population, according to a new study published by the Journal of Infectious Diseases, July 1, 2020, Volume 22 edition."},
{"date_time": "Jun 29, 2020 • 7:07 am CDT", "title": "Which Facemask Should Food Service Staff Wear?", "content": "Respirators, disposable facemasks, or cloth face coverings are designed for different purposes. This fact sheet, developed in collaboration with CDC, provides a quick reference to these items potentially worn by workers in the Food and Agriculture Sector."},
{"date_time": "Jun 28, 2020 • 10:27 am CDT", "title": "Has the COVID-19 Pandemic Peaked Near You?", "content": "After an initial surge of cases in China in January, Europe’s average count of coronavirus-related fatalities overtook Asia in early March 2020, with Italy, Spain, and the UK becoming the new global hotspots. From mid-April, the focus shifted to the USA where the number of fatalities remained consistently high and currently accounts for 12% of global fatalities.South America has recently seen its share increase to more than half of new COVID-19 disease fatalities, fueled by a surge in cases in Brazil, reported the FT.com, on June 28, 2020."},
{"date_time": "Jun 28, 2020 • 10:19 am CDT", "title": "Men Feel Wearing Face-Masks Isn't Cool", "content": "Male vanity appears to be a powerful factor in rejecting face masks, reported the WSJ on June 28, 2020. A study found that more men than women agreed that wearing a mask is “shameful, not cool, a sign of weakness, and a stigma.\"According to researchers from Middlesex University London in the U.K. and the Mathematical Science Research Institute in Berkeley, California, this study's finding suggests that making face coverings mandatory “has a larger effect on men ... than on women.”"},
{"date_time": "Jun 28, 2020 • 9:33 am CDT", "title": "Do Coronavirus and Influenza Viruses Differ?", "content": "“Unlike the influenza viruses, which peak at different times during the colder season from year to year, and even the rhinoviruses, which are most common in the autumn and spring, but are present year-round, the studied coronaviruses are sharply seasonal .... with little spread after May until November or December,\" reported a study published in the Journal of Infectious Diseases, Volume 222, on July 1, 2020.This means 'coronaviruses are sharply seasonal. They appear, based on serial interval and secondary infection risk, to have similar transmission potential to influenza A(H3N2) in the same population.'"},
{"date_time": "Jun 28, 2020 • 6:59 am CDT", "title": "Can Coronavirus Vaccine Developers Learn From Ebola?", "content": "A new report published in Nature on June 15, 2020, says 'there is an urgent need for global regulatory standardization to the development of vaccines for emergency preparedness, such as for the recent Ebola virus outbreak in Africa indicates.'Regulatory agencies need to remove roadblocks and put solutions in place that enable the rapid global development of preventive vaccines for SARS-CoV-2.'"},
{"date_time": "Jun 28, 2020 • 6:50 am CDT", "title": "COVID-19 Disease Fatal For Europe's Seniors", "content": "The WSJ reported on June 27, 2020, almost 80% of fatalities linked to Covid-19 disease in Europe during 2020 were in people over 75 years of age."}
]