[
{"date_time": "Jul 16, 2020 • 2:20 pm CDT", "title": "Columbia University Joins COVID-19 Research Collaboration", "content": "Tonix Pharmaceuticals Holding Corp. announced on July 16, 2020, it has entered into a research collaboration and option agreement with Columbia University. The research is designed to fill important gaps in understanding the detailed immune responses to COVID-19 disease and to provide a foundation upon which to target vaccines and therapeutics to appropriate individuals by precision medicine.The research collaboration will focus on T cell and antibody responses to SARS-CoV-2 (CoV-2), the virus that causes COVID-19 at the cellular level including human monoclonal antibodies and anti-idiotypes.The two principal investigators for the collaboration are Ilya Trakht, Ph.D., Associate Research Scientist, and Sergei Rudchenko, Ph.D., Assistant Professor of Medical Sciences at Columbia University Vagelos College of Physicians and Surgeons."},
{"date_time": "Jul 16, 2020 • 2:10 pm CDT", "title": "Russia Approves COVID-19 Treatment Study", "content": "RedHill Biopharma Ltd. announced on July 16, 2020, the Ministry of Health of the Russian Federation approved its Clinical Trial Authorization application for a Phase 2/3 study evaluating opaganib (Yeliva) as a COVID-19 treatment in patients hospitalized with severe SARS-CoV-2 infection and pneumonia.A study was also recently approved in the UK to evaluate Yeliva, and a similar application is under review in Italy."},
{"date_time": "Jul 16, 2020 • 12:12 pm CDT", "title": "Each Alaska District Has School Reopening Authority", "content": "As fall approaches, each US state is developing its own approach to school reopening, with plans varying widely. As an example, the state of Alaska is using the evidence-based Smart Start 2020 framework for the 2020-2021 academic year. Published on July 15, 2020, the Alaska Department of Education and Early Development (DEED) is requesting each district use this framework to build a comprehensive plan for teaching and learning in the upcoming school year and submit the plan to the department.However, the DEED guidance is not mandated, or state required, as local school districts have the authority, responsibility, and flexibility to make decisions for their communities.Another option to consider is the American Academy of Pediatrics's guidelines for school reopening, which recommend the goal of having students physically present in school."},
{"date_time": "Jul 16, 2020 • 11:04 am CDT", "title": "Good or Bad, AstraZeneca's COVID-19 Vaccine News Coming Soon", "content": "Clinical trial results on the AZD1222 SARS-CoV-2 vaccine candidate being developed by AstraZeneca and Oxford University will be published on July 20, 2020, The Lancet reported.The WHO’s chief scientist said in June that AZD1222 was probably the most advanced vaccine in terms of development, stated the Reuters."},
{"date_time": "Jul 16, 2020 • 10:01 am CDT", "title": "30 Employees Received Pre-Test Vaccinations", "content": "Sinovac announced that its employees, including top executives, received experimental shots of the CoronaVac SARS-CoV-2 vaccine even before the government approved testing in people, reported the AP on July 16, 2020.SinoPharm’s claim that 30 “special volunteers” rolled up their sleeves even before the company got permission for its initial human study."},
{"date_time": "Jul 16, 2020 • 9:43 am CDT", "title": "165 Countries Have Joined COVAX", "content": "Seventy-five countries have submitted expressions of interest to join the COVAX Facility, a mechanism designed to guarantee rapid, fair, and equitable access to COVID-19 vaccines worldwide reported the WHO on July 15, 2020.Together, this new group and previous country commitments, now total 165 countries that represent more than 60% of the world’s population.The goal of COVAX is by the end of 2021 to deliver two billion doses of safe, effective vaccines that have passed regulatory approval and/or WHO prequalification."},
{"date_time": "Jul 16, 2020 • 2:30 am CDT", "title": "Study: Antibody Response to SARS-CoV-2 Spike Proteins Does Differ", "content": "The U.S. FDA published an overview on July 10, 2020, which says 'although multiple vaccine candidates against SARS-CoV-2 based on viral spike protein are under development, there is limited information on the scientific quality of antibody responses generated against them.'This new study found three antigens (S1+S2 ectodomain, S1 domain, and RBD) generated strong neutralizing antibodies against SARS-CoV-2... but not S2."},
{"date_time": "Jul 16, 2020 • 2:06 am CDT", "title": "Coronavirus Fatalities is Not the Only Concern", "content": "An article in The Guardian on July 12, 2020, concluded that saying only 1% of people who get COVID-19 disease will die isn’t entirely wrong.But there’s a problem. Fatalities are not the only issue that a disease can cause.As an example, measles kills about 0.2% of people who catch it, but it leaves some people deaf, others with brain damage, and may cause permanent immune system damage."},
{"date_time": "Jul 15, 2020 • 5:38 pm CDT", "title": "Kidney Co-Morbidities Reported Most Often With Hospitalized COVID-19 Patients", "content": "Chronic kidney disease and kidney failure were the most common underlying conditions in hospitalized COVID-19 patients, according to a Fair Health report published on July 14, 2020.Diabetes type 2 was the second-ranked comorbidity of patients hospitalized for COVID-19 in the USA, between January-May 2020."},
{"date_time": "Jul 15, 2020 • 5:27 pm CDT", "title": "Plaquenil Antiviral Found Ineffective When Treating Serious COVID-19 Patients", "content": "A non-peer-reviewed study published on July 15, 2020, found patients hospitalized with COVID-19, hydroxychloroquine was not associated with reductions in 28-day mortality in COVID-19 disease patients, but was associated with an increased length of hospital stay, and increased risk of progressing to invasive mechanical ventilation or death."},
{"date_time": "Jul 15, 2020 • 3:54 pm CDT", "title": "Pittsburgh Seeking 750 Vaccine Study Participants", "content": "Researchers are looking for 750 people to join clinical trials for vaccine candidates that hopefully will prevent infections from the SARS-CoV-2 coronavirus that causes COVID-19 disease, the University of Pittsburgh Medical Center said on July 15, 2020.Recruitment for the Pittsburgh location for the trials is beginning immediately. The initial vaccine candidate being tested is from Moderna Inc., mRNA-1273, which is an mRNA vaccine.Click here to learn more and to sign up for the Pittsburgh-based trials."},
{"date_time": "Jul 15, 2020 • 10:26 am CDT", "title": "Sections of Spain Return to Lockdown", "content": "About 160,000 residents living in the Catalonia region were instructed to returned home-confinement on July 15, 2020, as Spain's health authorities relaunch coronavirus control and reduction measures. This region reported nearly 1,000 cases in the previous 24 hours, said TheLoca l.Catalan authorities are also watching SARS-CoV-2 infection rates in this northeastern region, notably advising that the residents near Hospitalet de Llobregat, a city with 260,000 residents -- only leave home for urgent necessities."},
{"date_time": "Jul 15, 2020 • 8:52 am CDT", "title": "22 European Countries Successfully Reopened Schools", "content": "According to the WSJ reporting on July 14, 2020, there have been 22 eu­ropean coun­tries that re­opened schools this spring largely avoided coronavirus out­breaks, with no ma­jor flare-ups af­ter stu­dents re­turned to class­rooms.Continued school closures risk “scarring the life chances of a generation of young people,” according to an open letter signed on June 17, 2020, by more than 1,500 members of the United Kingdom’s Royal College of Paediatrics and Child Health."},
{"date_time": "Jul 15, 2020 • 7:38 am CDT", "title": "Friday Night Lights Delayed in Austin", "content": "In the football loyal area of central Texas, Austin-Travis County Interim Health Authority Dr. Mark Escott took a range of actions to enhance protections against the spread of COVID-19 effective July 14, 2020.According to this Order, school systems, such as football-focused Westlake and Lake Travis, cannot reopen for on-campus, face-to-face instruction until after Sept. 7th. Additionally, no extracurricular sports or activities are allowed to take place until school systems reopen for on-campus instruction.Which means, the famous Friday Night Lights high-school games in Texas will be delayed in 2020."},
{"date_time": "Jul 15, 2020 • 6:14 am CDT", "title": "Inaccurate Test Reporting Confuses Public", "content": "Several lab companies that process coronavirus tests from Florida have reported incomplete data to the state, creating discrepancies in the numbers public health officials rely on to track the pandemic across Florida communities, reported the Orlando Sentinel on July 14, 2020.About 2.7 million coronavirus tests have been conducted in and the number of unreported negative tests is unclear."},
{"date_time": "Jul 15, 2020 • 6:01 am CDT", "title": "Status: 179 Coronavirus Tests Authorized", "content": "As of July 14, 2020, the U.S. FDA has authorized 179 coronavirus diagnostic tests under emergency authorizations, which include 148 molecular tests, 29 antibody tests, and 2 antigen tests."},
{"date_time": "Jul 15, 2020 • 2:10 am CDT", "title": "New York's Enforcement Teams Great Visitors With Mandates and $2,000 Fines", "content": "The Governor of New York issued an Order of Summary Action which means that visitors to New York from 19 US states 'must' provide their contact information upon arrival. Failure to comply with this Order can result in a non-disputable summon and fines up to USD $2,000.“We’re serious about enforcing quarantine,” New York Governor Cuomo tweeted on July 13, 2020.Enforcement teams will be stationed at airports statewide to meet arriving aircraft at airport gates and greet disembarking passengers to request proof of completion of the State Department of Health traveler form."},
{"date_time": "Jul 14, 2020 • 6:30 pm CDT", "title": "Does Blood Type O Actually Reduce COVID-19 Risk?", "content": "Dr. Lewis Kaplan, a professor of surgery at the University of Pennsylvania who is president of the Society of Critical Care Medicine, offered the following insight to NBC News on July 7, 2020. 'Even if some people have reduced risks based on blood type, such as O, they don't have zero risks,' Dr. Kaplan said.'It might mean they have less risk, but if you engage in risky behavior, we don't know just how much risk you need to incur to overwhelm the immune protection you might have.'"},
{"date_time": "Jul 14, 2020 • 4:33 pm CDT", "title": "Coronavrius Vaccines Show Positive Study Results", "content": "Moderna, Inc. announced on July 14, 2020, the interim analysis of the open-label Phase 1 study of its mRNA-1273 vaccine candidate published in the NEJM which evaluated a 2-dose vaccination schedule.Results from participants in the initial dose cohorts who received both vaccinations and were evaluated at pre-specified timepoints show the mRNA-1273 vaccine induced rapid and strong immune responses against SARS-CoV-2."},
{"date_time": "Jul 14, 2020 • 3:04 pm CDT", "title": "Florida Department of Health: 'some labs have over-reported positive test results'", "content": "Various testing labs in Florida have reported a 100% positivity rate, which means every single person tested was positive for coronavirus. Other Florida labs had very high positivity rates. FOX 35 News found on July 14, 2020.As an example, FOX 35 reporting showed that Orlando Health had a 98% positivity rate. However, when FOX 35 News contacted the hospital, they confirmed errors in the report.Orlando Health's positivity rate was actually only 9.4%."},
{"date_time": "Jul 14, 2020 • 10:26 am CDT", "title": "Where Can I Get a US Passport?", "content": "To prevent the spread of the coronavirus that causes COVID-19 disease, the US Department of State 'significantly reduced passport operations in March 2020 and temporarily suspended expedited passport processing and restricted service to cases involving life-or-death emergencies.As US states begin to reopen, the State Department is resuming operations in 'phases'.As of Monday, July 13, 2020, there are 5 passport agencies and centers in phase two and 11 others in phase one of our reopening plan. US passport services will assist customers who need a passport in the next 72 hours (3 business days) for a life-or-death emergency."},
{"date_time": "Jul 14, 2020 • 8:40 am CDT", "title": "Plant-Based Vaccine Launches Phase 1 Study", "content": "A plant-derived COVID-19 vaccine candidate announced it administered the first doses in healthy human volunteers on July 14, 2020. Unlike traditional vaccination development, Medicago does not use animal products or live viruses to create its products. Instead, it uses Virus-Like Particles that mimic the shape and dimensions of a virus, which allows the body to recognize them and create an immune response in a non-infectious way.Medicago said it is also planning a Phase 2/3 trial to be initiated this October 2020."},
{"date_time": "Jul 14, 2020 • 8:32 am CDT", "title": "Vaccine Candidate Avoids the D614G Mutation", "content": "IMV Inc. announced on July 14, 2020, it received an agreement with Health Canada on Phase 1 clinical study design protocol. According to the company, the selected vaccine targets are located outside of the 614 mutation which, according to recent research, has been demonstrated to increase the coronavirus’s ability to infect cells, and suggested to potentially reduce vaccine-induced immunity."},
{"date_time": "Jul 14, 2020 • 8:13 am CDT", "title": "MIT & 3M Developing Rapid Coronavirus Detection Test", "content": "3M and researchers at MIT said on July 14, 2020, they are testing a new rapid test that detects the coronavirus. The test is in the Rapid Acceleration of Diagnostics Tech (RADx Tech) program, an aggressively-paced COVID-19 diagnostics initiative from the NIH’s National Institute of Biomedical Imaging and Bioengineering."},
{"date_time": "Jul 14, 2020 • 5:07 am CDT", "title": "Madrid Spain's Symptoms Include the Loss of Smell", "content": "A new study published in The Lancet on July 8, 2020, found the majority (95%) of the Spanish population is seronegative to SARS-CoV-2 infection, even in hottest-areas, such as Madrid (10%).Specifically, individuals with anosmia (the loss of the sense of smell) or at least 3 identifiable symptoms, the seroprevalence reached about 15%."},
{"date_time": "Jul 13, 2020 • 11:56 pm CDT", "title": "Houston Basketball Star Tests Positive For Coronavirus", "content": "The NBA Houston Rockets superstar Russell Westbrook said via Twitter on July 13, 2020, that he had recently tested positive for the novel coronavirus SARS-CoV-2, and is now in quarantine. Westbrook, a 9-time All-Star, becomes the NBA’s most visible player infected with SARS-CoV-2.The NBA’s “bubble site\" in Orlando, is where the 2019-20 season will restart, has recently become a Florida hot-spot for COVID-19 disease cases."},
{"date_time": "Jul 13, 2020 • 11:47 pm CDT", "title": "Russian COVID-19 Vaccine Availability Begins Mid-August 2020", "content": "The Gamalei Center's leader Alexander Gintsburg stated on July 13, 2020, that he hopes the Russian COVID-19 vaccine will “enter civil circulation” on Aug. 12-14, 2020. He added that he hopes private companies would begin mass production by September 2020, reported the Moscow Times.“The research has been completed and it proved that the vaccine is safe,” Yelena Smolyarchuk, the head of Sechenov University’s clinical research center, told TASS."},
{"date_time": "Jul 13, 2020 • 7:49 pm CDT", "title": "Coronavirus Test Results Delivered in .... 7 Days", "content": "Demand for COVID-19 testing continues to soar, further extending turnaround times for test results, stated Quest Diagnostics on July 13, 2020, one of the largest labs in the USA.As a result, our average turnaround time for reporting test results is more than 1 day for priority 1 patients. However, the average turnaround time for all other populations is 7 or more days.But, there is some good news .... by the end of July 2020, Quest expects to have the capacity to perform 150,000 molecular diagnostic tests a day."},
{"date_time": "Jul 13, 2020 • 7:24 pm CDT", "title": "New Zealand Opens Back Up", "content": "Although many governments around the world are still advising against “non-essential” international travel, a number of travel destinations are beginning to ease their COVID-19 disease lockdown measures and border restrictions and are moving toward welcoming tourists back.On July 1, the European Union announced it would be reopening its external border to 15 countries in a bid to boost its travel industry.And now, New Zealand is operating under Alert Level 1, which means people within New Zealand are able to travel and mix more freely. However, people entering New Zealand must stay in managed isolation or quarantine for at least 14 days and test negative for COVID-19 before they can go into the community.As of July 13, 2020, New Zealand reported 25 active cases, said the U.S. Embassy."},
{"date_time": "Jul 13, 2020 • 6:07 pm CDT", "title": "Antibody Response Informs Vaccine Design", "content": "Scientists from the U.S. FDA have identified specific areas on the so-called ‘spike protein’ of SARS-CoV-2 coronavirus that appears to be key to triggering strong protective antibody responses ... in rabbits.The spike proteins are molecules emerging from the surface of the virus, one part of which the virus uses to attach to a cell and another to fuse with the cell membrane, enabling SARS-CoV-2 to infect the cell, reported the FDA on July 10, 2020."},
{"date_time": "Jul 13, 2020 • 5:59 pm CDT", "title": "Airborne Transmission:  Theoretical Considerations of the Available Evidence", "content": "'All told, the current understanding about SARS-CoV-2 transmission is still limited,' said researchers in a study published in JAMA on July 13, 2020. There are no perfect experimental data proving or disproving droplet vs aerosol-based transmission of SARS-CoV-2.The balance of evidence, however, seems inconsistent with the aerosol-based transmission of SARS-CoV-2, particularly in well-ventilated spaces, and outdoors.To be sure, there are 'rarely absolutes in biological systems since people produce both droplets and aerosols' and virus transmission may take place along a long spectrum of options."},
{"date_time": "Jul 13, 2020 • 5:06 pm CDT", "title": "France Lacks Population Immunity", "content": "The country of France has been heavily affected by the SARS-CoV-2 pandemic and went into a national lockdown on March 17, 2020. To better understand the impact, a new analysis found that 2.9% of virus-infected individuals were hospitalized and 0.5% of those who were severely infected patients died.And across all ages, men are more likely to be hospitalized, enter intensive care, and die.Furthermore, this study published on July 11, 2020, says 'France's population immunity appears to be insufficient.'"},
{"date_time": "Jul 13, 2020 • 4:48 pm CDT", "title": "COVID-19 Antibody Protection Wanes In Months", "content": "COVID-19 patients who have recovered from the coronavirus-caused disease may lose their immunity within a few months, reported a non-peer-reviewed study, which was published on July 11, 2020.This study has important implications when considering widespread serological testing, antibody protection against re-infection, and the durability of vaccine protection.These researchers suggest that this transient antibody response is a feature shared by both a SARS-CoV-2 infection and the circulating seasonal coronaviruses that are associated with common colds. Coronaviruses are the 2nd leading cause of the common cold, after rhinoviruses, says the U.S. CDC."},
{"date_time": "Jul 13, 2020 • 3:27 pm CDT", "title": "US Army Dispatches Medical Reinforcements to Texas", "content": "Texas Governor Greg Abbott announced on July 13, 2020, the U.S. Army Urban Augmentation Medical Task Forces (UAMTF) has been mobilized to assist the state's efforts to combat the COVID-19 disease outbreak. At the Governor's request, one UAMTF unit already arrived in San Antonio on July 6th, with additional units soon to arrive in other cities.These UAMTF teams consist of medical and support professionals who are being deployed to support medical needs in hospitals throughout the state of Texas."},
{"date_time": "Jul 13, 2020 • 2:16 pm CDT", "title": "K-State Co-Developing Coronavirus Vaccine Candidate", "content": "Tonix Pharmaceuticals announced on July 13, 2020, a new preclinical research and option agreement with Kansas State University (K-State) to develop a vaccine candidate for the prevention of COVID-19 that utilizes a novel live virus vaccine vector platform and the CD40-ligand, also known as CD154 or 5c8 antigen, to stimulate T cell immunity.K-State will advance the preclinical development of a live replicating virus vaccine to protect against COVID-19 based on the bovine parainfluenza virus.“As the world’s foremost global food and biosecurity science university, K-State is committed to understanding and combatting zoonotic diseases and the viruses that cause them like SARS-CoV-2,” said Dr. Peter Dorhout, Vice President for Research at K-State."},
{"date_time": "Jul 13, 2020 • 1:39 pm CDT", "title": "Novel Biologic Approved For Hospitalized COVID-19 Patients in India", "content": "Biocon Ltd. presented key insights into the results of the pivotal study that demonstrated its novel biologic, Itolizumab, significantly reduced mortality in moderate to severe ARDS (acute respiratory distress syndrome) patients hospitalized with COVID-19, in India.This information led to the Drug Controller General of India approving this novel biologic therapy, Itolizumab, for restricted emergency use in India, on July 13, 2020."},
{"date_time": "Jul 13, 2020 • 11:03 am CDT", "title": "Disneyland Closes in Hong Kong Again", "content": "Hong Kong Disneyland is closing on July 15, 2020, after an outbreak of COVID-19 disease was confirmed, according to a theme park blog. Hong Kong Disneyland reopened on June 18, 2020, with limited capacity and increased health and safety measures.According to WDW News Today, there were about 50 new coronavirus cases reported in the Hong Kong region on July 13th.Across the world in Orlando, Florida, Disney guests may have to get their temperature taken. If any member of a party has a temperature of 100.4 or higher, the entire party will be denied entry.But, a “cool off” period will be allowed if a Guest fails the screening the first time, just to make sure no environmental causes could be the reason for high temperature, stated this blog post."},
{"date_time": "Jul 13, 2020 • 10:23 am CDT", "title": "China Vaccine Production Factory Breaks Ground", "content": "China's new COVID-19 vaccine factory in a free-trade zone near the city of Ningbo, in Zhejiang province, announced its groundbreaking on July 11, 2020. The project is implemented in three phases, of which the first phase invests 1.3 billion yuan to build a new crown vaccine industrialization, high-level biological laboratory, and a new human rabies vaccine.Ningbo authorities expected the vaccine production lines to be operational by March 2021, said a digital media post from the local government."},
{"date_time": "Jul 13, 2020 • 9:54 am CDT", "title": "Which Virus Caused Pneumonia ... Coronavirus Or Influenza", "content": "Using CT scans to distinguish the source of pneumonia between COVID-19 disease and from an influenza virus is very complicated. A new study published in July 2020, found 'most lesions in patients with COVID-19 pneumonia were located in the peripheral zone and close to the pleura.Whereas, the influenza infections generated pneumonia cases were more prone to show mucoid impaction and pleural effusion.This study found that the axial distribution of COVID-19 pneumonia was most often in the peripheral zone (67.3%), and the most important characteristic was that the largest lesion was close to the pleura (69.2%).Lesions from influenza virus pneumonia had more diffuse (35.6%) or random (33.3%) distribution and the largest lesion was close to the pleura (40%) less often than was seen in patients with COVID-19 pneumonia."},
{"date_time": "Jul 13, 2020 • 9:38 am CDT", "title": "Study: Live Bio-Therapeutic Treatment for COVID-19 Patients Improves Outcomes", "content": "ExeGi Pharma announced on July 13, 2020, the results of a 70-patient clinical trial evaluating a new biologic drug candidate in hospitalized COVID-19 patients. This study compared outcomes of patients who received standard drug treatments alone or standard treatments combined with an oral bacteriotherapyAll patients treated in this study with standard therapy plus bacteriotherapy survived the COVID-19 illness, and none required invasive mechanical ventilation or ICU admission."},
{"date_time": "Jul 13, 2020 • 9:12 am CDT", "title": "Another COVID-19 Vaccine Receives Fast-Track Status", "content": "On July 13, 2020, Pfizer Inc. and BioNTech SE announced that 2 of the companies’ 4 investigational vaccine candidates from their BNT162 mRNA-based vaccine program received Fast Track designation from the U.S. FDA.Subject to regulatory approval, the companies are expecting to start a Phase 2b/3 trial later this summer and are anticipating enrolling up to 30,000 subjects."},
{"date_time": "Jul 13, 2020 • 5:11 am CDT", "title": "Queensland Doses 1st Coronavirus Vaccine ", "content": "The first human clinical trial of the University of Queensland's COVID-19 vaccine candidate launched on July 13, 2020. Up to 120 adult volunteers will receive a dose of the vaccine at the Brisbane clinic in Australia.“Testing showed that the vaccine was effective in inducing antibodies that were able to neutralize the virus. Further studies have shown that the vaccine was safe to give to people.”"},
{"date_time": "Jul 12, 2020 • 8:23 pm CDT", "title": "Children and Women Report Fewer Coronavirus Cases", "content": "In a population-based study in Iceland published in NEJM, researchers found young children and females were less likely to test positive for SARS-CoV-2 than adolescents or adults and males.Whether the lower incidence of coronavirus infection in these 2 groups resulted from less exposure to the virus, or from biologic resistance, was not known by these researchers."},
{"date_time": "Jul 12, 2020 • 6:53 pm CDT", "title": "US Government Extends COVID-19 Testing in It's #3 and #9 Metro Areas", "content": "On July 12, 2020, Texas Governor Greg Abbott announced that the U.S. Department of Health and Human Services has extended federal support of Community Based Testing Sites in Dallas and Houston through July 31, 2020.\"There are over 900 testing sites across the state of Texas, and I urge Texans in need of a SARS-CoV-2 coronavirus test to find a site nearest them.\"As of July 12, 2020, the state of Texas, with 29 million residents, had confirmed over 3,200 fatalities related to COVID-19 disease."},
{"date_time": "Jul 12, 2020 • 3:35 pm CDT", "title": "Russian Coronavirus Vaccine Passes Test", "content": "On July 12, 2020, Sechenov University announced the completion of the Russia COVID-19 vaccine candidate's clinical trial. The university began clinical trials of the vaccine produced by Russia’s Gamalei Institute of Epidemiology and Microbiology on June 18th."},
{"date_time": "Jul 12, 2020 • 11:39 am CDT", "title": "CDC Update: Mortality Rate Declines for 11th Week", "content": "Based on death certificate data, the U.S. CDC reported the percentage of deaths attributed to pneumonia, influenza, or COVID-19 disease (PIC) decreased from 6.9% during week #26 to just 5.5% during week #27.This CDC data represents the 11th week of declining mortality percentages due to PIC in the USA, as of July 10, 2020."},
{"date_time": "Jul 12, 2020 • 11:25 am CDT", "title": "Editorial: Vaccines & Convalescent Plasma for COVID-19", "content": "A new editorial published by BMJ on July 9, 2020, says 'We have good reason to be cautious about these preventive vaccines and passive immunity approaches. Passive immunity, using convalescent plasma from recovered patients or monoclonal antibodies with high levels of neutralizing antiviral activity, has the potential for both therapy and prevention.''Understandably, there are great public expectations that these efforts will be successful, but caution is necessary with respect to both vaccines and passive immunity.''These immunological tools will at best complement public health vigilance, preparedness, and early control measures, which will remain vital for combating future potential pandemics.'"},
{"date_time": "Jul 12, 2020 • 10:29 am CDT", "title": "Chinese Vaccine Company Discusses Phase 3 Study", "content": "CanSino Biologics announced on July 11, 2020, it is in talks with Russia, Brazil, Chile, and the Kingdom of Saudi Arabia to launch a Phase III clinical trial of its experimental COVID-19 vaccine known as Ad5-nCoV, reported Reuters."},
{"date_time": "Jul 12, 2020 • 10:06 am CDT", "title": "Hungary Launches Red, Yellow, and Green Travel Bans", "content": "Hungarian authorities announced on July 12, 2020, that they would put countries in 3 categories – red, yellow, and green – based on their rate of new coronavirus infections. And, travel restrictions including entry bans and mandatory quarantines will be imposed, depending from which country people were coming from, reported Reuters on Twitter.Red category countries are banned for entry, which includes, but are not limited to, Albania, Ukraine, Belarus, and all of Asia, Africa, and South & Central America. Hungarian citizens arriving from those locations will be quarantined for 2-weeks or until they test negative twice, 48 hours apart.Hungary, which has a population of around 10 million, had recorded 595 coronavirus related fatalities during 2020."},
{"date_time": "Jul 12, 2020 • 9:53 am CDT", "title": "COVID-19 Symptoms Linger For Months", "content": "Almost 90% of COVID-19 disease patients discharged from a Rome, Italy hospital were experiencing at least 1 related symptom 2-months later, reported a study published in JAMA on July 9, 2020 shows. Fatigue and shortness of breath were the most common symptoms found.And, 55% of COVID-19 patients were still experiencing 3 symptoms after discharge."},
{"date_time": "Jul 11, 2020 • 2:04 pm CDT", "title": "Can Schools Learn Reopening Lessons Already Learned", "content": "When Science looked at reopening strategies from South Africa to Finland to Israel on July 7, 2020, some encouraging patterns emerged. Together, they suggest a combination of keeping student groups small and requiring masks and some social distancing helps keep schools and communities safe.And, that younger children rarely spread the virus to one another or bring it home.But it isn’t just about the adjustments a school makes. It’s also about how much virus is circulating in the community, which affects the likelihood that students and staff will bring COVID-19 into their classrooms."},
{"date_time": "Jul 11, 2020 • 1:25 pm CDT", "title": "Arizona's Mutated Coronavirus Found Very Infectious", "content": "Over 90% of the SARS-CoV-2 coronavirus samples from Arizona have a mutation (D614G) that researchers hypothesize makes this version of the virus more infectious, reported AZcentra l on July 11, 2020.This mutated strain of the virus is the same one that researchers first identified in April 2020 as the dominant strain in Arizona. Researchers initially thought that this strain was no more infectious than other strains, but was merely dominant due to chance.\"The earlier strains that came into Arizona didn't have this (D614G) mutation and those strains didn't go on in most cases to cause any type of sustained outbreaks,\" David Engelthaler Ph.D., said. \"They typically fizzled out.\"So far, no mutations, including this one, have been found to interfere with vaccine development that is underway, according to Engelthaler."},
{"date_time": "Jul 11, 2020 • 11:06 am CDT", "title": "Airline Issues Yellow-Cards For Onboard Infraction", "content": "Similar to the sport of soccer, Alaska Airlines is now issuing yellow-card warnings to passengers who do not comply with instructions regarding wearing a face covering, Alaska stated a blog on June 30, 2020,'Our flight attendants are empowered to issue a final notice to any guest who repeatedly refuses to wear a face-covering onboard our aircraft.''With that warning – in the form of a yellow card – the guest’s (future) travel with us will be reviewed and could be suspended for a period on time.'"},
{"date_time": "Jul 11, 2020 • 9:58 am CDT", "title": "Japan's Okinawa Confirms Coronavirus Outbreak at US Military Bases", "content": "A new batch of COVID-19 disease cases have been detected at U.S. military bases in the Okinawa Prefecture of Japan, reported the Japan Times on July 11, 2020. Local media reported that several US military facilities were involved, including Marine Corps Air Station Futenma and Camp Hansen.On July 9, 2020, the US Navy and Marine Corps in Japan, began isolating coronavirus cases at their installations on Okinawa, a southern island of Japan."},
{"date_time": "Jul 11, 2020 • 9:25 am CDT", "title": "When Traveling ... You Should Wear Face-Coverings", "content": "Because the SARS-CoV-2 virus is currently spreading in the USA and abroad, the U.S. CDC recommends that everyone wear a cloth face covering over their nose and mouth when traveling.Cloth face coverings may slow the spread of the coronavirus that causes COVID-19 disease by helping keep people who are infected from spreading the virus to others.However, medical masks and N-95 respirators are intended for healthcare staff and first responders, according to the CDC's updated guidance."},
{"date_time": "Jul 11, 2020 • 8:13 am CDT", "title": "Queens NY Infection Rate Rapidly Accelerates", "content": "The New York Times reported new data on July 9, 2020, that about 68% of people tested positive for SARS-CoV-2 antibodies at a clinic located in Corona, Queens, New York. And another clinic located in the Jackson Heights section of Queens report 56% of tested patients were also positive.Just 3-weeks ago, the CityMD clinic had administered about 300,000 antibody tests in NYC and found just 26% of the tests came back positive for this virus's antibodies.This news reported indicates the SARS-CoV-2 continues to spread in the NYC area."},
{"date_time": "Jul 10, 2020 • 6:06 pm CDT", "title": "DoD Overcomes Coronavirus To Achieve Recruitment Goals", "content": "The COVID-19 disease pandemic hasn't put a damper on the recruitment of new soldiers or airmen at basic training facilities, reported the U.S. DoD on July 10, 2020. Both the Army and the Air Force test new recruits for COVID-19 upon arrival on station, with about 2% of those new recruits testing positive for COVID-19.However, there have only been 3 active-duty fatalities related to COVID-19 reported during 2020.Initially, the Air Force had wanted about 38,000 new recruits this year, Air Force Maj. Gen. Andrea D. Tullos said. But the service has reduced that to about 35,500. That, she said, 'is due in large part to better retention.'And, Army Maj. Gen. Lonnie G. Hibbard, commander of the Army Center for Initial Military Training, said 'the Army's recruitment and retention are similarly situated.'"},
{"date_time": "Jul 10, 2020 • 2:30 pm CDT", "title": "Did Italy Defeated COVID-19's Onslaught ", "content": "Once a leader in COVID-19 disease fatalities, new data indicates Italy is returning to a 'new normal. In the early days of the coronavirus pandemic in Italy, the 500-bed hospital Policlinico San Donato in Milan was caring for about 600 coronavirus patients, reported MedpageToday on July 7, 2020.Now, the hospital's chief cardiac surgeon says 'his unit is now operating between 40% to 50% of its normal volume.'On July 10, 2020, updated trend data shows Italy, with a population of about 60 million residents, reported just 276 new cases and 12 new fatalities related to SARS-CoV-2 coronavirus."},
{"date_time": "Jul 10, 2020 • 12:49 pm CDT", "title": "Study: BCG Vaccination Associated With Reduced COVID-19 Mortality", "content": "Researchers at the National Institute of Allergy and Infectious Diseases of the U.S. NIH identified on July 9, 2020, a linkage between the very old Bacille Calmette-Guerin (BCG) and the COVID-19 disease after comparing mortality rates around the world.After mitigating multiple confounding factors, these researchers found that some Latin American regions reported lower fatality rates than the USA, such as New York.'The consistent association between BCG vaccination and reduced severity of COVID-19 observed in these and other epidemiological explorations is remarkable, but not sufficient to establish causality between BCG vaccination and protection from severe COVID-19,' stated these researchers.To clarify this association, a phase 4 vaccine study was launched in April 2020 by Harvard’s School of Public Health, the University of Texas MD Anderson Cancer Center, Cedars Sinai Medical Center, the Baylor College of Medicine, and Texas A&M University."},
{"date_time": "Jul 10, 2020 • 9:26 am CDT", "title": "New Mexico Cancels Foot-Ball", "content": "The New Mexico Activities Association announced on July 9, 2020, that it will be postponing the 2020 football and soccer seasons ... moving them to the Spring 20121 semester.Local media reported NM Governor Michelle Lujan Grisham stated: “No contact sports are going to be permitted this fall.”"},
{"date_time": "Jul 10, 2020 • 9:09 am CDT", "title": "When Can I Return to Work After Traveling Abroad?", "content": "All international travelers should stay home for 14 days after their arrival into the USA, stated the U.S. CDC on May 28, 2020. To protect yourself when abroad, pre-travel vaccination information is found on this webpage."},
{"date_time": "Jul 10, 2020 • 8:57 am CDT", "title": "Wearing Face Masks Work Best", "content": "The wearing of face masks - including cloth-based coverings - has been widely recommended by public health officials around the world during the COVID-19 pandemic.A recent study found well-fitted homemade masks, with multiple layers of quilting fabric, and off-the-shelf cone style masks, proved to be the most effective in reducing coronavirus infected droplet dispersal."},
{"date_time": "Jul 10, 2020 • 7:36 am CDT", "title": "1st Person Generates Coronavirus Antibodies After Vaccination", "content": "A Maryland-based graduate immunology student believes he could be one of the 1st people in the USA to produced coronavirus antibodies in response to being vaccinated in phase 2 clinical trial conducted at the University of Maryland, reported the dailyMail on July 9, 2020.If this COVID-19 vaccine candidate, BNT162, is proven to be effective, Pfizer and BioNTech are preparing to mass-produce this mRNA vaccine."},
{"date_time": "Jul 10, 2020 • 6:01 am CDT", "title": "Few Virus Co-infections With SARS-CoV-2 Found", "content": "A new study published on July 3, 2020, suggests that infection with other respiratory pathogens is uncommon among patients with COVID-19 disease.The most common respiratory panel pathogens found by the University of Chicago Medicine researchers were rhinovirus/enterovirus (7.1%), influenza A (2.1%)."},
{"date_time": "Jul 10, 2020 • 5:29 am CDT", "title": "San Quentin Becomes California's Hot-Spot", "content": "California's San Quentin prison declined free coronavirus tests and urgent advice over several months, it now has a massive virus outbreak, stated an article published in Nature on July 7, 2020.Although testing alone doesn’t eliminate COVID-19 outbreaks, it alerts officials to the situation so that they can separate people who test positive, as well as those potentially infected, before the virus has a chance to spread.Since the first cases of COVID-19 disease were reported at San Quentin in the San Francisco Bay Area of California in late May 2020, more than one-third of the inmates and staff, about 1,600 people, have tested positive, and 6 related fatalities have been confirmed.According to an index published by the NYTimes, about 90% of the argest coronavirus outbreaks in the USA have been associated with prisons during 2020."},
{"date_time": "Jul 10, 2020 • 5:15 am CDT", "title": "Schools or Bars?", "content": "Enabling children to return to school safely during August 2020 could mean keeping high-risk spots such as bars and gyms closed, reported the AP. “Do you want to open the bars now or do you want to open the schools and daycare centers in a few short weeks?Helen Jenkins, an infectious disease epidemiologist at Boston University. “I think there are hard choices having to be made by decision-makers.”"},
{"date_time": "Jul 9, 2020 • 6:37 pm CDT", "title": "These Airports Confirmed The Most COVID-19 Infected Staff", "content": "As of July 7, 2020, the US Transportation Security Administration (TSA) reported 1,018 federal employees have tested positive for COVID-19 disease. Unfortunately, there have been 6 fatalities related to coronavirus infections during 2020.The airports reporting the most infected TSA staff are New York's JFK (109), Newark (60), Miami (52), and Chicago O'Hare (41)."},
{"date_time": "Jul 9, 2020 • 6:17 pm CDT", "title": "171 Coronavirus Tests Now Approved", "content": "As of July 9, 2020, the U.S. FDA has authorized 171 coronavirus diagnostic tests under EUAs, which include 142 molecular tests, 27 antibody tests, and 2 antigen tests."},
{"date_time": "Jul 9, 2020 • 12:30 pm CDT", "title": "Canada Launches Cancer - Coronavirus Treatment Study", "content": "In the race to find new ways to prevent and treat COVID-19 disease, the Canadian Cancer Trials Group announced on July 8, 2020, it has launched an innovative clinical trial focussed on strengthening the immune system for one of the most vulnerable populations – cancer patients.This phase 3 study is called CCTG IC.8, which is evaluating coronavirus treatment with IMM-101, a preparation of safe, heat-killed bacteria that broadly stimulates the innate, or “first-response,” arm of the immune system."},
{"date_time": "Jul 9, 2020 • 12:18 pm CDT", "title": "WHO Briefing: How is COVID-19 Transmitted?", "content": "A scientific brief published by the WHO on July 9, 2020, provides an overview of the modes of transmission of SARS-CoV-2, what is known about when infected people transmit the virus, and the implications for infection prevention and control precautions within and outside health facilities.This brief reflects the consolidation of rapid reviews of publications in peer-reviewed journals and of non-peer-reviewed manuscripts on preprint servers, undertaken by WHO and partners."},
{"date_time": "Jul 9, 2020 • 9:39 am CDT", "title": "Reduced Travel Demand Increases Airline Layoffs", "content": "United Airlines announced on July 8, 2020, it is warning about 36,000 employees, which is more than a third of its entire staff, there is a risk of furloughs later in 2020, as the SARS-CoV-2 coronavirus pandemic continues to reduce travel demand, both in the USA and around the world, reported CNBC."},
{"date_time": "Jul 9, 2020 • 9:10 am CDT", "title": "COVID-19 Infections in UK Hospitals Reached 10%", "content": "Using publicly available data, researchers estimate that at least 10% of all COVID-19 infections in England were among patient-facing healthcare staff and resident-facing social care workers during the period from April 26th to June 7, 2020.'In the medium-term, we envisage an ambitious and comprehensive approach to prevention of infection transmitted through respiratory droplets and aerosol routes in hospitals,' said these researchers on July 6, 2020."},
{"date_time": "Jul 9, 2020 • 5:10 am CDT", "title": "Rural Matters — Coronavirus Outbreak and the Navajo Nation", "content": "The Navajo Nation is 27,000 square miles of high-altitude desert with a population density among the lowest in the contiguous United States: seven people per square mile. If you didn’t know better, the vast landscape would seem a perfect setup for social distancing regarding the COVID-19 outbreak, said Heather Kovich, M.D., in an editorial published in the NEJM on July 9, 2020.'But this is an especially tough concept for Navajo extended families. The virus takes advantage of the expansive Navajo definitions of “auntie” and “cousin-brother.”The national media reports on the severity of the Navajo Nation outbreak and these reports are factually accurate. The virus landed in the middle of the reservation during March and exploded outward, from a remote region with an emergency department, but no hospital. In response, the president of the Navajo Nation has issued curfew notices.The men on horses, if they don’t get sick, will be trotting up the highway each morning. They will still be wearing masks.'Since this editorial was written, the Navajo Nation, which includes parts of Arizona, New Mexico, and Utah, has reported 7,981 cases and 382 confirmed fatalities related to coronavirus disease, as of July 8, 2020."},
{"date_time": "Jul 8, 2020 • 7:09 pm CDT", "title": "Ivy League Cancels Athletics For 2020", "content": "The Ivy League became the first Division I conference to suspend all fall sports, including football. With the safety and well-being of students as their highest priority, Ivy League institutions are implementing campus-wide policies including restrictions on student and staff activities.'As athletics is expected to operate consistent with campus policies, it will not be possible for Ivy League teams to participate in intercollegiate athletics competition prior to the end of the fall semester,' said this July 8, 2020, statement."},
{"date_time": "Jul 8, 2020 • 6:59 pm CDT", "title": "Mission Impossible: Launching Vaccines in Just 6-Weeks ", "content": "According to a BMJ article published on July 8, 2020, researchers have accused the Indian Council of Medical Research of 'buckling under political pressure after it sent a letter to doctors instructing them to fast track clinical trials of a vaccine candidate against COVID-19. This letter proposed launching the vaccine for “public health use” by August 15, 2020.Doctors and researchers pointed out that it is impossible to expect a candidate vaccine to launch within 6-weeks.... when the clinical trials have not even started."},
{"date_time": "Jul 8, 2020 • 6:40 pm CDT", "title": "Delirium, Rare Brain Inflammation and Stroke Linked to COVID-19 Disease", "content": "Published in the journal Brain on July 8, 2020, a new study identified 1 rare and sometimes fatal inflammatory condition, known as Acute disseminated encephalomyelitis (ADEM), which appears to be increasing in prevalence due to the COVID-19 disease pandemic.Some patients in the study did not experience severe respiratory symptoms, and the neurological disorder was the first and main presentation of Covid-19.Neurological complications of COVID-19 can include delirium, brain inflammation, stroke, and nerve damage."},
{"date_time": "Jul 8, 2020 • 6:27 pm CDT", "title": "Can Coronavirus Infected People Correctly Describe Their Symptoms?", "content": "A new study published in JAMA on July 8, 2020, revealed that most patients with coronavirus disease presenting to emergency medical services (EMS), such as 911 call services, were older and had multiple chronic health conditions.Symptoms most often reported to EMS were fever (46% of patients), shortness of breath (44%), fatigue (40%), cough (29%), and altered mental state (28%).This finding indicates the early identification of COVID-19 and strategies to mitigate serious health risk during emergency care need to be expanded."},
{"date_time": "Jul 8, 2020 • 6:15 pm CDT", "title": "Brazil Leads the PAHO in COVID-19, Dengue and Yellow Fever Cases", "content": "During the Pan American Health Organization briefing on July 7, 2020, director Carissa Etienne said 'about 100,000 coronavirus cases each day are now reported from the region. However, she noted Brazil alone accounts for 25% of the cases outside of the USA.In addition to the COVID-19 pandemic, Brazil is confronted with Dengue and Yellow Fever outbreaks, says the U.S. CDC."},
{"date_time": "Jul 8, 2020 • 1:39 pm CDT", "title": "As Coronavirus Cases Increase, Driving Slows Down", "content": "The four USA states that are the leaders in reporting new coronavirus cases over the past week, Florida, Texas, California, and Arizona, have realized a decline in driving directions requests at Apple Maps, reported CNBC on July 8, 2020.On April 14, 2020, Apple released a mobility data trends tool from Apple Maps, which offers insights to governments and health authorities by showing the change in volume of people driving, walking, or taking public transit in their communities."},
{"date_time": "Jul 8, 2020 • 11:41 am CDT", "title": "Frequent Proton Pump Inhibitor Use Increases COVID-19 Risk", "content": "Proton pump inhibitors (PPIs) are among the most commonly used medications in the USA but have been linked to various side effects. A new study published on July 7, 2020, found that the use of PPIs is associated with increased odds for reporting a positive COVID-19 test.The highest risk was seen among individuals taking PPIs 2x daily, as they are nearly 4x more likely to report COVID-19 disease positivity when compared to those not on PPIs.'Since meta-analysis reveals that 2x daily PPIs do not offer clinically meaningful benefits over 1x dosing for gastroesophageal reflux disease, our findings further emphasize that PPIs should only be used when clinically indicated at the lowest effective dose,' concluded these researchers."},
{"date_time": "Jul 8, 2020 • 10:09 am CDT", "title": "Who is Exempt From Wearing Face-Masks?", "content": "As more jurisdictions around the world mandate facial coverings in public, many people are claiming they are unable to wear masks because of breathing problems. Recently, these individuals began asking doctors for medical exemptions from wearing masks, reported Medscape on July 7, 2020.These individuals cite the U.S. CDC recommendations on mask-wearing, which say, 'Cloth face coverings should not be placed on anyone who has trouble breathing.'The CDC indicates that on a case-by-case basis, some individuals may need to be exempted. However, one suggestion for those who don’t like wearing masks is using the clear face shields, which offer similar protections against infectious coronavirus droplets."},
{"date_time": "Jul 8, 2020 • 4:29 am CDT", "title": "Surge Testing For COVID-19 Announced in 3 Cities", "content": "The U.S. Department of Health and Human Services (HHS) announced on July 7, 2020, free COVID-19 testing in Jacksonville, Florida; Baton Rouge, Louisiana; and Edinburg, Texas. HHS, in partnership with eTrueNorth, will perform surge testing by offering 5,000 tests per-city per-day, at no charge, to those tested for SARS-CoV-2 virus infections.The temporary surge testing sites will be live for up to 12 days.Individuals seeking COVID-19 testing at any of these sites should pre-register for testing in advance at: www.DoINeedaCOVID19test.com."},
{"date_time": "Jul 8, 2020 • 2:34 am CDT", "title": "Study: In-Flight Coronavirus Risk", "content": "Between January 24th and February 15, 2020, an outbreak of COVID-19 disease occurred among 335 passengers on a flight from Singapore to Hangzhou in China. A total of 16 coronavirus patients were diagnosed among all passengers, which represents an infection rate of 4.8%.'COVID-19 disease transmission may have occurred during the flight.''However, the majority of the cases in the flight-associated outbreak could not be attributed to transmission on the flight, but were associated with exposure to the virus in Wuhan, China, or to infected members in a single tour group,' concluded this travel study published on July 6, 2020."},
{"date_time": "Jul 8, 2020 • 2:24 am CDT", "title": "Obesity Increases Coronavirus Morbidity Risk", "content": "Researchers at Weill Cornell Medicine studied 1,687 hospitalized coronavirus patients at New York City hospitals and found that 31% were obese, with about 5% of all patients being morbidly obese.These findings published on July 6, 2020, support the need to consider the prevalence of obesity when planning a community's COVID-19 disease prevention program."},
{"date_time": "Jul 8, 2020 • 2:05 am CDT", "title": "Alaska's Contact-Tracing Changes Tactics", "content": "Anchorage Mayor Ethan Berkowitz explained his decision on July 7, 2020, to name establishments, mostly bars, where there was COVID-19 exposure. Berkowitz said the city would prefer to privately notify people who were at an establishment where they could have been exposed to the virus.But last week, the city reported its contact-tracing ability was maxed out.The Municipality of Anchorage named more than a dozen bars where people “who were infectious with COVID-19 spent extended time.”"},
{"date_time": "Jul 7, 2020 • 3:27 pm CDT", "title": "Contrasting SARS-2 with SARS-1 and Influenza Pandemics", "content": "A new study published in The Lancet on July 3, 2020, reported SARS-CoV-2 is less deadly but far more transmissible than SARS-1 or previous flu pandemics. The reproductive rate (R0) for SARS-CoV-2 is estimated to be 2.5, compared with 2.4 for SARS-1, Pandemic Influenza of 1918 of 2.0, and for the 2009 influenza pandemic, the RO was 1.7.And, SARS-CoV-2 causes mild or asymptomatic disease in most cases. However, severe illness occurs in a small proportion of infected individuals older than 70 years of age."},
{"date_time": "Jul 7, 2020 • 1:45 pm CDT", "title": "Is Now Time to Address Airborne Transmission of Coronaviruses?", "content": "An open letter published on July 6, 2020, by 239 scientists from 32 countries urges the World Health Organization and other bodies to address the potential for airborne transmission of the new coronavirus.The debate between the potential health risks caused by respiratory droplets and aerosols dates back to the 1930s.Separately, researchers stated in an early-release study to be published in September 2020, ‘that existing evidence is sufficiently strong to warrant engineering controls targeting airborne transmission as part of an overall strategy to limit infection risk indoors.’"},
{"date_time": "Jul 7, 2020 • 1:23 pm CDT", "title": "Japan May Contribute $800 Million To Purchase Coronavirus Vaccines ", "content": "Japan is in talks with potential partners to set up a $20 billion fund to jointly buy coronavirus vaccines, Nikkei reported on July 8, 2020. Japan is expected to contribute as much as $800 million, according to people familiar with the matter.Around 30 nations have said they intend to join the joint purchases, including Italy, Spain, Norway, Canada, and the European Union.Participating countries would agree to take no more than enough coronavirus vaccine for 20% of their population."},
{"date_time": "Jul 7, 2020 • 1:14 pm CDT", "title": "GSK and Medicago Collaboration to Develop COVID-19 Vaccine", "content": "GSK and Medicago announced on July 7, 2020, a collaboration to develop a COVID-19 candidate vaccine combining Medicago’s recombinant Coronavirus Virus-Like Particles (CoVLP) with GSK’s pandemic adjuvant system.Pre-clinical results with Medicago’s CoVLP vaccine candidate demonstrated high levels of neutralizing antibodies following a single dose when administered with an adjuvant. CoVLPs mimic the structure of the virus responsible for COVID-19 disease, allowing them to be recognized by the immune system."},
{"date_time": "Jul 7, 2020 • 12:50 pm CDT", "title": "Regeneron Announces $450 Million Agreement With BARDA and U.S. DoD for Antiviral Antibody Cocktail", "content": "Regeneron announced on July 7, 2020, the Biomedical Advanced Research and Development Authority has awarded a $450 million contract to manufacture and supply REGN-COV2, Regeneron's investigational double-antibody cocktail.REGN-COV2 is currently in Phase 2/3 clinical trials for the treatment of COVID-19 disease, and in a Phase 3 trial, for the prevention of COVID-19 infection, which is caused by the SARS-CoV-2 virus."},
{"date_time": "Jul 7, 2020 • 11:13 am CDT", "title": "Brazil's President Tests Positive for Coronavirus", "content": "Brazil's President Bolsonaro announced on TV on July 7, 2020, that he has tested positive for the coronavirus. This was Mr. Bolsonaro's 4th test, reported the BBC. Mr. Bolsonaro said that he had started experiencing symptoms on July 5th, when he had a high temperature, a cough, and had felt unwell.Brazil has reported over 65,000 fatalities related to COVID-19 disease during 2020.Previously, on June 30th, Brazil extended through July 29, 2020, its travel decree banning foreigners from entering the country by air, land, and sea."},
{"date_time": "Jul 7, 2020 • 8:34 am CDT", "title": "Over 2/3 of Infected Russians Have Recovered", "content": "Russia has documented 6,368 cases of COVID-19, a disease caused by the novel coronavirus, in the past 24 hours, with the daily increase rate reaching a record low of 0.9%, the anti-coronavirus crisis center informed TASS on July 7, 2020.In the past week, TASS reported the increase rate has not surpassed 1%. The total number of those infected in Russia has reached 694,230.Currently, 219,856 people (31.7%) diagnosed with COVID-19 are undergoing treatment in Russia."},
{"date_time": "Jul 7, 2020 • 8:19 am CDT", "title": "Most British Adults Will Get COVID-19 Vaccine", "content": "Nearly 5 in 6 Britons said they will get a coronavirus vaccine if and when one becomes available, according to the polling carried out by YouGov for the Center for Countering Digital Hate, reported the Guardian on July 6, 2020."},
{"date_time": "Jul 7, 2020 • 8:03 am CDT", "title": "California Firm Solves the UK's Ventilator Shortage", "content": "In an effort to overcome the shortage of ventilators in the UK, Veeva Systems announced on July 7, 2020, that it successfully scaled production to deliver more than 13,000 ventilators to the National Health Service."},
{"date_time": "Jul 7, 2020 • 6:58 am CDT", "title": "Lysol Products Found Effective Against Coronavirus", "content": "Late on July 6, 2020, the U.S. Environmental Protection Agency (EPA) announced the approval for 2 common products, Lysol Disinfectant Spray (EPA Reg No. 777-99) and Lysol Disinfectant Max Cover Mist (EPA Reg No. 777-127) are effective against the SARS-CoV-2 virus.Because novel viruses are typically not immediately available for laboratory testing, the EPA has now established guidance for Emerging Viral Pathogens."},
{"date_time": "Jul 7, 2020 • 5:46 am CDT", "title": "$1.6 Billion Funding Announced for Coronavirus Vaccine Development", "content": "The U.S. government's Operation Warp Speed announced on July 7, 2020, it has awarded Novavax $1.6 Billion in funding for the large-scale manufacturing of NVX-CoV2373, including the production of 100 million vaccine doses starting in late 2020."},
{"date_time": "Jul 7, 2020 • 5:28 am CDT", "title": "Updated: Coronations Vaccine Candidates", "content": "The SARS-CoV-2 vaccine development landscape includes innovative platforms such as nucleic acid (DNA and RNA), virus-like particle, peptide, viral vector (replicating and non-replicating), recombinant protein, live attenuated virus and inactivated virus approaches.This listing is updated as of July 7, 2020."},
{"date_time": "Jul 7, 2020 • 5:19 am CDT", "title": "Double-Antibody Cocktail Launches Late-Stage Study", "content": "On July 6, 2020, Regeneron Pharmaceuticals, Inc. announced the initiation of phase 3 clinical trials evaluating REGN-COV2, Regeneron's investigational double-antibody cocktail for the treatment and prevention of COVID-19 disease.REGN-COV2's two antibodies bind non-competitively to the critical receptor binding domain of the virus's spike protein, which diminishes the ability of mutant viruses to escape treatment and protects against spike variants that have arisen in the human population."},
{"date_time": "Jul 6, 2020 • 6:30 pm CDT", "title": "COVID-19 Molecular Testing Demand Surges", "content": "Quest Diagnostics says 'Since June 29, 2020, demand has continued to rise nationwide, particularly in the South, Southwest, and West regions of the USA, outpacing our testing capacity. As a result, the average turnaround time for reporting test results is now 1 day for priority 1 patients .... and 4-6 days for all other populations.''Over the month of July, we will continue to ramp up our capacity from 115,000 last week, to reach 150,000 molecular diagnostic tests a day,' stated a Quest press statement on July 6, 2020."},
{"date_time": "Jul 6, 2020 • 5:30 pm CDT", "title": "Spain's Herd Immunity Reaches Just 5%", "content": "The first nationwide population-based study in Spain presents seroprevalence estimates just 5% of people have antibodies against SARS-CoV-2. This study 's findings published on July 6, 2020, also indicate that children and adolescents have lower seroprevalence than adults, and seroprevalence does not vary by sex."}
][
{"date_time": "Jul 16, 2020 • 2:20 pm CDT", "title": "Columbia University Joins COVID-19 Research Collaboration", "content": "Tonix Pharmaceuticals Holding Corp. announced on July 16, 2020, it has entered into a research collaboration and option agreement with Columbia University. The research is designed to fill important gaps in understanding the detailed immune responses to COVID-19 disease and to provide a foundation upon which to target vaccines and therapeutics to appropriate individuals by precision medicine.The research collaboration will focus on T cell and antibody responses to SARS-CoV-2 (CoV-2), the virus that causes COVID-19 at the cellular level including human monoclonal antibodies and anti-idiotypes.The two principal investigators for the collaboration are Ilya Trakht, Ph.D., Associate Research Scientist, and Sergei Rudchenko, Ph.D., Assistant Professor of Medical Sciences at Columbia University Vagelos College of Physicians and Surgeons."},
{"date_time": "Jul 16, 2020 • 2:10 pm CDT", "title": "Russia Approves COVID-19 Treatment Study", "content": "RedHill Biopharma Ltd. announced on July 16, 2020, the Ministry of Health of the Russian Federation approved its Clinical Trial Authorization application for a Phase 2/3 study evaluating opaganib (Yeliva) as a COVID-19 treatment in patients hospitalized with severe SARS-CoV-2 infection and pneumonia.A study was also recently approved in the UK to evaluate Yeliva, and a similar application is under review in Italy."},
{"date_time": "Jul 16, 2020 • 12:12 pm CDT", "title": "Each Alaska District Has School Reopening Authority", "content": "As fall approaches, each US state is developing its own approach to school reopening, with plans varying widely. As an example, the state of Alaska is using the evidence-based Smart Start 2020 framework for the 2020-2021 academic year. Published on July 15, 2020, the Alaska Department of Education and Early Development (DEED) is requesting each district use this framework to build a comprehensive plan for teaching and learning in the upcoming school year and submit the plan to the department.However, the DEED guidance is not mandated, or state required, as local school districts have the authority, responsibility, and flexibility to make decisions for their communities.Another option to consider is the American Academy of Pediatrics's guidelines for school reopening, which recommend the goal of having students physically present in school."},
{"date_time": "Jul 16, 2020 • 11:04 am CDT", "title": "Good or Bad, AstraZeneca's COVID-19 Vaccine News Coming Soon", "content": "Clinical trial results on the AZD1222 SARS-CoV-2 vaccine candidate being developed by AstraZeneca and Oxford University will be published on July 20, 2020, The Lancet reported.The WHO’s chief scientist said in June that AZD1222 was probably the most advanced vaccine in terms of development, stated the Reuters."},
{"date_time": "Jul 16, 2020 • 10:01 am CDT", "title": "30 Employees Received Pre-Test Vaccinations", "content": "Sinovac announced that its employees, including top executives, received experimental shots of the CoronaVac SARS-CoV-2 vaccine even before the government approved testing in people, reported the AP on July 16, 2020.SinoPharm’s claim that 30 “special volunteers” rolled up their sleeves even before the company got permission for its initial human study."},
{"date_time": "Jul 16, 2020 • 9:43 am CDT", "title": "165 Countries Have Joined COVAX", "content": "Seventy-five countries have submitted expressions of interest to join the COVAX Facility, a mechanism designed to guarantee rapid, fair, and equitable access to COVID-19 vaccines worldwide reported the WHO on July 15, 2020.Together, this new group and previous country commitments, now total 165 countries that represent more than 60% of the world’s population.The goal of COVAX is by the end of 2021 to deliver two billion doses of safe, effective vaccines that have passed regulatory approval and/or WHO prequalification."},
{"date_time": "Jul 16, 2020 • 2:30 am CDT", "title": "Study: Antibody Response to SARS-CoV-2 Spike Proteins Does Differ", "content": "The U.S. FDA published an overview on July 10, 2020, which says 'although multiple vaccine candidates against SARS-CoV-2 based on viral spike protein are under development, there is limited information on the scientific quality of antibody responses generated against them.'This new study found three antigens (S1+S2 ectodomain, S1 domain, and RBD) generated strong neutralizing antibodies against SARS-CoV-2... but not S2."},
{"date_time": "Jul 16, 2020 • 2:06 am CDT", "title": "Coronavirus Fatalities is Not the Only Concern", "content": "An article in The Guardian on July 12, 2020, concluded that saying only 1% of people who get COVID-19 disease will die isn’t entirely wrong.But there’s a problem. Fatalities are not the only issue that a disease can cause.As an example, measles kills about 0.2% of people who catch it, but it leaves some people deaf, others with brain damage, and may cause permanent immune system damage."},
{"date_time": "Jul 15, 2020 • 5:38 pm CDT", "title": "Kidney Co-Morbidities Reported Most Often With Hospitalized COVID-19 Patients", "content": "Chronic kidney disease and kidney failure were the most common underlying conditions in hospitalized COVID-19 patients, according to a Fair Health report published on July 14, 2020.Diabetes type 2 was the second-ranked comorbidity of patients hospitalized for COVID-19 in the USA, between January-May 2020."},
{"date_time": "Jul 15, 2020 • 5:27 pm CDT", "title": "Plaquenil Antiviral Found Ineffective When Treating Serious COVID-19 Patients", "content": "A non-peer-reviewed study published on July 15, 2020, found patients hospitalized with COVID-19, hydroxychloroquine was not associated with reductions in 28-day mortality in COVID-19 disease patients, but was associated with an increased length of hospital stay, and increased risk of progressing to invasive mechanical ventilation or death."},
{"date_time": "Jul 15, 2020 • 3:54 pm CDT", "title": "Pittsburgh Seeking 750 Vaccine Study Participants", "content": "Researchers are looking for 750 people to join clinical trials for vaccine candidates that hopefully will prevent infections from the SARS-CoV-2 coronavirus that causes COVID-19 disease, the University of Pittsburgh Medical Center said on July 15, 2020.Recruitment for the Pittsburgh location for the trials is beginning immediately. The initial vaccine candidate being tested is from Moderna Inc., mRNA-1273, which is an mRNA vaccine.Click here to learn more and to sign up for the Pittsburgh-based trials."},
{"date_time": "Jul 15, 2020 • 10:26 am CDT", "title": "Sections of Spain Return to Lockdown", "content": "About 160,000 residents living in the Catalonia region were instructed to returned home-confinement on July 15, 2020, as Spain's health authorities relaunch coronavirus control and reduction measures. This region reported nearly 1,000 cases in the previous 24 hours, said TheLoca l.Catalan authorities are also watching SARS-CoV-2 infection rates in this northeastern region, notably advising that the residents near Hospitalet de Llobregat, a city with 260,000 residents -- only leave home for urgent necessities."},
{"date_time": "Jul 15, 2020 • 8:52 am CDT", "title": "22 European Countries Successfully Reopened Schools", "content": "According to the WSJ reporting on July 14, 2020, there have been 22 eu­ropean coun­tries that re­opened schools this spring largely avoided coronavirus out­breaks, with no ma­jor flare-ups af­ter stu­dents re­turned to class­rooms.Continued school closures risk “scarring the life chances of a generation of young people,” according to an open letter signed on June 17, 2020, by more than 1,500 members of the United Kingdom’s Royal College of Paediatrics and Child Health."},
{"date_time": "Jul 15, 2020 • 7:38 am CDT", "title": "Friday Night Lights Delayed in Austin", "content": "In the football loyal area of central Texas, Austin-Travis County Interim Health Authority Dr. Mark Escott took a range of actions to enhance protections against the spread of COVID-19 effective July 14, 2020.According to this Order, school systems, such as football-focused Westlake and Lake Travis, cannot reopen for on-campus, face-to-face instruction until after Sept. 7th. Additionally, no extracurricular sports or activities are allowed to take place until school systems reopen for on-campus instruction.Which means, the famous Friday Night Lights high-school games in Texas will be delayed in 2020."},
{"date_time": "Jul 15, 2020 • 6:14 am CDT", "title": "Inaccurate Test Reporting Confuses Public", "content": "Several lab companies that process coronavirus tests from Florida have reported incomplete data to the state, creating discrepancies in the numbers public health officials rely on to track the pandemic across Florida communities, reported the Orlando Sentinel on July 14, 2020.About 2.7 million coronavirus tests have been conducted in and the number of unreported negative tests is unclear."},
{"date_time": "Jul 15, 2020 • 6:01 am CDT", "title": "Status: 179 Coronavirus Tests Authorized", "content": "As of July 14, 2020, the U.S. FDA has authorized 179 coronavirus diagnostic tests under emergency authorizations, which include 148 molecular tests, 29 antibody tests, and 2 antigen tests."},
{"date_time": "Jul 15, 2020 • 2:10 am CDT", "title": "New York's Enforcement Teams Great Visitors With Mandates and $2,000 Fines", "content": "The Governor of New York issued an Order of Summary Action which means that visitors to New York from 19 US states 'must' provide their contact information upon arrival. Failure to comply with this Order can result in a non-disputable summon and fines up to USD $2,000.“We’re serious about enforcing quarantine,” New York Governor Cuomo tweeted on July 13, 2020.Enforcement teams will be stationed at airports statewide to meet arriving aircraft at airport gates and greet disembarking passengers to request proof of completion of the State Department of Health traveler form."},
{"date_time": "Jul 14, 2020 • 6:30 pm CDT", "title": "Does Blood Type O Actually Reduce COVID-19 Risk?", "content": "Dr. Lewis Kaplan, a professor of surgery at the University of Pennsylvania who is president of the Society of Critical Care Medicine, offered the following insight to NBC News on July 7, 2020. 'Even if some people have reduced risks based on blood type, such as O, they don't have zero risks,' Dr. Kaplan said.'It might mean they have less risk, but if you engage in risky behavior, we don't know just how much risk you need to incur to overwhelm the immune protection you might have.'"},
{"date_time": "Jul 14, 2020 • 4:33 pm CDT", "title": "Coronavrius Vaccines Show Positive Study Results", "content": "Moderna, Inc. announced on July 14, 2020, the interim analysis of the open-label Phase 1 study of its mRNA-1273 vaccine candidate published in the NEJM which evaluated a 2-dose vaccination schedule.Results from participants in the initial dose cohorts who received both vaccinations and were evaluated at pre-specified timepoints show the mRNA-1273 vaccine induced rapid and strong immune responses against SARS-CoV-2."},
{"date_time": "Jul 14, 2020 • 3:04 pm CDT", "title": "Florida Department of Health: 'some labs have over-reported positive test results'", "content": "Various testing labs in Florida have reported a 100% positivity rate, which means every single person tested was positive for coronavirus. Other Florida labs had very high positivity rates. FOX 35 News found on July 14, 2020.As an example, FOX 35 reporting showed that Orlando Health had a 98% positivity rate. However, when FOX 35 News contacted the hospital, they confirmed errors in the report.Orlando Health's positivity rate was actually only 9.4%."},
{"date_time": "Jul 14, 2020 • 10:26 am CDT", "title": "Where Can I Get a US Passport?", "content": "To prevent the spread of the coronavirus that causes COVID-19 disease, the US Department of State 'significantly reduced passport operations in March 2020 and temporarily suspended expedited passport processing and restricted service to cases involving life-or-death emergencies.As US states begin to reopen, the State Department is resuming operations in 'phases'.As of Monday, July 13, 2020, there are 5 passport agencies and centers in phase two and 11 others in phase one of our reopening plan. US passport services will assist customers who need a passport in the next 72 hours (3 business days) for a life-or-death emergency."},
{"date_time": "Jul 14, 2020 • 8:40 am CDT", "title": "Plant-Based Vaccine Launches Phase 1 Study", "content": "A plant-derived COVID-19 vaccine candidate announced it administered the first doses in healthy human volunteers on July 14, 2020. Unlike traditional vaccination development, Medicago does not use animal products or live viruses to create its products. Instead, it uses Virus-Like Particles that mimic the shape and dimensions of a virus, which allows the body to recognize them and create an immune response in a non-infectious way.Medicago said it is also planning a Phase 2/3 trial to be initiated this October 2020."},
{"date_time": "Jul 14, 2020 • 8:32 am CDT", "title": "Vaccine Candidate Avoids the D614G Mutation", "content": "IMV Inc. announced on July 14, 2020, it received an agreement with Health Canada on Phase 1 clinical study design protocol. According to the company, the selected vaccine targets are located outside of the 614 mutation which, according to recent research, has been demonstrated to increase the coronavirus’s ability to infect cells, and suggested to potentially reduce vaccine-induced immunity."},
{"date_time": "Jul 14, 2020 • 8:13 am CDT", "title": "MIT & 3M Developing Rapid Coronavirus Detection Test", "content": "3M and researchers at MIT said on July 14, 2020, they are testing a new rapid test that detects the coronavirus. The test is in the Rapid Acceleration of Diagnostics Tech (RADx Tech) program, an aggressively-paced COVID-19 diagnostics initiative from the NIH’s National Institute of Biomedical Imaging and Bioengineering."},
{"date_time": "Jul 14, 2020 • 5:07 am CDT", "title": "Madrid Spain's Symptoms Include the Loss of Smell", "content": "A new study published in The Lancet on July 8, 2020, found the majority (95%) of the Spanish population is seronegative to SARS-CoV-2 infection, even in hottest-areas, such as Madrid (10%).Specifically, individuals with anosmia (the loss of the sense of smell) or at least 3 identifiable symptoms, the seroprevalence reached about 15%."},
{"date_time": "Jul 13, 2020 • 11:56 pm CDT", "title": "Houston Basketball Star Tests Positive For Coronavirus", "content": "The NBA Houston Rockets superstar Russell Westbrook said via Twitter on July 13, 2020, that he had recently tested positive for the novel coronavirus SARS-CoV-2, and is now in quarantine. Westbrook, a 9-time All-Star, becomes the NBA’s most visible player infected with SARS-CoV-2.The NBA’s “bubble site\" in Orlando, is where the 2019-20 season will restart, has recently become a Florida hot-spot for COVID-19 disease cases."},
{"date_time": "Jul 13, 2020 • 11:47 pm CDT", "title": "Russian COVID-19 Vaccine Availability Begins Mid-August 2020", "content": "The Gamalei Center's leader Alexander Gintsburg stated on July 13, 2020, that he hopes the Russian COVID-19 vaccine will “enter civil circulation” on Aug. 12-14, 2020. He added that he hopes private companies would begin mass production by September 2020, reported the Moscow Times.“The research has been completed and it proved that the vaccine is safe,” Yelena Smolyarchuk, the head of Sechenov University’s clinical research center, told TASS."},
{"date_time": "Jul 13, 2020 • 7:49 pm CDT", "title": "Coronavirus Test Results Delivered in .... 7 Days", "content": "Demand for COVID-19 testing continues to soar, further extending turnaround times for test results, stated Quest Diagnostics on July 13, 2020, one of the largest labs in the USA.As a result, our average turnaround time for reporting test results is more than 1 day for priority 1 patients. However, the average turnaround time for all other populations is 7 or more days.But, there is some good news .... by the end of July 2020, Quest expects to have the capacity to perform 150,000 molecular diagnostic tests a day."},
{"date_time": "Jul 13, 2020 • 7:24 pm CDT", "title": "New Zealand Opens Back Up", "content": "Although many governments around the world are still advising against “non-essential” international travel, a number of travel destinations are beginning to ease their COVID-19 disease lockdown measures and border restrictions and are moving toward welcoming tourists back.On July 1, the European Union announced it would be reopening its external border to 15 countries in a bid to boost its travel industry.And now, New Zealand is operating under Alert Level 1, which means people within New Zealand are able to travel and mix more freely. However, people entering New Zealand must stay in managed isolation or quarantine for at least 14 days and test negative for COVID-19 before they can go into the community.As of July 13, 2020, New Zealand reported 25 active cases, said the U.S. Embassy."},
{"date_time": "Jul 13, 2020 • 6:07 pm CDT", "title": "Antibody Response Informs Vaccine Design", "content": "Scientists from the U.S. FDA have identified specific areas on the so-called ‘spike protein’ of SARS-CoV-2 coronavirus that appears to be key to triggering strong protective antibody responses ... in rabbits.The spike proteins are molecules emerging from the surface of the virus, one part of which the virus uses to attach to a cell and another to fuse with the cell membrane, enabling SARS-CoV-2 to infect the cell, reported the FDA on July 10, 2020."},
{"date_time": "Jul 13, 2020 • 5:59 pm CDT", "title": "Airborne Transmission:  Theoretical Considerations of the Available Evidence", "content": "'All told, the current understanding about SARS-CoV-2 transmission is still limited,' said researchers in a study published in JAMA on July 13, 2020. There are no perfect experimental data proving or disproving droplet vs aerosol-based transmission of SARS-CoV-2.The balance of evidence, however, seems inconsistent with the aerosol-based transmission of SARS-CoV-2, particularly in well-ventilated spaces, and outdoors.To be sure, there are 'rarely absolutes in biological systems since people produce both droplets and aerosols' and virus transmission may take place along a long spectrum of options."},
{"date_time": "Jul 13, 2020 • 5:06 pm CDT", "title": "France Lacks Population Immunity", "content": "The country of France has been heavily affected by the SARS-CoV-2 pandemic and went into a national lockdown on March 17, 2020. To better understand the impact, a new analysis found that 2.9% of virus-infected individuals were hospitalized and 0.5% of those who were severely infected patients died.And across all ages, men are more likely to be hospitalized, enter intensive care, and die.Furthermore, this study published on July 11, 2020, says 'France's population immunity appears to be insufficient.'"},
{"date_time": "Jul 13, 2020 • 4:48 pm CDT", "title": "COVID-19 Antibody Protection Wanes In Months", "content": "COVID-19 patients who have recovered from the coronavirus-caused disease may lose their immunity within a few months, reported a non-peer-reviewed study, which was published on July 11, 2020.This study has important implications when considering widespread serological testing, antibody protection against re-infection, and the durability of vaccine protection.These researchers suggest that this transient antibody response is a feature shared by both a SARS-CoV-2 infection and the circulating seasonal coronaviruses that are associated with common colds. Coronaviruses are the 2nd leading cause of the common cold, after rhinoviruses, says the U.S. CDC."},
{"date_time": "Jul 13, 2020 • 3:27 pm CDT", "title": "US Army Dispatches Medical Reinforcements to Texas", "content": "Texas Governor Greg Abbott announced on July 13, 2020, the U.S. Army Urban Augmentation Medical Task Forces (UAMTF) has been mobilized to assist the state's efforts to combat the COVID-19 disease outbreak. At the Governor's request, one UAMTF unit already arrived in San Antonio on July 6th, with additional units soon to arrive in other cities.These UAMTF teams consist of medical and support professionals who are being deployed to support medical needs in hospitals throughout the state of Texas."},
{"date_time": "Jul 13, 2020 • 2:16 pm CDT", "title": "K-State Co-Developing Coronavirus Vaccine Candidate", "content": "Tonix Pharmaceuticals announced on July 13, 2020, a new preclinical research and option agreement with Kansas State University (K-State) to develop a vaccine candidate for the prevention of COVID-19 that utilizes a novel live virus vaccine vector platform and the CD40-ligand, also known as CD154 or 5c8 antigen, to stimulate T cell immunity.K-State will advance the preclinical development of a live replicating virus vaccine to protect against COVID-19 based on the bovine parainfluenza virus.“As the world’s foremost global food and biosecurity science university, K-State is committed to understanding and combatting zoonotic diseases and the viruses that cause them like SARS-CoV-2,” said Dr. Peter Dorhout, Vice President for Research at K-State."},
{"date_time": "Jul 13, 2020 • 1:39 pm CDT", "title": "Novel Biologic Approved For Hospitalized COVID-19 Patients in India", "content": "Biocon Ltd. presented key insights into the results of the pivotal study that demonstrated its novel biologic, Itolizumab, significantly reduced mortality in moderate to severe ARDS (acute respiratory distress syndrome) patients hospitalized with COVID-19, in India.This information led to the Drug Controller General of India approving this novel biologic therapy, Itolizumab, for restricted emergency use in India, on July 13, 2020."},
{"date_time": "Jul 13, 2020 • 11:03 am CDT", "title": "Disneyland Closes in Hong Kong Again", "content": "Hong Kong Disneyland is closing on July 15, 2020, after an outbreak of COVID-19 disease was confirmed, according to a theme park blog. Hong Kong Disneyland reopened on June 18, 2020, with limited capacity and increased health and safety measures.According to WDW News Today, there were about 50 new coronavirus cases reported in the Hong Kong region on July 13th.Across the world in Orlando, Florida, Disney guests may have to get their temperature taken. If any member of a party has a temperature of 100.4 or higher, the entire party will be denied entry.But, a “cool off” period will be allowed if a Guest fails the screening the first time, just to make sure no environmental causes could be the reason for high temperature, stated this blog post."},
{"date_time": "Jul 13, 2020 • 10:23 am CDT", "title": "China Vaccine Production Factory Breaks Ground", "content": "China's new COVID-19 vaccine factory in a free-trade zone near the city of Ningbo, in Zhejiang province, announced its groundbreaking on July 11, 2020. The project is implemented in three phases, of which the first phase invests 1.3 billion yuan to build a new crown vaccine industrialization, high-level biological laboratory, and a new human rabies vaccine.Ningbo authorities expected the vaccine production lines to be operational by March 2021, said a digital media post from the local government."},
{"date_time": "Jul 13, 2020 • 9:54 am CDT", "title": "Which Virus Caused Pneumonia ... Coronavirus Or Influenza", "content": "Using CT scans to distinguish the source of pneumonia between COVID-19 disease and from an influenza virus is very complicated. A new study published in July 2020, found 'most lesions in patients with COVID-19 pneumonia were located in the peripheral zone and close to the pleura.Whereas, the influenza infections generated pneumonia cases were more prone to show mucoid impaction and pleural effusion.This study found that the axial distribution of COVID-19 pneumonia was most often in the peripheral zone (67.3%), and the most important characteristic was that the largest lesion was close to the pleura (69.2%).Lesions from influenza virus pneumonia had more diffuse (35.6%) or random (33.3%) distribution and the largest lesion was close to the pleura (40%) less often than was seen in patients with COVID-19 pneumonia."},
{"date_time": "Jul 13, 2020 • 9:38 am CDT", "title": "Study: Live Bio-Therapeutic Treatment for COVID-19 Patients Improves Outcomes", "content": "ExeGi Pharma announced on July 13, 2020, the results of a 70-patient clinical trial evaluating a new biologic drug candidate in hospitalized COVID-19 patients. This study compared outcomes of patients who received standard drug treatments alone or standard treatments combined with an oral bacteriotherapyAll patients treated in this study with standard therapy plus bacteriotherapy survived the COVID-19 illness, and none required invasive mechanical ventilation or ICU admission."},
{"date_time": "Jul 13, 2020 • 9:12 am CDT", "title": "Another COVID-19 Vaccine Receives Fast-Track Status", "content": "On July 13, 2020, Pfizer Inc. and BioNTech SE announced that 2 of the companies’ 4 investigational vaccine candidates from their BNT162 mRNA-based vaccine program received Fast Track designation from the U.S. FDA.Subject to regulatory approval, the companies are expecting to start a Phase 2b/3 trial later this summer and are anticipating enrolling up to 30,000 subjects."},
{"date_time": "Jul 13, 2020 • 5:11 am CDT", "title": "Queensland Doses 1st Coronavirus Vaccine ", "content": "The first human clinical trial of the University of Queensland's COVID-19 vaccine candidate launched on July 13, 2020. Up to 120 adult volunteers will receive a dose of the vaccine at the Brisbane clinic in Australia.“Testing showed that the vaccine was effective in inducing antibodies that were able to neutralize the virus. Further studies have shown that the vaccine was safe to give to people.”"},
{"date_time": "Jul 12, 2020 • 8:23 pm CDT", "title": "Children and Women Report Fewer Coronavirus Cases", "content": "In a population-based study in Iceland published in NEJM, researchers found young children and females were less likely to test positive for SARS-CoV-2 than adolescents or adults and males.Whether the lower incidence of coronavirus infection in these 2 groups resulted from less exposure to the virus, or from biologic resistance, was not known by these researchers."},
{"date_time": "Jul 12, 2020 • 6:53 pm CDT", "title": "US Government Extends COVID-19 Testing in It's #3 and #9 Metro Areas", "content": "On July 12, 2020, Texas Governor Greg Abbott announced that the U.S. Department of Health and Human Services has extended federal support of Community Based Testing Sites in Dallas and Houston through July 31, 2020.\"There are over 900 testing sites across the state of Texas, and I urge Texans in need of a SARS-CoV-2 coronavirus test to find a site nearest them.\"As of July 12, 2020, the state of Texas, with 29 million residents, had confirmed over 3,200 fatalities related to COVID-19 disease."},
{"date_time": "Jul 12, 2020 • 3:35 pm CDT", "title": "Russian Coronavirus Vaccine Passes Test", "content": "On July 12, 2020, Sechenov University announced the completion of the Russia COVID-19 vaccine candidate's clinical trial. The university began clinical trials of the vaccine produced by Russia’s Gamalei Institute of Epidemiology and Microbiology on June 18th."},
{"date_time": "Jul 12, 2020 • 11:39 am CDT", "title": "CDC Update: Mortality Rate Declines for 11th Week", "content": "Based on death certificate data, the U.S. CDC reported the percentage of deaths attributed to pneumonia, influenza, or COVID-19 disease (PIC) decreased from 6.9% during week #26 to just 5.5% during week #27.This CDC data represents the 11th week of declining mortality percentages due to PIC in the USA, as of July 10, 2020."},
{"date_time": "Jul 12, 2020 • 11:25 am CDT", "title": "Editorial: Vaccines & Convalescent Plasma for COVID-19", "content": "A new editorial published by BMJ on July 9, 2020, says 'We have good reason to be cautious about these preventive vaccines and passive immunity approaches. Passive immunity, using convalescent plasma from recovered patients or monoclonal antibodies with high levels of neutralizing antiviral activity, has the potential for both therapy and prevention.''Understandably, there are great public expectations that these efforts will be successful, but caution is necessary with respect to both vaccines and passive immunity.''These immunological tools will at best complement public health vigilance, preparedness, and early control measures, which will remain vital for combating future potential pandemics.'"},
{"date_time": "Jul 12, 2020 • 10:29 am CDT", "title": "Chinese Vaccine Company Discusses Phase 3 Study", "content": "CanSino Biologics announced on July 11, 2020, it is in talks with Russia, Brazil, Chile, and the Kingdom of Saudi Arabia to launch a Phase III clinical trial of its experimental COVID-19 vaccine known as Ad5-nCoV, reported Reuters."},
{"date_time": "Jul 12, 2020 • 10:06 am CDT", "title": "Hungary Launches Red, Yellow, and Green Travel Bans", "content": "Hungarian authorities announced on July 12, 2020, that they would put countries in 3 categories – red, yellow, and green – based on their rate of new coronavirus infections. And, travel restrictions including entry bans and mandatory quarantines will be imposed, depending from which country people were coming from, reported Reuters on Twitter.Red category countries are banned for entry, which includes, but are not limited to, Albania, Ukraine, Belarus, and all of Asia, Africa, and South & Central America. Hungarian citizens arriving from those locations will be quarantined for 2-weeks or until they test negative twice, 48 hours apart.Hungary, which has a population of around 10 million, had recorded 595 coronavirus related fatalities during 2020."},
{"date_time": "Jul 12, 2020 • 9:53 am CDT", "title": "COVID-19 Symptoms Linger For Months", "content": "Almost 90% of COVID-19 disease patients discharged from a Rome, Italy hospital were experiencing at least 1 related symptom 2-months later, reported a study published in JAMA on July 9, 2020 shows. Fatigue and shortness of breath were the most common symptoms found.And, 55% of COVID-19 patients were still experiencing 3 symptoms after discharge."},
{"date_time": "Jul 11, 2020 • 2:04 pm CDT", "title": "Can Schools Learn Reopening Lessons Already Learned", "content": "When Science looked at reopening strategies from South Africa to Finland to Israel on July 7, 2020, some encouraging patterns emerged. Together, they suggest a combination of keeping student groups small and requiring masks and some social distancing helps keep schools and communities safe.And, that younger children rarely spread the virus to one another or bring it home.But it isn’t just about the adjustments a school makes. It’s also about how much virus is circulating in the community, which affects the likelihood that students and staff will bring COVID-19 into their classrooms."},
{"date_time": "Jul 11, 2020 • 1:25 pm CDT", "title": "Arizona's Mutated Coronavirus Found Very Infectious", "content": "Over 90% of the SARS-CoV-2 coronavirus samples from Arizona have a mutation (D614G) that researchers hypothesize makes this version of the virus more infectious, reported AZcentra l on July 11, 2020.This mutated strain of the virus is the same one that researchers first identified in April 2020 as the dominant strain in Arizona. Researchers initially thought that this strain was no more infectious than other strains, but was merely dominant due to chance.\"The earlier strains that came into Arizona didn't have this (D614G) mutation and those strains didn't go on in most cases to cause any type of sustained outbreaks,\" David Engelthaler Ph.D., said. \"They typically fizzled out.\"So far, no mutations, including this one, have been found to interfere with vaccine development that is underway, according to Engelthaler."},
{"date_time": "Jul 11, 2020 • 11:06 am CDT", "title": "Airline Issues Yellow-Cards For Onboard Infraction", "content": "Similar to the sport of soccer, Alaska Airlines is now issuing yellow-card warnings to passengers who do not comply with instructions regarding wearing a face covering, Alaska stated a blog on June 30, 2020,'Our flight attendants are empowered to issue a final notice to any guest who repeatedly refuses to wear a face-covering onboard our aircraft.''With that warning – in the form of a yellow card – the guest’s (future) travel with us will be reviewed and could be suspended for a period on time.'"},
{"date_time": "Jul 11, 2020 • 9:58 am CDT", "title": "Japan's Okinawa Confirms Coronavirus Outbreak at US Military Bases", "content": "A new batch of COVID-19 disease cases have been detected at U.S. military bases in the Okinawa Prefecture of Japan, reported the Japan Times on July 11, 2020. Local media reported that several US military facilities were involved, including Marine Corps Air Station Futenma and Camp Hansen.On July 9, 2020, the US Navy and Marine Corps in Japan, began isolating coronavirus cases at their installations on Okinawa, a southern island of Japan."},
{"date_time": "Jul 11, 2020 • 9:25 am CDT", "title": "When Traveling ... You Should Wear Face-Coverings", "content": "Because the SARS-CoV-2 virus is currently spreading in the USA and abroad, the U.S. CDC recommends that everyone wear a cloth face covering over their nose and mouth when traveling.Cloth face coverings may slow the spread of the coronavirus that causes COVID-19 disease by helping keep people who are infected from spreading the virus to others.However, medical masks and N-95 respirators are intended for healthcare staff and first responders, according to the CDC's updated guidance."},
{"date_time": "Jul 11, 2020 • 8:13 am CDT", "title": "Queens NY Infection Rate Rapidly Accelerates", "content": "The New York Times reported new data on July 9, 2020, that about 68% of people tested positive for SARS-CoV-2 antibodies at a clinic located in Corona, Queens, New York. And another clinic located in the Jackson Heights section of Queens report 56% of tested patients were also positive.Just 3-weeks ago, the CityMD clinic had administered about 300,000 antibody tests in NYC and found just 26% of the tests came back positive for this virus's antibodies.This news reported indicates the SARS-CoV-2 continues to spread in the NYC area."},
{"date_time": "Jul 10, 2020 • 6:06 pm CDT", "title": "DoD Overcomes Coronavirus To Achieve Recruitment Goals", "content": "The COVID-19 disease pandemic hasn't put a damper on the recruitment of new soldiers or airmen at basic training facilities, reported the U.S. DoD on July 10, 2020. Both the Army and the Air Force test new recruits for COVID-19 upon arrival on station, with about 2% of those new recruits testing positive for COVID-19.However, there have only been 3 active-duty fatalities related to COVID-19 reported during 2020.Initially, the Air Force had wanted about 38,000 new recruits this year, Air Force Maj. Gen. Andrea D. Tullos said. But the service has reduced that to about 35,500. That, she said, 'is due in large part to better retention.'And, Army Maj. Gen. Lonnie G. Hibbard, commander of the Army Center for Initial Military Training, said 'the Army's recruitment and retention are similarly situated.'"},
{"date_time": "Jul 10, 2020 • 2:30 pm CDT", "title": "Did Italy Defeated COVID-19's Onslaught ", "content": "Once a leader in COVID-19 disease fatalities, new data indicates Italy is returning to a 'new normal. In the early days of the coronavirus pandemic in Italy, the 500-bed hospital Policlinico San Donato in Milan was caring for about 600 coronavirus patients, reported MedpageToday on July 7, 2020.Now, the hospital's chief cardiac surgeon says 'his unit is now operating between 40% to 50% of its normal volume.'On July 10, 2020, updated trend data shows Italy, with a population of about 60 million residents, reported just 276 new cases and 12 new fatalities related to SARS-CoV-2 coronavirus."},
{"date_time": "Jul 10, 2020 • 12:49 pm CDT", "title": "Study: BCG Vaccination Associated With Reduced COVID-19 Mortality", "content": "Researchers at the National Institute of Allergy and Infectious Diseases of the U.S. NIH identified on July 9, 2020, a linkage between the very old Bacille Calmette-Guerin (BCG) and the COVID-19 disease after comparing mortality rates around the world.After mitigating multiple confounding factors, these researchers found that some Latin American regions reported lower fatality rates than the USA, such as New York.'The consistent association between BCG vaccination and reduced severity of COVID-19 observed in these and other epidemiological explorations is remarkable, but not sufficient to establish causality between BCG vaccination and protection from severe COVID-19,' stated these researchers.To clarify this association, a phase 4 vaccine study was launched in April 2020 by Harvard’s School of Public Health, the University of Texas MD Anderson Cancer Center, Cedars Sinai Medical Center, the Baylor College of Medicine, and Texas A&M University."},
{"date_time": "Jul 10, 2020 • 9:26 am CDT", "title": "New Mexico Cancels Foot-Ball", "content": "The New Mexico Activities Association announced on July 9, 2020, that it will be postponing the 2020 football and soccer seasons ... moving them to the Spring 20121 semester.Local media reported NM Governor Michelle Lujan Grisham stated: “No contact sports are going to be permitted this fall.”"},
{"date_time": "Jul 10, 2020 • 9:09 am CDT", "title": "When Can I Return to Work After Traveling Abroad?", "content": "All international travelers should stay home for 14 days after their arrival into the USA, stated the U.S. CDC on May 28, 2020. To protect yourself when abroad, pre-travel vaccination information is found on this webpage."},
{"date_time": "Jul 10, 2020 • 8:57 am CDT", "title": "Wearing Face Masks Work Best", "content": "The wearing of face masks - including cloth-based coverings - has been widely recommended by public health officials around the world during the COVID-19 pandemic.A recent study found well-fitted homemade masks, with multiple layers of quilting fabric, and off-the-shelf cone style masks, proved to be the most effective in reducing coronavirus infected droplet dispersal."},
{"date_time": "Jul 10, 2020 • 7:36 am CDT", "title": "1st Person Generates Coronavirus Antibodies After Vaccination", "content": "A Maryland-based graduate immunology student believes he could be one of the 1st people in the USA to produced coronavirus antibodies in response to being vaccinated in phase 2 clinical trial conducted at the University of Maryland, reported the dailyMail on July 9, 2020.If this COVID-19 vaccine candidate, BNT162, is proven to be effective, Pfizer and BioNTech are preparing to mass-produce this mRNA vaccine."},
{"date_time": "Jul 10, 2020 • 6:01 am CDT", "title": "Few Virus Co-infections With SARS-CoV-2 Found", "content": "A new study published on July 3, 2020, suggests that infection with other respiratory pathogens is uncommon among patients with COVID-19 disease.The most common respiratory panel pathogens found by the University of Chicago Medicine researchers were rhinovirus/enterovirus (7.1%), influenza A (2.1%)."},
{"date_time": "Jul 10, 2020 • 5:29 am CDT", "title": "San Quentin Becomes California's Hot-Spot", "content": "California's San Quentin prison declined free coronavirus tests and urgent advice over several months, it now has a massive virus outbreak, stated an article published in Nature on July 7, 2020.Although testing alone doesn’t eliminate COVID-19 outbreaks, it alerts officials to the situation so that they can separate people who test positive, as well as those potentially infected, before the virus has a chance to spread.Since the first cases of COVID-19 disease were reported at San Quentin in the San Francisco Bay Area of California in late May 2020, more than one-third of the inmates and staff, about 1,600 people, have tested positive, and 6 related fatalities have been confirmed.According to an index published by the NYTimes, about 90% of the argest coronavirus outbreaks in the USA have been associated with prisons during 2020."},
{"date_time": "Jul 10, 2020 • 5:15 am CDT", "title": "Schools or Bars?", "content": "Enabling children to return to school safely during August 2020 could mean keeping high-risk spots such as bars and gyms closed, reported the AP. “Do you want to open the bars now or do you want to open the schools and daycare centers in a few short weeks?Helen Jenkins, an infectious disease epidemiologist at Boston University. “I think there are hard choices having to be made by decision-makers.”"},
{"date_time": "Jul 9, 2020 • 6:37 pm CDT", "title": "These Airports Confirmed The Most COVID-19 Infected Staff", "content": "As of July 7, 2020, the US Transportation Security Administration (TSA) reported 1,018 federal employees have tested positive for COVID-19 disease. Unfortunately, there have been 6 fatalities related to coronavirus infections during 2020.The airports reporting the most infected TSA staff are New York's JFK (109), Newark (60), Miami (52), and Chicago O'Hare (41)."},
{"date_time": "Jul 9, 2020 • 6:17 pm CDT", "title": "171 Coronavirus Tests Now Approved", "content": "As of July 9, 2020, the U.S. FDA has authorized 171 coronavirus diagnostic tests under EUAs, which include 142 molecular tests, 27 antibody tests, and 2 antigen tests."},
{"date_time": "Jul 9, 2020 • 12:30 pm CDT", "title": "Canada Launches Cancer - Coronavirus Treatment Study", "content": "In the race to find new ways to prevent and treat COVID-19 disease, the Canadian Cancer Trials Group announced on July 8, 2020, it has launched an innovative clinical trial focussed on strengthening the immune system for one of the most vulnerable populations – cancer patients.This phase 3 study is called CCTG IC.8, which is evaluating coronavirus treatment with IMM-101, a preparation of safe, heat-killed bacteria that broadly stimulates the innate, or “first-response,” arm of the immune system."},
{"date_time": "Jul 9, 2020 • 12:18 pm CDT", "title": "WHO Briefing: How is COVID-19 Transmitted?", "content": "A scientific brief published by the WHO on July 9, 2020, provides an overview of the modes of transmission of SARS-CoV-2, what is known about when infected people transmit the virus, and the implications for infection prevention and control precautions within and outside health facilities.This brief reflects the consolidation of rapid reviews of publications in peer-reviewed journals and of non-peer-reviewed manuscripts on preprint servers, undertaken by WHO and partners."},
{"date_time": "Jul 9, 2020 • 9:39 am CDT", "title": "Reduced Travel Demand Increases Airline Layoffs", "content": "United Airlines announced on July 8, 2020, it is warning about 36,000 employees, which is more than a third of its entire staff, there is a risk of furloughs later in 2020, as the SARS-CoV-2 coronavirus pandemic continues to reduce travel demand, both in the USA and around the world, reported CNBC."},
{"date_time": "Jul 9, 2020 • 9:10 am CDT", "title": "COVID-19 Infections in UK Hospitals Reached 10%", "content": "Using publicly available data, researchers estimate that at least 10% of all COVID-19 infections in England were among patient-facing healthcare staff and resident-facing social care workers during the period from April 26th to June 7, 2020.'In the medium-term, we envisage an ambitious and comprehensive approach to prevention of infection transmitted through respiratory droplets and aerosol routes in hospitals,' said these researchers on July 6, 2020."},
{"date_time": "Jul 9, 2020 • 5:10 am CDT", "title": "Rural Matters — Coronavirus Outbreak and the Navajo Nation", "content": "The Navajo Nation is 27,000 square miles of high-altitude desert with a population density among the lowest in the contiguous United States: seven people per square mile. If you didn’t know better, the vast landscape would seem a perfect setup for social distancing regarding the COVID-19 outbreak, said Heather Kovich, M.D., in an editorial published in the NEJM on July 9, 2020.'But this is an especially tough concept for Navajo extended families. The virus takes advantage of the expansive Navajo definitions of “auntie” and “cousin-brother.”The national media reports on the severity of the Navajo Nation outbreak and these reports are factually accurate. The virus landed in the middle of the reservation during March and exploded outward, from a remote region with an emergency department, but no hospital. In response, the president of the Navajo Nation has issued curfew notices.The men on horses, if they don’t get sick, will be trotting up the highway each morning. They will still be wearing masks.'Since this editorial was written, the Navajo Nation, which includes parts of Arizona, New Mexico, and Utah, has reported 7,981 cases and 382 confirmed fatalities related to coronavirus disease, as of July 8, 2020."},
{"date_time": "Jul 8, 2020 • 7:09 pm CDT", "title": "Ivy League Cancels Athletics For 2020", "content": "The Ivy League became the first Division I conference to suspend all fall sports, including football. With the safety and well-being of students as their highest priority, Ivy League institutions are implementing campus-wide policies including restrictions on student and staff activities.'As athletics is expected to operate consistent with campus policies, it will not be possible for Ivy League teams to participate in intercollegiate athletics competition prior to the end of the fall semester,' said this July 8, 2020, statement."},
{"date_time": "Jul 8, 2020 • 6:59 pm CDT", "title": "Mission Impossible: Launching Vaccines in Just 6-Weeks ", "content": "According to a BMJ article published on July 8, 2020, researchers have accused the Indian Council of Medical Research of 'buckling under political pressure after it sent a letter to doctors instructing them to fast track clinical trials of a vaccine candidate against COVID-19. This letter proposed launching the vaccine for “public health use” by August 15, 2020.Doctors and researchers pointed out that it is impossible to expect a candidate vaccine to launch within 6-weeks.... when the clinical trials have not even started."},
{"date_time": "Jul 8, 2020 • 6:40 pm CDT", "title": "Delirium, Rare Brain Inflammation and Stroke Linked to COVID-19 Disease", "content": "Published in the journal Brain on July 8, 2020, a new study identified 1 rare and sometimes fatal inflammatory condition, known as Acute disseminated encephalomyelitis (ADEM), which appears to be increasing in prevalence due to the COVID-19 disease pandemic.Some patients in the study did not experience severe respiratory symptoms, and the neurological disorder was the first and main presentation of Covid-19.Neurological complications of COVID-19 can include delirium, brain inflammation, stroke, and nerve damage."},
{"date_time": "Jul 8, 2020 • 6:27 pm CDT", "title": "Can Coronavirus Infected People Correctly Describe Their Symptoms?", "content": "A new study published in JAMA on July 8, 2020, revealed that most patients with coronavirus disease presenting to emergency medical services (EMS), such as 911 call services, were older and had multiple chronic health conditions.Symptoms most often reported to EMS were fever (46% of patients), shortness of breath (44%), fatigue (40%), cough (29%), and altered mental state (28%).This finding indicates the early identification of COVID-19 and strategies to mitigate serious health risk during emergency care need to be expanded."},
{"date_time": "Jul 8, 2020 • 6:15 pm CDT", "title": "Brazil Leads the PAHO in COVID-19, Dengue and Yellow Fever Cases", "content": "During the Pan American Health Organization briefing on July 7, 2020, director Carissa Etienne said 'about 100,000 coronavirus cases each day are now reported from the region. However, she noted Brazil alone accounts for 25% of the cases outside of the USA.In addition to the COVID-19 pandemic, Brazil is confronted with Dengue and Yellow Fever outbreaks, says the U.S. CDC."},
{"date_time": "Jul 8, 2020 • 1:39 pm CDT", "title": "As Coronavirus Cases Increase, Driving Slows Down", "content": "The four USA states that are the leaders in reporting new coronavirus cases over the past week, Florida, Texas, California, and Arizona, have realized a decline in driving directions requests at Apple Maps, reported CNBC on July 8, 2020.On April 14, 2020, Apple released a mobility data trends tool from Apple Maps, which offers insights to governments and health authorities by showing the change in volume of people driving, walking, or taking public transit in their communities."},
{"date_time": "Jul 8, 2020 • 11:41 am CDT", "title": "Frequent Proton Pump Inhibitor Use Increases COVID-19 Risk", "content": "Proton pump inhibitors (PPIs) are among the most commonly used medications in the USA but have been linked to various side effects. A new study published on July 7, 2020, found that the use of PPIs is associated with increased odds for reporting a positive COVID-19 test.The highest risk was seen among individuals taking PPIs 2x daily, as they are nearly 4x more likely to report COVID-19 disease positivity when compared to those not on PPIs.'Since meta-analysis reveals that 2x daily PPIs do not offer clinically meaningful benefits over 1x dosing for gastroesophageal reflux disease, our findings further emphasize that PPIs should only be used when clinically indicated at the lowest effective dose,' concluded these researchers."},
{"date_time": "Jul 8, 2020 • 10:09 am CDT", "title": "Who is Exempt From Wearing Face-Masks?", "content": "As more jurisdictions around the world mandate facial coverings in public, many people are claiming they are unable to wear masks because of breathing problems. Recently, these individuals began asking doctors for medical exemptions from wearing masks, reported Medscape on July 7, 2020.These individuals cite the U.S. CDC recommendations on mask-wearing, which say, 'Cloth face coverings should not be placed on anyone who has trouble breathing.'The CDC indicates that on a case-by-case basis, some individuals may need to be exempted. However, one suggestion for those who don’t like wearing masks is using the clear face shields, which offer similar protections against infectious coronavirus droplets."},
{"date_time": "Jul 8, 2020 • 4:29 am CDT", "title": "Surge Testing For COVID-19 Announced in 3 Cities", "content": "The U.S. Department of Health and Human Services (HHS) announced on July 7, 2020, free COVID-19 testing in Jacksonville, Florida; Baton Rouge, Louisiana; and Edinburg, Texas. HHS, in partnership with eTrueNorth, will perform surge testing by offering 5,000 tests per-city per-day, at no charge, to those tested for SARS-CoV-2 virus infections.The temporary surge testing sites will be live for up to 12 days.Individuals seeking COVID-19 testing at any of these sites should pre-register for testing in advance at: www.DoINeedaCOVID19test.com."},
{"date_time": "Jul 8, 2020 • 2:34 am CDT", "title": "Study: In-Flight Coronavirus Risk", "content": "Between January 24th and February 15, 2020, an outbreak of COVID-19 disease occurred among 335 passengers on a flight from Singapore to Hangzhou in China. A total of 16 coronavirus patients were diagnosed among all passengers, which represents an infection rate of 4.8%.'COVID-19 disease transmission may have occurred during the flight.''However, the majority of the cases in the flight-associated outbreak could not be attributed to transmission on the flight, but were associated with exposure to the virus in Wuhan, China, or to infected members in a single tour group,' concluded this travel study published on July 6, 2020."},
{"date_time": "Jul 8, 2020 • 2:24 am CDT", "title": "Obesity Increases Coronavirus Morbidity Risk", "content": "Researchers at Weill Cornell Medicine studied 1,687 hospitalized coronavirus patients at New York City hospitals and found that 31% were obese, with about 5% of all patients being morbidly obese.These findings published on July 6, 2020, support the need to consider the prevalence of obesity when planning a community's COVID-19 disease prevention program."},
{"date_time": "Jul 8, 2020 • 2:05 am CDT", "title": "Alaska's Contact-Tracing Changes Tactics", "content": "Anchorage Mayor Ethan Berkowitz explained his decision on July 7, 2020, to name establishments, mostly bars, where there was COVID-19 exposure. Berkowitz said the city would prefer to privately notify people who were at an establishment where they could have been exposed to the virus.But last week, the city reported its contact-tracing ability was maxed out.The Municipality of Anchorage named more than a dozen bars where people “who were infectious with COVID-19 spent extended time.”"},
{"date_time": "Jul 7, 2020 • 3:27 pm CDT", "title": "Contrasting SARS-2 with SARS-1 and Influenza Pandemics", "content": "A new study published in The Lancet on July 3, 2020, reported SARS-CoV-2 is less deadly but far more transmissible than SARS-1 or previous flu pandemics. The reproductive rate (R0) for SARS-CoV-2 is estimated to be 2.5, compared with 2.4 for SARS-1, Pandemic Influenza of 1918 of 2.0, and for the 2009 influenza pandemic, the RO was 1.7.And, SARS-CoV-2 causes mild or asymptomatic disease in most cases. However, severe illness occurs in a small proportion of infected individuals older than 70 years of age."},
{"date_time": "Jul 7, 2020 • 1:45 pm CDT", "title": "Is Now Time to Address Airborne Transmission of Coronaviruses?", "content": "An open letter published on July 6, 2020, by 239 scientists from 32 countries urges the World Health Organization and other bodies to address the potential for airborne transmission of the new coronavirus.The debate between the potential health risks caused by respiratory droplets and aerosols dates back to the 1930s.Separately, researchers stated in an early-release study to be published in September 2020, ‘that existing evidence is sufficiently strong to warrant engineering controls targeting airborne transmission as part of an overall strategy to limit infection risk indoors.’"},
{"date_time": "Jul 7, 2020 • 1:23 pm CDT", "title": "Japan May Contribute $800 Million To Purchase Coronavirus Vaccines ", "content": "Japan is in talks with potential partners to set up a $20 billion fund to jointly buy coronavirus vaccines, Nikkei reported on July 8, 2020. Japan is expected to contribute as much as $800 million, according to people familiar with the matter.Around 30 nations have said they intend to join the joint purchases, including Italy, Spain, Norway, Canada, and the European Union.Participating countries would agree to take no more than enough coronavirus vaccine for 20% of their population."},
{"date_time": "Jul 7, 2020 • 1:14 pm CDT", "title": "GSK and Medicago Collaboration to Develop COVID-19 Vaccine", "content": "GSK and Medicago announced on July 7, 2020, a collaboration to develop a COVID-19 candidate vaccine combining Medicago’s recombinant Coronavirus Virus-Like Particles (CoVLP) with GSK’s pandemic adjuvant system.Pre-clinical results with Medicago’s CoVLP vaccine candidate demonstrated high levels of neutralizing antibodies following a single dose when administered with an adjuvant. CoVLPs mimic the structure of the virus responsible for COVID-19 disease, allowing them to be recognized by the immune system."},
{"date_time": "Jul 7, 2020 • 12:50 pm CDT", "title": "Regeneron Announces $450 Million Agreement With BARDA and U.S. DoD for Antiviral Antibody Cocktail", "content": "Regeneron announced on July 7, 2020, the Biomedical Advanced Research and Development Authority has awarded a $450 million contract to manufacture and supply REGN-COV2, Regeneron's investigational double-antibody cocktail.REGN-COV2 is currently in Phase 2/3 clinical trials for the treatment of COVID-19 disease, and in a Phase 3 trial, for the prevention of COVID-19 infection, which is caused by the SARS-CoV-2 virus."},
{"date_time": "Jul 7, 2020 • 11:13 am CDT", "title": "Brazil's President Tests Positive for Coronavirus", "content": "Brazil's President Bolsonaro announced on TV on July 7, 2020, that he has tested positive for the coronavirus. This was Mr. Bolsonaro's 4th test, reported the BBC. Mr. Bolsonaro said that he had started experiencing symptoms on July 5th, when he had a high temperature, a cough, and had felt unwell.Brazil has reported over 65,000 fatalities related to COVID-19 disease during 2020.Previously, on June 30th, Brazil extended through July 29, 2020, its travel decree banning foreigners from entering the country by air, land, and sea."},
{"date_time": "Jul 7, 2020 • 8:34 am CDT", "title": "Over 2/3 of Infected Russians Have Recovered", "content": "Russia has documented 6,368 cases of COVID-19, a disease caused by the novel coronavirus, in the past 24 hours, with the daily increase rate reaching a record low of 0.9%, the anti-coronavirus crisis center informed TASS on July 7, 2020.In the past week, TASS reported the increase rate has not surpassed 1%. The total number of those infected in Russia has reached 694,230.Currently, 219,856 people (31.7%) diagnosed with COVID-19 are undergoing treatment in Russia."},
{"date_time": "Jul 7, 2020 • 8:19 am CDT", "title": "Most British Adults Will Get COVID-19 Vaccine", "content": "Nearly 5 in 6 Britons said they will get a coronavirus vaccine if and when one becomes available, according to the polling carried out by YouGov for the Center for Countering Digital Hate, reported the Guardian on July 6, 2020."},
{"date_time": "Jul 7, 2020 • 8:03 am CDT", "title": "California Firm Solves the UK's Ventilator Shortage", "content": "In an effort to overcome the shortage of ventilators in the UK, Veeva Systems announced on July 7, 2020, that it successfully scaled production to deliver more than 13,000 ventilators to the National Health Service."},
{"date_time": "Jul 7, 2020 • 6:58 am CDT", "title": "Lysol Products Found Effective Against Coronavirus", "content": "Late on July 6, 2020, the U.S. Environmental Protection Agency (EPA) announced the approval for 2 common products, Lysol Disinfectant Spray (EPA Reg No. 777-99) and Lysol Disinfectant Max Cover Mist (EPA Reg No. 777-127) are effective against the SARS-CoV-2 virus.Because novel viruses are typically not immediately available for laboratory testing, the EPA has now established guidance for Emerging Viral Pathogens."},
{"date_time": "Jul 7, 2020 • 5:46 am CDT", "title": "$1.6 Billion Funding Announced for Coronavirus Vaccine Development", "content": "The U.S. government's Operation Warp Speed announced on July 7, 2020, it has awarded Novavax $1.6 Billion in funding for the large-scale manufacturing of NVX-CoV2373, including the production of 100 million vaccine doses starting in late 2020."},
{"date_time": "Jul 7, 2020 • 5:28 am CDT", "title": "Updated: Coronations Vaccine Candidates", "content": "The SARS-CoV-2 vaccine development landscape includes innovative platforms such as nucleic acid (DNA and RNA), virus-like particle, peptide, viral vector (replicating and non-replicating), recombinant protein, live attenuated virus and inactivated virus approaches.This listing is updated as of July 7, 2020."},
{"date_time": "Jul 7, 2020 • 5:19 am CDT", "title": "Double-Antibody Cocktail Launches Late-Stage Study", "content": "On July 6, 2020, Regeneron Pharmaceuticals, Inc. announced the initiation of phase 3 clinical trials evaluating REGN-COV2, Regeneron's investigational double-antibody cocktail for the treatment and prevention of COVID-19 disease.REGN-COV2's two antibodies bind non-competitively to the critical receptor binding domain of the virus's spike protein, which diminishes the ability of mutant viruses to escape treatment and protects against spike variants that have arisen in the human population."},
{"date_time": "Jul 6, 2020 • 6:30 pm CDT", "title": "COVID-19 Molecular Testing Demand Surges", "content": "Quest Diagnostics says 'Since June 29, 2020, demand has continued to rise nationwide, particularly in the South, Southwest, and West regions of the USA, outpacing our testing capacity. As a result, the average turnaround time for reporting test results is now 1 day for priority 1 patients .... and 4-6 days for all other populations.''Over the month of July, we will continue to ramp up our capacity from 115,000 last week, to reach 150,000 molecular diagnostic tests a day,' stated a Quest press statement on July 6, 2020."},
{"date_time": "Jul 6, 2020 • 5:30 pm CDT", "title": "Spain's Herd Immunity Reaches Just 5%", "content": "The first nationwide population-based study in Spain presents seroprevalence estimates just 5% of people have antibodies against SARS-CoV-2. This study 's findings published on July 6, 2020, also indicate that children and adolescents have lower seroprevalence than adults, and seroprevalence does not vary by sex."}
]