[
  {"date_time": "Jul 22, 2020 • 6:32 pm CDT", "title": "Study:  Home Quarantine Found Ineffective ", "content": "July 21, 2020 Study: More than 20% of U.S. homes 'lack' sufficient space and plumbing facilities to comply with recommendations to quarantine people to limit the spreading of COVID-19 disease in a household.This study's finding is important since a significant number of COVID-19 cases are reported from single households, says the U.S. CDC."},
  {"date_time": "Jul 22, 2020 • 3:03 pm CDT", "title": "Update:  SARS-CoV-2 Vaccine Development Landscape", "content": "As of July 22, 2020, the U.S. FDA has not approved any preventive or therapeutic vaccines for use against either SARS, MERS, or SARS-CoV-2 coronaviruses. However, there are over 15 vaccine candidates in late-stage studies, which are listed on this webpage."},
  {"date_time": "Jul 22, 2020 • 8:09 am CDT", "title": "The USA Ordered 100 Million Vaccine Doses for $1.95 Billion", "content": "On July 22, 2020, Pfizer Inc. and BioNTech SE announced an agreement with the U.S. government that indicates 100 million doses of the BNT162 COVID-19 vaccine candidate will be delivered in 2021, after Pfizer successfully manufactures and obtains authorization from U.S. FDA."},
  {"date_time": "Jul 22, 2020 • 7:12 am CDT", "title": "France's COVID-19 Response: balancing conflicting traditions", "content": "On July 16, 2020, The Lancet published an article saying 'Simmering beneath the surface of France's centrally coordinated response to COVID-19 is a long-standing tension between two French public health traditions.''Under the pitiless spotlight cast by the COVID-19 pandemic, France's health system is heavily care-oriented to the detriment of preventive-approaches. This imbalance exacerbates the health system's fragility in the face of the COVID-19 pandemic.'"},
  {"date_time": "Jul 22, 2020 • 6:54 am CDT", "title": "NYC's Contact Tracers Offer Quarantine Rooms For You and Friends", "content": "New York City's contact-tracing program is operated by a large public health care system called NYC Health + Hospitals, that offers free coronavirus testing services. If you test positive, that means you have COVID-19 and are at risk of spreading it to others. A Contact Tracer will contact you to make sure you get the medical care and support you need to protect yourself and your loved ones.New York's Contact Tracers offer free, private hotels during the quarantine period. They will also ask you about who your close contacts to ensure they are separated from others.Contact tracing news is listed on this webpage."},
  {"date_time": "Jul 21, 2020 • 3:38 pm CDT", "title": "Opinion: Legal Approaches to Mandating Coronavirus Vaccinations", "content": "'I see 4 possible approaches that governments and employers can take to ensure enough Americans are immunized against COVID-19' ..... to create herd immunity protections for everyone ... said Debbie Kaminer, a Law Professor, Baruch College, CUNY, on July 21, 2020."},
  {"date_time": "Jul 21, 2020 • 1:41 pm CDT", "title": "Double-Dose Vaccines Double the Immunity Challenge", "content": "On July 20, 2020, Business Insider reported '2-doses of a vaccine may be better than one. But doubling the number of vaccinations each person needs could complicate efforts to immunize billions of people.' Unfortunately, data indicates about 50% of COVID-19 vaccines currently in development are double-dosers.Which presents a challenge for new vaccines to reach the 50% efficacy requirement the U.S. FDA established on June 30, 2020."},
  {"date_time": "Jul 21, 2020 • 12:36 pm CDT", "title": "French Firm Producing 100M Coronavirus Vaccine Doses in Scotland ", "content": "Valneva SE announced on July 20, 2020, it reached an agreement in principle with the UK government to provide up to 100 million doses of its VLA2001 vaccine candidate, which will be produced in Scotland."},
  {"date_time": "Jul 21, 2020 • 7:58 am CDT", "title": "NFL Players Protected By Contact-Tracers", "content": "The National Football League (NFL) has mandated certain contact tracing procedures, including the wearing of such devices, that must be followed by all team personnel while at a team's facility.And, the NFL has mandated football teams assign \"COVID protocol coordinators\" to manage the ongoing testing, screening, contact tracing and to enforce protocols, reported ESPN on July 20, 2020."},
  {"date_time": "Jul 21, 2020 • 6:44 am CDT", "title": "Study: Mosquitoes Unlikely Transmitters of Coronavirus", "content": "A new Kansas State University 's College of Veterinary Medicine study published in Scientific Reports on July 17, 2020, shows that mosquitoes are unlikely to transmit the SARS-CoV-2 betacoronavirus.'We demonstrate that even under extreme conditions, the SARS-CoV-2 virus is unable to replicate in these mosquitoes and therefore cannot be transmitted to people even in the unlikely event that a mosquito fed upon a viremic host,' concluded these K-State scientists."},
  {"date_time": "Jul 21, 2020 • 6:35 am CDT", "title": "About 11% of Korean Households Infected With Coronavirus", "content": "South Korean researchers detected COVID-19 disease in 11.8% of household contacts during 2020. The highest rate of transmission (18%) occurred with patients between the ages 10 to 19, while the lowest rate (5.3%) was in households with younger children, reported researchers from the Korean CDC, in an early release article on July 16, 2020."},
  {"date_time": "Jul 21, 2020 • 6:21 am CDT", "title": "UVC Disinfection Robot Searches For Coronavirus", "content": "Omron Asia announced the launch of the UVC-LD robot which operates autonomously and disinfects premises including the high-touch areas by eliminating 99% of bacteria and viruses -both airborne and droplet- by delivering the precise dosage of UVC energy.UVC light, which is ultraviolet radiation with wavelengths between 200 and 290 nm, has been proven to be effective in breaking down the pathogens’ DNA and RNA beyond recovery, thus stopping them from replicating."},
  {"date_time": "Jul 21, 2020 • 5:31 am CDT", "title": "Operation Quack Hack Has Identified 700 Coronavirus Fraudulent Products", "content": "The U.S. FDA announced Operation Quack Hack thas identified more than 700 fraudulent and unproven medical products related to COVID-19, as of June 2020. This team has reviewed thousands of websites, social media posts, and online marketplace listings, resulting in over 90 warning letters to sellers, more than 150 reports sent to online marketplaces, and more than 250 abuse complaints sent to domain registrars during 2020."},
  {"date_time": "Jul 21, 2020 • 5:20 am CDT", "title": "UK Health Secures 1 Million Doses of COVID-19 Neutralizing Antibodies", "content": "The UK government announced on July 20, 2020, it has secured access to treatments containing COVID-19-neutralising antibodies from AstraZeneca to protect those who cannot receive vaccines, such as cancer and immunocompromised patients.In principle, the agreement with AstraZeneca will provide 1-million doses of a treatment containing COVID-19 neutralizing antibodies during 2020."},
  {"date_time": "Jul 20, 2020 • 2:28 pm CDT", "title": "Disney Says No Eating or Drinking While Walking", "content": "The Disney World theme park in Orlando clarified that all guests and staff must wear an authorized facemask, except when swimming and dining. However, when eating or drinking without wearing a facemask, you must be sitting down.As of July 20, 2020, the city of Orlando, like most of the state of Florida, is experiencing a significant outbreak of SARS-CoV-2 infections."},
  {"date_time": "Jul 20, 2020 • 2:04 pm CDT", "title": "Bahamas Bans Americans By Boat or Plane", "content": "The Commonwealth of the Bahamas announced on July 19, 2020, that it is closing all of its airports and seaports to tourists from the USA, effective on July 22nd. And, Bahamasair, the country’s national carrier, will cease all outgoing flights to the USA immediately, Prime Minister Hubert Minnis said via Youtube."},
  {"date_time": "Jul 20, 2020 • 1:58 pm CDT", "title": "The UK Secures 100m Vaccine Doses From French Firm", "content": "Valneva SE announced on July 20, 2020, it reached an agreement in principle with the UK government to provide up to 100 million doses of its VLA2001 SARS-CoV-2 vaccine candidate, to be manufactured at its facilities in Scotland."},
  {"date_time": "Jul 20, 2020 • 5:48 am CDT", "title": "UK Secures 90 Million Vaccine Doses From 2 Sources", "content": "The UK's health leadership announced on July 20, 2020, it has signed deals to secure 90 million vaccine doses from an alliance of Pfizer Inc and BioNTech (30m), and French group Valneva (60m). These experimental vaccines target the SARS-CoV-2 coronavirus, which causes COVID-19 disease, according to Reuters.The UK now has 3 different types of coronavirus vaccines under contract, indicating a total of 230 million vaccine doses will be available, such as adenoviral vaccines (Oxford/AstraZeneca); mRNA vaccines (BioNTech/Pfizer, Imperial); inactivated whole virus vaccines (Valneva)."},
  {"date_time": "Jul 20, 2020 • 3:45 am CDT", "title": "GSK Announces $163 Million mRNA-Based Vaccine Collaboration", "content": "GSK and CureVac announced on July 20, 2020, a strategic collaboration agreement for the research, development, manufacturing, and commercialization of up to 5 mRNA-based vaccines and monoclonal antibodies (mAbs) targeting infectious disease pathogens. The collaboration complements GSK’s existing mRNA capabilities with CureVac’s integrated mRNA platform.However, CureVac’s existing COVID-19 mRNA vaccine research program, CVnCoV SARS-CoV-2, is reportedly not included in this agreement."},
  {"date_time": "Jul 19, 2020 • 6:56 pm CDT", "title": "Do Infectious Patients Stop Shedding?", "content": "On July 17, 2020, the U.S. CDC stated available data indicates that persons with mild to moderate COVID-19 remain infectious no longer than 10 days after symptom onset.And, persons with more severe to critical COVID-19 illness or severe immunocompromise likely remain infectious no longer than 20 days after symptom onset."},
  {"date_time": "Jul 19, 2020 • 6:48 pm CDT", "title": "Finding and Isolating Symptomatic Patients May Not Interrupt Virus Transmission", "content": "The U.S. CDC reported on July 17, 2020, a large contact-tracing study published in JAMA demonstrated that high-risk household and hospital contacts did not develop an infection if their exposure to a case-patient started ... 6 days or more .... after the case patient’s illness onset."},
  {"date_time": "Jul 19, 2020 • 11:16 am CDT", "title": "One California County Abandoned Coronavirus Contact-Tracing Efforts", "content": "Merced County officials have not attempted to conduct contact tracing for several weeks, reported NCJ on July 18, 2020. Kristyn Sullivan, Merced County’s supervising epidemiologist, said the county is now only doing case investigations, which means reaching out to infected people to tell them to quarantine.CalMatters reached out to 27 California counties to ask about their extent of contact tracing. Merced was the only county that confirmed in June 2020 that it was no longer conducting tracing efforts."},
  {"date_time": "Jul 19, 2020 • 10:56 am CDT", "title": "Russia Announces 2nd Coronavirus Vaccine Agreement", "content": "On July 17, 2020, Reuters announced Russia's agreement with AstraZeneca for it to produce a coronavirus vaccine (AZD1222) being developed by the firm and Oxford University. Alexey Repik, R-Pharm’s board chairman, confirmed his company had signed the deal.Separately, Kirill Dmitriev, head of the Russian Direct Investment Fund, told the SCMP: 'Russia’s acquisition of the British-developed vaccine was designed to complement, not replace, its own home-grown vaccine, Russian COVID-19 Vaccine, which is the one that Moscow is focusing on developing.'"},
  {"date_time": "Jul 19, 2020 • 8:32 am CDT", "title": "North Korea Developing Its Own Coronavirus Vaccine", "content": "According to a report posted by the North's State Commission of Science and Technology, Yonhap News stated on July 18, 2020, North Korea scientists are conducting clinical trials to develop a vaccine for COVID-19. The report said the vaccine development is led by a medical biology institute under the North's Academy of Medical Science using angiotensin-converting enzyme 2 (ACE2)."},
  {"date_time": "Jul 19, 2020 • 8:21 am CDT", "title": "Why Did the CDC Confuse Coronavirus Test Results?", "content": "Politico reported on July 17, 2020, the 'U.S. CDC pulled key coronavirus data off its own website, prompting various alarms.​ The CDC had previously acknowledged on May 21st, that it had been combining the results from viral and antibody COVID-19 tests... despite marked differences between these tests.In a statement, CDC spokeswoman Kristen Nordlund told The Hill, that 'when the agency began to track coronavirus testing, viral tests were far more commonly used nationwide than serology testing. Now that serology testing is more widely available, the CDC is working to differentiate those tests from the viral tests and will report this information, differentiated by test type, publicly on our COVID Data Tracker website.'Initially, NPR's WLRN station in Miami, Florida, reported on May 21, 2020, this practice of 'combining the tests inhibits the agency's ability to discern the country's actual testing capacity.'"},
  {"date_time": "Jul 19, 2020 • 5:43 am CDT", "title": "BCG Vaccination Associated With Reduced COVID-19 Risks", "content": "Researchers at the US National Institute of Allergy and Infectious Diseases identified on July 9, 2020, an ' associated linkage ' between the very old Bacille Calmette-Guerin (BCG) and the reduction in COVID-19 disease, after comparing mortality rates around the world.This study indicates that for every 10% increase in the BCG index, there was a 10.4% reduction associated with COVID-19 mortality.Results failed to confirm the null hypothesis of no association between BCG vaccination and COVID-19 mortality."},
  {"date_time": "Jul 18, 2020 • 4:44 pm CDT", "title": "Pooling Tests To Mitigate COVID-19 Result Backlogs Now Authorized", "content": "To help resolve the extensive testing backlog, the U.S. FDA reissued an emergency use authorization to Quest Diagnostics on July 18, 2020, authorizing the Quest SARS-CoV-2 rRT-PCR test for use with pooled samples containing up to 4 individual swab specimens collected under observation.Recently, Quest Diagnostics expanded its molecular diagnostic testing capacity to 150,000 per day."},
  {"date_time": "Jul 18, 2020 • 1:35 pm CDT", "title": "Are Anti-Mask Masks Legal in the USA?", "content": "'There is a new form of protests sweeping across the country as individuals put on anti-mask masks to defy mandatory mask rules in certain jurisdictions. The anti-masks are made of thin material, mesh, or even crochet and are advertised as having no protective qualities for the coronavirus that causes COVID-19 disease. The question is whether they are legal.''They appear to be so,' stated law professor Jonathan Turley, a nationally recognized legal scholar, on July 18, 2020."},
  {"date_time": "Jul 18, 2020 • 9:53 am CDT", "title": "JAMA Study: Beware Japan's Amabie", "content": "Amabié, a Japanese legendary mermaid-like creature who is said to emerge from the sea to prophesize good harvests and epidemics, is trending in Japan as a symbol of the current coronavirus pandemic, reported JAMA on July 17, 2020."},
  {"date_time": "Jul 18, 2020 • 9:48 am CDT", "title": "9 Additional MERS Cases Reported", "content": "The Kindom of Saudi Arabia reported 9 new MERS-CoV cases in April and May 2020, reported the WHO. Unfortunately, 5 MERS related fatalities were also disclosed.Six of these new MERS cases are linked to a hospital outbreak in Riyadh during late May.The emergence of the MERS betacoronavirus was first reported in Saudi Arabia during 2012."},
  {"date_time": "Jul 18, 2020 • 7:48 am CDT", "title": "CDC Recommendation:  How Long Should COVID-19 Related Isolation Last?", "content": "For most persons with COVID-19 illness, isolation and precautions can generally be discontinued .... 10 days after symptom onset, and resolution of fever for at least 24 hours, without the use of fever-reducing medications, said the U.S. CDC on July 17, 2020."},
  {"date_time": "Jul 18, 2020 • 6:14 am CDT", "title": "No Coronavirus Reinfections Reported in the USA", "content": "According to the U.S. CDC on July 17, 2020, during the 6 months of SARS-CoV-2 betacoronavirus infections in the USA, there have been no confirmed cases of SARS-CoV-2 reinfection."},
  {"date_time": "Jul 18, 2020 • 5:35 am CDT", "title": "Hong Kong Reports SARS-2 Has Surpassed SARS-1", "content": "The number of people confirmed with COVID-19 disease in Hong Kong now exceeds 1,755 cases, reported the SCMP on July 18, 2020. COVID-19 is caused from the betacoronavirus SARS-CoV-2.This SCMP report is an unfortunate milestone, indicating the current pandemic has surpassed very fatal SARS-1 outbreak in Hong Kong during 2003-2004."},
  {"date_time": "Jul 18, 2020 • 5:16 am CDT", "title": "5,000 People Enroll in Phase 3 Vaccine Study", "content": "Sheikh Abdullah bin Mohammed Al Hamed, Chairman of the Department of Health - Abu Dhabi, was the first person given the New Crown COVID-19 inactivated vaccine that is targeted to prevent COVID-19 disease.And, the Department of Health announced on July 17, 2020, the registration of over 5,000 volunteers for this late-stage study in Abu Dhabi."},
  {"date_time": "Jul 18, 2020 • 4:31 am CDT", "title": "Older Men at Greatest Risk of COVID-19 Disease", "content": "A study published don July 16, 2020, concluded in-hospital mortality increased markedly with increasing age, in men. These researchers authors found 'Persons aged 75–84 years had the highest the risk of hospital ICU admission compared to 18-49 years old.And, those men over 85 years of age experienced 11 times the risk of death.The leading comorbidities found during this study were immunosuppression, renal, lung, and cardiovascular diseases."},
  {"date_time": "Jul 18, 2020 • 4:14 am CDT", "title": "Plaquenil Marginally Reduced COVID-19 Symptoms", "content": "A new study published on July 16, 2020, found the use of Hydroxychloroquine (Plaquenil) did not substantially reduce symptoms in outpatients with early, mild COVID-19. At day 14 of the treatment protocol, 24% of participants receiving hydroxychloroquine had ongoing symptoms compared with 30% of patients receiving a placebo.\"Hydroxychloroquine did not substantially reduce symptom severity or prevalence, over time, in non-hospitalized persons with COVID-19,\" the authors of the study wrote."},
  {"date_time": "Jul 17, 2020 • 2:52 pm CDT", "title": "EU Activity Negotiating Coronavirus Vaccine Purcheses", "content": "The European Union is negotiating advance purchase deals of potential COVID-19 preventive vaccines with drugmakers such as Moderna, Sanofi, and Johnson & Johnson, as well as biotech firms BioNtech and CureVac, reported Reuters on July 17, 2020.Separately, on July 15, 2020, there are 165 countries representing more than 60% of the world’s population are engaging with COVAX to ensure fair access to SARS-CoV-2 vaccines."},
  {"date_time": "Jul 17, 2020 • 11:38 am CDT", "title": "Novartis Enables Access to 15 Medicines", "content": "Novartis announced on July 16, 2020, a new initiative to help patients in low-income and lower-middle-income countries access affordable medicines to treat the major symptoms of COVID-19.The Novartis COVID-19 portfolio includes 15 medicines from its Sandoz division for gastrointestinal illness, acute respiratory symptoms, pneumonia as well as septic shock. These medicines were chosen based on clinical relevance."},
  {"date_time": "Jul 17, 2020 • 11:16 am CDT", "title": "Motorcycle Fatality Recorded as COVID-19 Death", "content": "A person who died in a motorcycle accident was added to Florida’s COVID-19 death count, according to a state health official on July 16, 2021. Orland-based FOX 35 News found this out after asking Orange County Health Officer Dr. Raul Pino whether motorcycle victims had any underlying coronavirus-related conditions.“The first one didn’t have any. He died in a motorcycle accident,” Dr. Pino said."},
  {"date_time": "Jul 17, 2020 • 10:02 am CDT", "title": "People With Blood Type O Found Less Likely To Test Virus-Positive", "content": "The NYTimes stated on July 17, 2020, that people with Type O blood may be slightly less likely to be infected. But the effect is so small that people shouldn’t count on it.A study published on July 12, 2020, found COVID-19 disease patients with blood types B and AB who received a test were more likely to test positive. And, Rh+ patients were more likely to test positive.However, patients with blood type O were found less likely to test positive for COVID-19 disease."},
  {"date_time": "Jul 17, 2020 • 7:26 am CDT", "title": "Open a Few Windows To Reduce Virus Spreading", "content": "A study published in The Lancet previously said: 'air-conditioned environments enable large virus droplets to travel farther.' However, even the opening of an entrance door and a small window can dilute the number of droplets floating in the air after just 30 seconds.This is very relevant advice because poorly ventilated and populated spaces have high SARS-CoV-2 virus transmission rates despite physical distancing, stated the AAPS in June 2020."},
  {"date_time": "Jul 17, 2020 • 3:00 am CDT", "title": "San Antonio Texas Caught Over-Counting Thousands of Coronavirus Cases", "content": "“Since we report confirmed cases on our dashboard, we have removed 3,484 previously reported probable cases from the statewide and Bexar County totals,” Chris Van Deusen, a spokesman for the state health agency, reported the Austin American-Statesman on July 15, 2020.“The State of Texas today had to remove 3,484 cases from its COVID-19 positive count because the San Antonio Health Department was reporting ‘probable’ cases for people never actually tested, as 'confirmed' positive cases.\"On July 16, 2020, San Antonio Metro Health announced it is now separating cases confirmed by a positive molecular test from those that were detected by a positive antigen test combined with COVID-19 symptoms, otherwise known as “probable cases.”In a related announcement, Texas Governor Abbott said the U.S. Department of Defense is deploying a medical task force and additional resources to southern Texas."},
  {"date_time": "Jul 17, 2020 • 2:45 am CDT", "title": "Overview: The 2009 H1N1 Pandemic", "content": "The (H1N1)pdm09 virus was very different from H1N1 influenza viruses that were circulating at the time of the pandemic in 2009, says the U.S. CDC. From April 2009 to April 2010, the CDC estimated there were 60.8 million cases, 274,304 hospitalizations, and 12,469 deaths in the USA due to the (H1N1)pdm09 virus.Additionally, the CDC estimated that up to 575,400 people worldwide died from (H1N1)pdm09 virus infection during the first year of circulation. And, about 80% of virus-related fatalities were younger than 65 years of age.During August 2010, the WHO declared an end to the global 2009 H1N1 pandemic. However, the (H1N1)pdm09 virus continues to circulate as a seasonal flu virus and causes fatalities every year."},
  {"date_time": "Jul 17, 2020 • 2:26 am CDT", "title": "Cruise Ship No-Sail Order Extended", "content": "On July 16, 2020, the U.S. CDC extended the No Sail Order and Suspension of Further Embarkation through September 2020, in reaction to the continuation of the coronavirus pandemic. Accordingly, the Director of CDC 'finds that cruise ship travel exacerbates the global spread of COVID-19 disease.'However, the CDC is allowing crew members currently at sea to disembark in U.S. waters."},
  {"date_time": "Jul 17, 2020 • 2:07 am CDT", "title": "Employees Received 'Pre-Test' Vaccinations", "content": "Sinovac announced that about 30 employees, including top executives, received experimental shots of the CoronaVac SARS-CoV-2 vaccine even before the government approved testing in people, reported the AP on July 16, 2020.Sinovac’s claim that these “special volunteers” were administered the CoronaVac vaccine candidate even before the company got permission for its initial human study."},
  {"date_time": "Jul 16, 2020 • 2:20 pm CDT", "title": "Columbia University Joins COVID-19 Research Collaboration", "content": "Tonix Pharmaceuticals Holding Corp. announced on July 16, 2020, it has entered into a research collaboration and option agreement with Columbia University. The research is designed to fill important gaps in understanding the detailed immune responses to COVID-19 disease and to provide a foundation upon which to target vaccines and therapeutics to appropriate individuals by precision medicine.The research collaboration will focus on T cell and antibody responses to SARS-CoV-2 (CoV-2), the virus that causes COVID-19 at the cellular level including human monoclonal antibodies and anti-idiotypes.The two principal investigators for the collaboration are Ilya Trakht, Ph.D., Associate Research Scientist, and Sergei Rudchenko, Ph.D., Assistant Professor of Medical Sciences at Columbia University Vagelos College of Physicians and Surgeons."},
  {"date_time": "Jul 16, 2020 • 2:10 pm CDT", "title": "Russia Approves COVID-19 Treatment Study", "content": "RedHill Biopharma Ltd. announced on July 16, 2020, the Ministry of Health of the Russian Federation approved its Clinical Trial Authorization application for a Phase 2/3 study evaluating opaganib (Yeliva) as a COVID-19 treatment in patients hospitalized with severe SARS-CoV-2 infection and pneumonia.A study was also recently approved in the UK to evaluate Yeliva, and a similar application is under review in Italy."},
  {"date_time": "Jul 16, 2020 • 12:12 pm CDT", "title": "Each Alaska District Has School Reopening Authority", "content": "As fall approaches, each US state is developing its own approach to school reopening, with plans varying widely. As an example, the state of Alaska is using the evidence-based Smart Start 2020 framework for the 2020-2021 academic year. Published on July 15, 2020, the Alaska Department of Education and Early Development (DEED) is requesting each district use this framework to build a comprehensive plan for teaching and learning in the upcoming school year and submit the plan to the department.However, the DEED guidance is not mandated, or state required, as local school districts have the authority, responsibility, and flexibility to make decisions for their communities.Another option to consider is the American Academy of Pediatrics's guidelines for school reopening, which recommend the goal of having students physically present in school."},
  {"date_time": "Jul 16, 2020 • 11:04 am CDT", "title": "Good or Bad, AstraZeneca's COVID-19 Vaccine News Coming Soon", "content": "Clinical trial results on the AZD1222 SARS-CoV-2 vaccine candidate being developed by AstraZeneca and Oxford University will be published on July 20, 2020, The Lancet reported.The WHO’s chief scientist said in June that AZD1222 was probably the most advanced vaccine in terms of development, stated the Reuters."},
  {"date_time": "Jul 16, 2020 • 9:43 am CDT", "title": "165 Countries Have Joined COVAX", "content": "Seventy-five countries have submitted expressions of interest to join the COVAX Facility, a mechanism designed to guarantee rapid, fair, and equitable access to COVID-19 vaccines worldwide reported the WHO on July 15, 2020.Together, this new group and previous country commitments, now total 165 countries that represent more than 60% of the world’s population.The goal of COVAX is by the end of 2021 to deliver two billion doses of safe, effective vaccines that have passed regulatory approval and/or WHO prequalification."},
  {"date_time": "Jul 16, 2020 • 2:30 am CDT", "title": "Study: Antibody Response to SARS-CoV-2 Spike Proteins Does Differ", "content": "The U.S. FDA published an overview on July 10, 2020, which says 'although multiple vaccine candidates against SARS-CoV-2 based on viral spike protein are under development, there is limited information on the scientific quality of antibody responses generated against them.'This new study found three antigens (S1+S2 ectodomain, S1 domain, and RBD) generated strong neutralizing antibodies against SARS-CoV-2... but not S2."},
  {"date_time": "Jul 16, 2020 • 2:06 am CDT", "title": "Coronavirus Fatalities is Not the Only Concern", "content": "An article in The Guardian on July 12, 2020, concluded that saying only 1% of people who get COVID-19 disease will die isn’t entirely wrong.But there’s a problem. Fatalities are not the only issue that a disease can cause.As an example, measles kills about 0.2% of people who catch it, but it leaves some people deaf, others with brain damage, and may cause permanent immune system damage."},
  {"date_time": "Jul 15, 2020 • 5:38 pm CDT", "title": "Kidney Co-Morbidities Reported Most Often With Hospitalized COVID-19 Patients", "content": "Chronic kidney disease and kidney failure were the most common underlying conditions in hospitalized COVID-19 patients, according to a Fair Health report published on July 14, 2020.Diabetes type 2 was the second-ranked comorbidity of patients hospitalized for COVID-19 in the USA, between January-May 2020."},
  {"date_time": "Jul 15, 2020 • 5:27 pm CDT", "title": "Plaquenil Antiviral Found Ineffective When Treating Serious COVID-19 Patients", "content": "A non-peer-reviewed study published on July 15, 2020, found patients hospitalized with COVID-19, hydroxychloroquine was not associated with reductions in 28-day mortality in COVID-19 disease patients, but was associated with an increased length of hospital stay, and increased risk of progressing to invasive mechanical ventilation or death."},
  {"date_time": "Jul 15, 2020 • 3:54 pm CDT", "title": "Pittsburgh Seeking 750 Vaccine Study Participants", "content": "Researchers are looking for 750 people to join clinical trials for vaccine candidates that hopefully will prevent infections from the SARS-CoV-2 coronavirus that causes COVID-19 disease, the University of Pittsburgh Medical Center said on July 15, 2020.Recruitment for the Pittsburgh location for the trials is beginning immediately. The initial vaccine candidate being tested is from Moderna Inc., mRNA-1273, which is an mRNA vaccine.Click here to learn more and to sign up for the Pittsburgh-based trials."},
  {"date_time": "Jul 15, 2020 • 10:26 am CDT", "title": "Sections of Spain Return to Lockdown", "content": "About 160,000 residents living in the Catalonia region were instructed to returned home-confinement on July 15, 2020, as Spain's health authorities relaunch coronavirus control and reduction measures. This region reported nearly 1,000 cases in the previous 24 hours, said TheLoca l.Catalan authorities are also watching SARS-CoV-2 infection rates in this northeastern region, notably advising that the residents near Hospitalet de Llobregat, a city with 260,000 residents -- only leave home for urgent necessities."},
  {"date_time": "Jul 15, 2020 • 8:52 am CDT", "title": "22 European Countries Successfully Reopened Schools", "content": "According to the WSJ reporting on July 14, 2020, there have been 22 eu­ropean coun­tries that re­opened schools this spring largely avoided coronavirus out­breaks, with no ma­jor flare-ups af­ter stu­dents re­turned to class­rooms.Continued school closures risk “scarring the life chances of a generation of young people,” according to an open letter signed on June 17, 2020, by more than 1,500 members of the United Kingdom’s Royal College of Paediatrics and Child Health."},
  {"date_time": "Jul 15, 2020 • 7:38 am CDT", "title": "Friday Night Lights Delayed in Austin", "content": "In the football loyal area of central Texas, Austin-Travis County Interim Health Authority Dr. Mark Escott took a range of actions to enhance protections against the spread of COVID-19 effective July 14, 2020.According to this Order, school systems, such as football-focused Westlake and Lake Travis, cannot reopen for on-campus, face-to-face instruction until after Sept. 7th. Additionally, no extracurricular sports or activities are allowed to take place until school systems reopen for on-campus instruction.Which means, the famous Friday Night Lights high-school games in Texas will be delayed in 2020."},
  {"date_time": "Jul 15, 2020 • 6:14 am CDT", "title": "Inaccurate Test Reporting Confuses Public", "content": "Several lab companies that process coronavirus tests from Florida have reported incomplete data to the state, creating discrepancies in the numbers public health officials rely on to track the pandemic across Florida communities, reported the Orlando Sentinel on July 14, 2020.About 2.7 million coronavirus tests have been conducted in and the number of unreported negative tests is unclear."},
  {"date_time": "Jul 15, 2020 • 6:01 am CDT", "title": "Status: 179 Coronavirus Tests Authorized", "content": "As of July 14, 2020, the U.S. FDA has authorized 179 coronavirus diagnostic tests under emergency authorizations, which include 148 molecular tests, 29 antibody tests, and 2 antigen tests."},
  {"date_time": "Jul 15, 2020 • 2:10 am CDT", "title": "New York's Enforcement Teams Great Visitors With Mandates and $2,000 Fines", "content": "The Governor of New York issued an Order of Summary Action which means that visitors to New York from 19 US states 'must' provide their contact information upon arrival. Failure to comply with this Order can result in a non-disputable summon and fines up to USD $2,000.“We’re serious about enforcing quarantine,” New York Governor Cuomo tweeted on July 13, 2020.Enforcement teams will be stationed at airports statewide to meet arriving aircraft at airport gates and greet disembarking passengers to request proof of completion of the State Department of Health traveler form."},
  {"date_time": "Jul 14, 2020 • 6:30 pm CDT", "title": "Does Blood Type O Actually Reduce COVID-19 Risk?", "content": "Dr. Lewis Kaplan, a professor of surgery at the University of Pennsylvania who is president of the Society of Critical Care Medicine, offered the following insight to NBC News on July 7, 2020. 'Even if some people have reduced risks based on blood type, such as O, they don't have zero risks,' Dr. Kaplan said.'It might mean they have less risk, but if you engage in risky behavior, we don't know just how much risk you need to incur to overwhelm the immune protection you might have.'"},
  {"date_time": "Jul 14, 2020 • 4:33 pm CDT", "title": "Coronavrius Vaccines Show Positive Study Results", "content": "Moderna, Inc. announced on July 14, 2020, the interim analysis of the open-label Phase 1 study of its mRNA-1273 vaccine candidate published in the NEJM which evaluated a 2-dose vaccination schedule.Results from participants in the initial dose cohorts who received both vaccinations and were evaluated at pre-specified timepoints show the mRNA-1273 vaccine induced rapid and strong immune responses against SARS-CoV-2."},
  {"date_time": "Jul 14, 2020 • 3:04 pm CDT", "title": "Florida Department of Health: 'some labs have over-reported positive test results'", "content": "Various testing labs in Florida have reported a 100% positivity rate, which means every single person tested was positive for coronavirus. Other Florida labs had very high positivity rates. FOX 35 News found on July 14, 2020.As an example, FOX 35 reporting showed that Orlando Health had a 98% positivity rate. However, when FOX 35 News contacted the hospital, they confirmed errors in the report.Orlando Health's positivity rate was actually only 9.4%."},
  {"date_time": "Jul 14, 2020 • 10:26 am CDT", "title": "Where Can I Get a US Passport?", "content": "To prevent the spread of the coronavirus that causes COVID-19 disease, the US Department of State 'significantly reduced passport operations in March 2020 and temporarily suspended expedited passport processing and restricted service to cases involving life-or-death emergencies.As US states begin to reopen, the State Department is resuming operations in 'phases'.As of Monday, July 13, 2020, there are 5 passport agencies and centers in phase two and 11 others in phase one of our reopening plan. US passport services will assist customers who need a passport in the next 72 hours (3 business days) for a life-or-death emergency."},
  {"date_time": "Jul 14, 2020 • 8:40 am CDT", "title": "Plant-Based Vaccine Launches Phase 1 Study", "content": "A plant-derived COVID-19 vaccine candidate announced it administered the first doses in healthy human volunteers on July 14, 2020. Unlike traditional vaccination development, Medicago does not use animal products or live viruses to create its products. Instead, it uses Virus-Like Particles that mimic the shape and dimensions of a virus, which allows the body to recognize them and create an immune response in a non-infectious way.Medicago said it is also planning a Phase 2/3 trial to be initiated this October 2020."},
  {"date_time": "Jul 14, 2020 • 8:32 am CDT", "title": "Vaccine Candidate Avoids the D614G Mutation", "content": "IMV Inc. announced on July 14, 2020, it received an agreement with Health Canada on Phase 1 clinical study design protocol. According to the company, the selected vaccine targets are located outside of the 614 mutation which, according to recent research, has been demonstrated to increase the coronavirus’s ability to infect cells, and suggested to potentially reduce vaccine-induced immunity."},
  {"date_time": "Jul 14, 2020 • 8:13 am CDT", "title": "MIT & 3M Developing Rapid Coronavirus Detection Test", "content": "3M and researchers at MIT said on July 14, 2020, they are testing a new rapid test that detects the coronavirus. The test is in the Rapid Acceleration of Diagnostics Tech (RADx Tech) program, an aggressively-paced COVID-19 diagnostics initiative from the NIH’s National Institute of Biomedical Imaging and Bioengineering."},
  {"date_time": "Jul 14, 2020 • 5:07 am CDT", "title": "Madrid Spain's Symptoms Include the Loss of Smell", "content": "A new study published in The Lancet on July 8, 2020, found the majority (95%) of the Spanish population is seronegative to SARS-CoV-2 infection, even in hottest-areas, such as Madrid (10%).Specifically, individuals with anosmia (the loss of the sense of smell) or at least 3 identifiable symptoms, the seroprevalence reached about 15%."},
  {"date_time": "Jul 13, 2020 • 11:56 pm CDT", "title": "Houston Basketball Star Tests Positive For Coronavirus", "content": "The NBA Houston Rockets superstar Russell Westbrook said via Twitter on July 13, 2020, that he had recently tested positive for the novel coronavirus SARS-CoV-2, and is now in quarantine. Westbrook, a 9-time All-Star, becomes the NBA’s most visible player infected with SARS-CoV-2.The NBA’s “bubble site\" in Orlando, is where the 2019-20 season will restart, has recently become a Florida hot-spot for COVID-19 disease cases."},
  {"date_time": "Jul 13, 2020 • 11:47 pm CDT", "title": "Russian COVID-19 Vaccine Availability Begins Mid-August 2020", "content": "The Gamalei Center's leader Alexander Gintsburg stated on July 13, 2020, that he hopes the Russian COVID-19 vaccine will “enter civil circulation” on Aug. 12-14, 2020. He added that he hopes private companies would begin mass production by September 2020, reported the Moscow Times.“The research has been completed and it proved that the vaccine is safe,” Yelena Smolyarchuk, the head of Sechenov University’s clinical research center, told TASS."},
  {"date_time": "Jul 13, 2020 • 7:49 pm CDT", "title": "Coronavirus Test Results Delivered in .... 7 Days", "content": "Demand for COVID-19 testing continues to soar, further extending turnaround times for test results, stated Quest Diagnostics on July 13, 2020, one of the largest labs in the USA.As a result, our average turnaround time for reporting test results is more than 1 day for priority 1 patients. However, the average turnaround time for all other populations is 7 or more days.But, there is some good news .... by the end of July 2020, Quest expects to have the capacity to perform 150,000 molecular diagnostic tests a day."},
  {"date_time": "Jul 13, 2020 • 7:24 pm CDT", "title": "New Zealand Opens Back Up", "content": "Although many governments around the world are still advising against “non-essential” international travel, a number of travel destinations are beginning to ease their COVID-19 disease lockdown measures and border restrictions and are moving toward welcoming tourists back.On July 1, the European Union announced it would be reopening its external border to 15 countries in a bid to boost its travel industry.And now, New Zealand is operating under Alert Level 1, which means people within New Zealand are able to travel and mix more freely. However, people entering New Zealand must stay in managed isolation or quarantine for at least 14 days and test negative for COVID-19 before they can go into the community.As of July 13, 2020, New Zealand reported 25 active cases, said the U.S. Embassy."},
  {"date_time": "Jul 13, 2020 • 6:07 pm CDT", "title": "Antibody Response Informs Vaccine Design", "content": "Scientists from the U.S. FDA have identified specific areas on the so-called ‘spike protein’ of SARS-CoV-2 coronavirus that appears to be key to triggering strong protective antibody responses ... in rabbits.The spike proteins are molecules emerging from the surface of the virus, one part of which the virus uses to attach to a cell and another to fuse with the cell membrane, enabling SARS-CoV-2 to infect the cell, reported the FDA on July 10, 2020."},
  {"date_time": "Jul 13, 2020 • 5:59 pm CDT", "title": "Airborne Transmission:  Theoretical Considerations of the Available Evidence", "content": "'All told, the current understanding about SARS-CoV-2 transmission is still limited,' said researchers in a study published in JAMA on July 13, 2020. There are no perfect experimental data proving or disproving droplet vs aerosol-based transmission of SARS-CoV-2.The balance of evidence, however, seems inconsistent with the aerosol-based transmission of SARS-CoV-2, particularly in well-ventilated spaces, and outdoors.To be sure, there are 'rarely absolutes in biological systems since people produce both droplets and aerosols' and virus transmission may take place along a long spectrum of options."},
  {"date_time": "Jul 13, 2020 • 5:06 pm CDT", "title": "France Lacks Population Immunity", "content": "The country of France has been heavily affected by the SARS-CoV-2 pandemic and went into a national lockdown on March 17, 2020. To better understand the impact, a new analysis found that 2.9% of virus-infected individuals were hospitalized and 0.5% of those who were severely infected patients died.And across all ages, men are more likely to be hospitalized, enter intensive care, and die.Furthermore, this study published on July 11, 2020, says 'France's population immunity appears to be insufficient.'"},
  {"date_time": "Jul 13, 2020 • 4:48 pm CDT", "title": "COVID-19 Antibody Protection Wanes In Months", "content": "COVID-19 patients who have recovered from the coronavirus-caused disease may lose their immunity within a few months, reported a non-peer-reviewed study, which was published on July 11, 2020.This study has important implications when considering widespread serological testing, antibody protection against re-infection, and the durability of vaccine protection.These researchers suggest that this transient antibody response is a feature shared by both a SARS-CoV-2 infection and the circulating seasonal coronaviruses that are associated with common colds. Coronaviruses are the 2nd leading cause of the common cold, after rhinoviruses, says the U.S. CDC."},
  {"date_time": "Jul 13, 2020 • 3:27 pm CDT", "title": "US Army Dispatches Medical Reinforcements to Texas", "content": "Texas Governor Greg Abbott announced on July 13, 2020, the U.S. Army Urban Augmentation Medical Task Forces (UAMTF) has been mobilized to assist the state's efforts to combat the COVID-19 disease outbreak. At the Governor's request, one UAMTF unit already arrived in San Antonio on July 6th, with additional units soon to arrive in other cities.These UAMTF teams consist of medical and support professionals who are being deployed to support medical needs in hospitals throughout the state of Texas."},
  {"date_time": "Jul 13, 2020 • 2:16 pm CDT", "title": "K-State Co-Developing Coronavirus Vaccine Candidate", "content": "Tonix Pharmaceuticals announced on July 13, 2020, a new preclinical research and option agreement with Kansas State University (K-State) to develop a vaccine candidate for the prevention of COVID-19 that utilizes a novel live virus vaccine vector platform and the CD40-ligand, also known as CD154 or 5c8 antigen, to stimulate T cell immunity.K-State will advance the preclinical development of a live replicating virus vaccine to protect against COVID-19 based on the bovine parainfluenza virus.“As the world’s foremost global food and biosecurity science university, K-State is committed to understanding and combatting zoonotic diseases and the viruses that cause them like SARS-CoV-2,” said Dr. Peter Dorhout, Vice President for Research at K-State."},
  {"date_time": "Jul 13, 2020 • 1:39 pm CDT", "title": "Novel Biologic Approved For Hospitalized COVID-19 Patients in India", "content": "Biocon Ltd. presented key insights into the results of the pivotal study that demonstrated its novel biologic, Itolizumab, significantly reduced mortality in moderate to severe ARDS (acute respiratory distress syndrome) patients hospitalized with COVID-19, in India.This information led to the Drug Controller General of India approving this novel biologic therapy, Itolizumab, for restricted emergency use in India, on July 13, 2020."},
  {"date_time": "Jul 13, 2020 • 11:03 am CDT", "title": "Disneyland Closes in Hong Kong Again", "content": "Hong Kong Disneyland is closing on July 15, 2020, after an outbreak of COVID-19 disease was confirmed, according to a theme park blog. Hong Kong Disneyland reopened on June 18, 2020, with limited capacity and increased health and safety measures.According to WDW News Today, there were about 50 new coronavirus cases reported in the Hong Kong region on July 13th.Across the world in Orlando, Florida, Disney guests may have to get their temperature taken. If any member of a party has a temperature of 100.4 or higher, the entire party will be denied entry.But, a “cool off” period will be allowed if a Guest fails the screening the first time, just to make sure no environmental causes could be the reason for high temperature, stated this blog post."},
  {"date_time": "Jul 13, 2020 • 10:23 am CDT", "title": "China Vaccine Production Factory Breaks Ground", "content": "China's new COVID-19 vaccine factory in a free-trade zone near the city of Ningbo, in Zhejiang province, announced its groundbreaking on July 11, 2020. The project is implemented in three phases, of which the first phase invests 1.3 billion yuan to build a new crown vaccine industrialization, high-level biological laboratory, and a new human rabies vaccine.Ningbo authorities expected the vaccine production lines to be operational by March 2021, said a digital media post from the local government."},
  {"date_time": "Jul 13, 2020 • 9:54 am CDT", "title": "Which Virus Caused Pneumonia ... Coronavirus Or Influenza", "content": "Using CT scans to distinguish the source of pneumonia between COVID-19 disease and from an influenza virus is very complicated. A new study published in July 2020, found 'most lesions in patients with COVID-19 pneumonia were located in the peripheral zone and close to the pleura.Whereas, the influenza infections generated pneumonia cases were more prone to show mucoid impaction and pleural effusion.This study found that the axial distribution of COVID-19 pneumonia was most often in the peripheral zone (67.3%), and the most important characteristic was that the largest lesion was close to the pleura (69.2%).Lesions from influenza virus pneumonia had more diffuse (35.6%) or random (33.3%) distribution and the largest lesion was close to the pleura (40%) less often than was seen in patients with COVID-19 pneumonia."},
  {"date_time": "Jul 13, 2020 • 9:38 am CDT", "title": "Study: Live Bio-Therapeutic Treatment for COVID-19 Patients Improves Outcomes", "content": "ExeGi Pharma announced on July 13, 2020, the results of a 70-patient clinical trial evaluating a new biologic drug candidate in hospitalized COVID-19 patients. This study compared outcomes of patients who received standard drug treatments alone or standard treatments combined with an oral bacteriotherapyAll patients treated in this study with standard therapy plus bacteriotherapy survived the COVID-19 illness, and none required invasive mechanical ventilation or ICU admission."},
  {"date_time": "Jul 13, 2020 • 9:12 am CDT", "title": "Another COVID-19 Vaccine Receives Fast-Track Status", "content": "On July 13, 2020, Pfizer Inc. and BioNTech SE announced that 2 of the companies’ 4 investigational vaccine candidates from their BNT162 mRNA-based vaccine program received Fast Track designation from the U.S. FDA.Subject to regulatory approval, the companies are expecting to start a Phase 2b/3 trial later this summer and are anticipating enrolling up to 30,000 subjects."},
  {"date_time": "Jul 13, 2020 • 5:11 am CDT", "title": "Queensland Doses 1st Coronavirus Vaccine ", "content": "The first human clinical trial of the University of Queensland's COVID-19 vaccine candidate launched on July 13, 2020. Up to 120 adult volunteers will receive a dose of the vaccine at the Brisbane clinic in Australia.“Testing showed that the vaccine was effective in inducing antibodies that were able to neutralize the virus. Further studies have shown that the vaccine was safe to give to people.”"},
  {"date_time": "Jul 12, 2020 • 8:23 pm CDT", "title": "Children and Women Report Fewer Coronavirus Cases", "content": "In a population-based study in Iceland published in NEJM, researchers found young children and females were less likely to test positive for SARS-CoV-2 than adolescents or adults and males.Whether the lower incidence of coronavirus infection in these 2 groups resulted from less exposure to the virus, or from biologic resistance, was not known by these researchers."},
  {"date_time": "Jul 12, 2020 • 6:53 pm CDT", "title": "US Government Extends COVID-19 Testing in It's #3 and #9 Metro Areas", "content": "On July 12, 2020, Texas Governor Greg Abbott announced that the U.S. Department of Health and Human Services has extended federal support of Community Based Testing Sites in Dallas and Houston through July 31, 2020.\"There are over 900 testing sites across the state of Texas, and I urge Texans in need of a SARS-CoV-2 coronavirus test to find a site nearest them.\"As of July 12, 2020, the state of Texas, with 29 million residents, had confirmed over 3,200 fatalities related to COVID-19 disease."},
  {"date_time": "Jul 12, 2020 • 3:35 pm CDT", "title": "Russian Coronavirus Vaccine Passes Test", "content": "On July 12, 2020, Sechenov University announced the completion of the Russia COVID-19 vaccine candidate's clinical trial. The university began clinical trials of the vaccine produced by Russia’s Gamalei Institute of Epidemiology and Microbiology on June 18th."},
  {"date_time": "Jul 12, 2020 • 11:39 am CDT", "title": "CDC Update: Mortality Rate Declines for 11th Week", "content": "Based on death certificate data, the U.S. CDC reported the percentage of deaths attributed to pneumonia, influenza, or COVID-19 disease (PIC) decreased from 6.9% during week #26 to just 5.5% during week #27.This CDC data represents the 11th week of declining mortality percentages due to PIC in the USA, as of July 10, 2020."},
  {"date_time": "Jul 12, 2020 • 11:25 am CDT", "title": "Editorial: Vaccines & Convalescent Plasma for COVID-19", "content": "A new editorial published by BMJ on July 9, 2020, says 'We have good reason to be cautious about these preventive vaccines and passive immunity approaches. Passive immunity, using convalescent plasma from recovered patients or monoclonal antibodies with high levels of neutralizing antiviral activity, has the potential for both therapy and prevention.''Understandably, there are great public expectations that these efforts will be successful, but caution is necessary with respect to both vaccines and passive immunity.''These immunological tools will at best complement public health vigilance, preparedness, and early control measures, which will remain vital for combating future potential pandemics.'"},
  {"date_time": "Jul 12, 2020 • 10:29 am CDT", "title": "Chinese Vaccine Company Discusses Phase 3 Study", "content": "CanSino Biologics announced on July 11, 2020, it is in talks with Russia, Brazil, Chile, and the Kingdom of Saudi Arabia to launch a Phase III clinical trial of its experimental COVID-19 vaccine known as Ad5-nCoV, reported Reuters."},
  {"date_time": "Jul 12, 2020 • 10:06 am CDT", "title": "Hungary Launches Red, Yellow, and Green Travel Bans", "content": "Hungarian authorities announced on July 12, 2020, that they would put countries in 3 categories – red, yellow, and green – based on their rate of new coronavirus infections. And, travel restrictions including entry bans and mandatory quarantines will be imposed, depending from which country people were coming from, reported Reuters on Twitter.Red category countries are banned for entry, which includes, but are not limited to, Albania, Ukraine, Belarus, and all of Asia, Africa, and South & Central America. Hungarian citizens arriving from those locations will be quarantined for 2-weeks or until they test negative twice, 48 hours apart.Hungary, which has a population of around 10 million, had recorded 595 coronavirus related fatalities during 2020."},
  {"date_time": "Jul 12, 2020 • 9:53 am CDT", "title": "COVID-19 Symptoms Linger For Months", "content": "Almost 90% of COVID-19 disease patients discharged from a Rome, Italy hospital were experiencing at least 1 related symptom 2-months later, reported a study published in JAMA on July 9, 2020 shows. Fatigue and shortness of breath were the most common symptoms found.And, 55% of COVID-19 patients were still experiencing 3 symptoms after discharge."},
  {"date_time": "Jul 11, 2020 • 2:04 pm CDT", "title": "Can Schools Learn Reopening Lessons Already Learned", "content": "When Science looked at reopening strategies from South Africa to Finland to Israel on July 7, 2020, some encouraging patterns emerged. Together, they suggest a combination of keeping student groups small and requiring masks and some social distancing helps keep schools and communities safe.And, that younger children rarely spread the virus to one another or bring it home.But it isn’t just about the adjustments a school makes. It’s also about how much virus is circulating in the community, which affects the likelihood that students and staff will bring COVID-19 into their classrooms."}
]