[
{"date_time": "Aug 11, 2020 • 5:19 pm CDT", "title": "Coronavirus Prevention Phase 3 Study Seeks Healthy Adults", "content": "The U.S. NIAID announced on August 10, 2020, two Phase 3, randomized, placebo-controlled, double-blind clinical trials testing whether experimental monoclonal antibodies (mAbs) can prevent infection by SARS-CoV-2 coronavirus are now enrolling healthy adults at clinical trial sites in the USA. Many of the trial sites are part of the recently launched COVID-19 Prevention Network.Monoclonal antibodies are laboratory-made versions of proteins naturally produced by the immune system in response to invading viruses or other pathogens. Neutralizing antibodies, whether natural or monoclonal, can bind directly to portions of viruses that they use to attach to and enter cells, preventing them from initiating the infection cycle. Monoclonal antibodies may provide short-term protection from the SARS-CoV-2 coronavirus."},
{"date_time": "Aug 11, 2020 • 3:42 pm CDT", "title": "Sputnik V Vaccine Launches Against Coronavirus", "content": "Announced by the Russian Direct Investment Fund (RDIF) on August 11, 2020, the Russian vaccine “Sputnik V” has been launched becoming the world’s first registered COVID-19 vaccine and evoking memories of the 1957 launch of a Soviet satellite, which opened space to exploration by humans.Based on an innovative technological platform of adenovirus-based vectors, which make it easier and faster to create new vaccines by modifying the initial carrier vector with genetic material from new emerging viruses. Such vaccines provoke a strong response from a human body in order to build immunity while the overall process of vector modification and pilot-scale manufacturing takes only a few months.Since the start of the COVID-19 disease pandemic in late 2019, Russian vaccine researchers decided to use this already proven technology instead of going into uncharted territory, said the RDIF."},
{"date_time": "Aug 11, 2020 • 3:28 pm CDT", "title": "COVID-19 Disease Defeats The Big Ten in 2020", "content": "The Big Ten Conference announced on August 11, 2020, the postponement of the 2020-21 fall sports season due to ongoing health and safety concerns related to the COVID-19 pandemic. This decision includes all regular-season contests and Big Ten Championships and Tournaments.\n“Our primary responsibility is to make the best possible decisions in the interest of our students, faculty, and staff,” commented Morton Schapiro, Chair of the Big Ten Council of Presidents/Chancellors and Northwestern University President."},
{"date_time": "Aug 11, 2020 • 11:38 am CDT", "title": "Will Children Carry Coronavirus to Kindergarten?", "content": "Research published on July 30, 2020, suggests that children can carry at least as much of the SARS-CoV2- coronavirus in their noses and throats as adults do, even if they have only mild or moderate symptoms. This study prompted fears that students may spread the virus when attending class this fall.However, a large study from South Korea published by the U.S. CDC for an October 2020 report, offers an answer: Children younger than 10 years old transmit much less of this virus than adults do. But the risk of transmission is not zero.These researchers found the highest COVID-19 infection rate (18.6%) for household contacts of school-aged children... and the lowest (5.3%) for household contacts of children 0–9 years."},
{"date_time": "Aug 11, 2020 • 11:25 am CDT", "title": "MIT Professor Calculated Very, Very Low Coronavirus Risk While Flying ", "content": "If you decide to fly, the odds that you will pick up the coronavirus that causes COVID-19 disease are very low, according to a non-peer-reviewed study published on August 2, 2020. Professor Arnold Barnett, at the Massachusetts Institute of Technology (MIT) approximated the probability that an airline traveler in coach will contract COVID-19 on a US domestic flight that is 2-hours long, are 1 in 4,300 for full flights, and 1 in 7,700, when middle seats are kept empty."},
{"date_time": "Aug 11, 2020 • 9:25 am CDT", "title": "California Testing Llama Nanobodies Against COVID-19", "content": "Researchers at the University of California, San Francisco (UCSF) say they have synthesized a molecule inspired by llama antibodies called nanobodies for potential COVID-19 disease treatment. The UCSF team hasn’t published research yet, so this science has not been peer-reviewed, reported BioSpace on August 11, 2020.These antibodies are approximately 25% of the size of human antibodies and from other animals, stated the U.S. NIH, on May 19, 2020. In addition, nanobodies are extremely stable, which means they can be turned into a dry powder and aerosolized, which would make them much easier to administer than the human monoclonal antibodies."},
{"date_time": "Aug 11, 2020 • 5:26 am CDT", "title": "President Putin's Daughter Tested COVID-19 Vaccine Candidate", "content": "The Russia Federation's President Vladimir Putin reported on August 11, 2020, the registration in Russia of the first vaccine against the coronavirus infection. \"As far as I know, this morning for the first time in the world a vaccine against the novel coronavirus infection was registered,\" the president said in a TASS article.President Putin also stated that 'one of his daughters had tested the Russian COVID-19 vaccine on herself and that she is feeling well.'Putin further noted that after the first vaccine shot, his daughter had a 38°C fever, and on the next day, a fever slightly higher than 37°C. 'And then, after the 2nd shot, she had a slight fever again, and then everything was fine. She is feeling well and has a high [antibody] count.'The Russian COVID-19 vaccine candidate Gam-COVID-Vac, is an adenoviral-based vaccine against the SARS-CoV-2 coronavirus, developed by the Gamaleya National Research Center for Epidemiology and Microbiology. Gam-COVID-Vac uses a weakened virus to deliver small parts of a pathogen and stimulate an immune response. And, is a vector vaccine based on adenovirus DNA, in which the SARS-CoV-2 coronavirus gene is integrated.Recently, the clinical trials of the Gam-COVID-Vac vaccine were declared 'over' by the Russian Healthcare Ministry."},
{"date_time": "Aug 11, 2020 • 4:56 am CDT", "title": "After 102 Days, New Zealand Confirms Locally-Transmitted Coronavirus Case", "content": "On August 11, 2020, New Zealand's Ministry of Health reported 1 new case of COVID-19 disease in a man in his 20s. He has been in managed isolation at the Grand Millennium and tested negative for COVID-19 around day 3 of his stay. He has tested positive around day 12 of his stay and has been transferred to the Auckland quarantine facility.It has been 102 days since the last case of COVID-19 was acquired-locally from an unknown source in New Zealand."},
{"date_time": "Aug 11, 2020 • 4:39 am CDT", "title": "Study: 5 Predictive Humoral Immune Response Markers in COVID-19", "content": "A study published online in Immunity on August 6, 2020, identifies 5 immune response markers which, collectively, were able to correctly classify both convalescent COVID-19 patients and those who did not survive the disease.The study was led by Ragon Group Leader Galit Alter, Ph.D., Professor of Medicine at Harvard Medical School, and Helen Chu, M.D., University of Washington School of Medicine. Dr. Alter’s team used her systems serology technique, an approach that relies on 60+ assays to create a detailed profile of the immune response, to compare the immune responses of those who had survived to those who had not.“By looking at the overall profile of the immune response, we can begin to truly understand how the immune system responds to COVID-19 and then use that knowledge to prevent the worst outcomes of this disease,” said Dr. Alter, in an August 7th press statement."},
{"date_time": "Aug 11, 2020 • 4:08 am CDT", "title": "Ethiopia Receives 250 Ventilators From the USA", "content": "The U.S. government announced the donation of 250 state-of-the-art ventilators and other critical care equipment to assist the Federal Democratic Republic of Ethiopia with its response to the COVID-19 disease pandemic on August 4, 2020.“This donation is a critical addition to the billions of dollars in resources and expertise that the American people have invested in Ethiopia’s health system in recent years,\" said U.S. Ambassador Michael Raynor at the handover event."},
{"date_time": "Aug 10, 2020 • 8:36 pm CDT", "title": "Could Dedicated COVID-19 Clinics Flatten the Curve", "content": "A study published by PLOS on August 6, 2020, concludes that opening clinics dedicated specifically to treating influenza can limit the number of people infected with the incoming flu virus from the Southern Hemisphere and reduce the peak prevalence rate.While this study focused on influenza, the findings are relevant for policymakers seeking to “flatten the curve\" of the ongoing COVID-19 pandemic. “COVID-19 is more infectious than H1N1 and has a higher mortality rate. So I would expect the positive effect of using 'dedicated clinics' to be larger for COVID-19.\" said these researchers."},
{"date_time": "Aug 10, 2020 • 7:45 pm CDT", "title": "College Co-Eds Conduct Coronavirus Tests in College Dorms", "content": "Elon University is requiring that all students, faculty, and staff returning to campus in the Fall 2000 semester get tested for the SARS-CoV-2 virus, encouraging students to use an online service that enables individuals to test themselves at home or dorm rooms with a non-invasive nasal swab test. When the sample is collected, it is shipped directly to the laboratory via FedEx, with the test results securely accessed online.On August 5, 2020, North Carolina based Elon clarified that this test is a polymerase chain reaction, or PCR test, which allows the coronavirus testing of individuals even without symptoms."},
{"date_time": "Aug 10, 2020 • 3:15 pm CDT", "title": "Wearing Neck Fleece or Bandanas Offer Reduced Virus Protection", "content": "A study published on August 7, 2020, demonstrated a simple optical method to evaluate the efficacy of masks to reduce the transmission of respiratory droplets during a regular conversation. In proof-of-principle studies, these researchers found neck fleece or bandanas, offer very little virus protection.A further area of interest is the comparison of mask performance between solid particles and droplets, motivated by the observed liquid droplet breakup in the neck fleece and mask saturation by droplets."},
{"date_time": "Aug 10, 2020 • 9:09 am CDT", "title": "Bikers To Be Blocked At Cheyenne River Reservation", "content": "Thousands of bikers attending the 10-day Sturgis Motorcycle Rally will not be allowed through Cheyenne River Sioux checkpoints, a spokesman for the Native American group told The Guardian on August 9, 2020. The tribe’s checkpoint rules say 'non-residents driving non-commercial out-of-state vehicles are never allowed through the reservation.But they say non-residents in non-commercial South Dakota vehicles are allowed through .... as long as they are not coming from a SARS-CoV-2 virus 'hot-spot'.As of August 7th, residents were informed they may travel at their own risk and are recommended to quarantine for 10-days upon returning to the Reservation from a hot-spot. Non-residents traveling for non-essential reasons coming from a hot-spot ... will be turned around.At the end of the day on August 9, 2020, there were 15 active cases of COVID-19 disease on the Cheyenne River Reservation."},
{"date_time": "Aug 10, 2020 • 8:39 am CDT", "title": "Oral COVID-19 Vaccine Application Filed With the U.S. FDA", "content": "Vaxart announced on August 10, 2020, that its oral COVID-19 vaccine Investigational New Drug application has been filed with the U.S. FDA. Andrei Floroiu, chief executive officer of Vaxart, said in a press statement: “We expect our upcoming Phase I study to generate data that will further differentiate our oral vaccine from injectable vaccines by substantiating the importance of activating both systemic and mucosal immunity in protecting against COVID-19 disease."},
{"date_time": "Aug 10, 2020 • 7:15 am CDT", "title": "Paris Announces 135 Euro Fines For Mask-Less Adults ", "content": "The wearing of a face mask in Paris transitioned from being fashionable to compulsory for those over 11 years of age on all public transport on August 10, 2020. And anyone failing to comply with this new mandate is subject to a fine of 135 euros. The new policy is in response to coronavirus infections in France surpassing those reported in May 2020.This new rule applies to densely crowded city zones such as tourist spots said the Paris mayor’s office in a statement. See this map of Paris for details.According to ParisInfo.com, most restaurants, cafes, night clubs, and sports facilities remain closed for an indefinite period. Even the French Riveria's Saint-Tropez resort is requiring masks to be worn outdoors, reported EuroNews."},
{"date_time": "Aug 10, 2020 • 6:40 am CDT", "title": "Dr. Francis Collins Shares His Vaccine-Hesitancy Concerns", "content": "Amid the coronavirus pandemic, the 16th leader of the National Institutes of Health, Francis S. Collins, M.D., Ph.D., finds hope in his evangelical beliefs and the altruism of medical researchers. Dr. Collins spoke to the Wall Street Journal on August 7, 2020, about his concerns over vaccine hesitancy and health disparities spotlighted by the COVID-19 disease pandemic."},
{"date_time": "Aug 10, 2020 • 6:30 am CDT", "title": "NIH Study:  Monoclonal Antibodies May Reduce Coronavirus Spreading in the Body", "content": "Eli Lilly, in collaboration with the U.S. National Institutes of Health, announced on August 5, 2020, they're testing a lab-engineered treatment called 'monoclonal antibodies' to reduce the new coronavirus from spreading in the body. This is a Phase 3 clinical trial studying LY-CoV555.\"Monoclonal antibodies stick right to the part of this spike protein that represents the part that binds to the human cell and lets the virus get inside. So you cover that up and the virus has nowhere to go,\" said the NIH's 16th director, Dr. Francis S. Collins.'In contrast to the convalescent plasma taken from survivors' blood, monoclonal antibodies can be manufactured in large amounts in a lab.'"},
{"date_time": "Aug 10, 2020 • 6:16 am CDT", "title": "Canada's Coronavirus-Positive Rate Drops to 1%", "content": "Dr. Theresa Tam, Canada's Chief Public Health Officer, issued the following statement on August 9, 2020: 'Over the past week, an average of 48,360 people were tested daily, with 1% testing positive for SARS-CoV-2, the coronavirus causing COVID-19 disease in people."},
{"date_time": "Aug 10, 2020 • 12:42 am CDT", "title": "How Long is the Coronavirus Infection Incubation Period?", "content": "While the common wisdom among health authorities is that the average incubation period is about 5-days, rising to a maximum of about 2-weeks, researchers from the Chinese CDC, the U.S. NIAID, and Peking University, say the mean value could be higher, reported the SCMP on August 9, 2020. The incubation period of an infectious disease is the time elapsed between virus infection and the appearance of symptoms.This study found the mean incubation time was 8.29 days, while the median value was 7.76 days. Compared with previous research, the incubation period estimated in our study is significantly longer, stated these researchers.This data may influence the duration of mandatory quarantine time frames."},
{"date_time": "Aug 10, 2020 • 12:21 am CDT", "title": "United Arab Emirates Successfully Enrolled 5,000 Clinical Trial Participants", "content": "A leading Phase III clinical trial of the New Crown COVID-19 inactivated vaccine being held in the United Arab Emirates has reached a major milestone with over 5,000 volunteers who have received their 1st vaccination, as of August 6, 2020.This large study follows previous trials conducted by Sinopharm in China, which is reported to have resulted in 100% of the volunteers generating antibodies to the SARS-CoV-2 coronavirus, after 2-doses in 28 days.In the USA, there are numerous vaccine clinical studies seeking participates, such as this NIH study."},
{"date_time": "Aug 9, 2020 • 7:05 pm CDT", "title": "Georgia High School to 'Zoom' Again ", "content": "A letter obtained by NBC News on August 9, 2020, reveils Georgia's Paulding County School District Superintendent Brian Otott informed the parents of North Paulding High School's 2,000 students, they will use a “digital learning” model while the school undergoes deep cleaning after 9 students tested positive for the SARS-CoV-2 coronavirus.The letter also reiterates that school district guidelines require any students or staff who are confirmed with COVID-19, along with any who were in close contact with them, must be quarantined for at least 14-days.In addition to the 9 known cases - 3 staff members and 6 additional students - are pending virus test results."},
{"date_time": "Aug 9, 2020 • 2:22 pm CDT", "title": "Coronavirus Antibodies Found in NYC's Hospital Staff", "content": "As the COVID-19 pandemic struck New York City (NYC), it became the USA's epicenter and healthcare personnel (HCP) working in NYC had a high exposure risk to the SARS-CoV-2 virus. One leading health system, Northwell, has treated about 55,000 virus patients. The good news is a new study published in JAMA on August 6, 2020, found a 13.7% prevalence of SARS-CoV-2 antibodies in the Northwell / HCP cohort.A previous study in the Mount Sinai Health System found 36% of HCWs had IgG antibodies to SARS-CoV-2, reflecting the high exposure of inpatient and ambulatory frontline staff.'While we continue to recommend standard protective precautions for everyone, HCWs with SARS-CoV-2 IgG may become our safest frontline providers as we learn if IgG antibodies confer immunity to protect against reinfection.Knowing IgG antibody status may ease concerns regarding personal risk as this pandemic continues,' commented these researchers on June 3, 2020."},
{"date_time": "Aug 9, 2020 • 1:19 pm CDT", "title": "How Does Our Immune System React to this Coronavirus?", "content": "The human immune system’s response to COVID-19 disease is one of the biggest questions of the 2020 pandemic. Understanding it is key to bringing an end to the global spread of the SARS-CoV-2 virus. The problem is that the human immune system is wildly complicated, and this new betacoronavirus seems to interact with it in some unusual ways, stated an insightful article published in The Atlantic on August 5, 2020."},
{"date_time": "Aug 9, 2020 • 12:57 pm CDT", "title": "India Picks Speed Over Coronavirus Testing Accuracy", "content": "India's Prime Minister Narendra Modi recently committed to increase SARS-CoV-2 testing to 1-million per day to tackle an ongoing COVID-19 disease outbreak. Beginning August 1st, about 500,000 tests were being delivered each day across India, according to the international comparison site, Our World in Data.To meet PM Modi's goal, the BBC reported on August 8, 2020, Indian authorities have been switching over to a quicker method called a 'rapid antigen test', which can give a result in about 20 minutes. But, these tests are less reliable, with an accuracy rate in some cases as low as 50%.Dr. Anupam Singh, a public health expert in India, says 'there are some advantages to the rapid tests: \"It allows a faster detection process and means you can quickly detect highly infectious individuals with a high viral load who might be so-called super-spreaders.'But, he also has concerns about this strategy, which can potentially miss many infections."},
{"date_time": "Aug 9, 2020 • 7:53 am CDT", "title": "Study: SARS-CoV-2 Viral Load Can Predict COVID-19 Disease Mortality", "content": "A study published in The Lancet on August 6, 2020, shows an independent relationship between high viral load of the SARS-CoV-2 coronavirus and mortality. These researchers say 'transforming qualitative testing into a quantitative measurement of a viral load will assist clinicians in risk-stratifying patients and choosing among available therapies and trials.'Furthermore, 'viral load might also affect quarantine - isolation tactics on the basis of infectivity risk.'"},
{"date_time": "Aug 9, 2020 • 7:39 am CDT", "title": "Restaurants Should Eliminate Virus-Spreading Towels", "content": "As restaurants reopen during the coronavirus pandemic, they may be missing one virus-spreading tool to eliminate. Many restaurant workers often use sponges and towels to clean food contact surfaces, but these types of absorbent materials were found to harbor potentially pathogenic organisms for more than 2-weeks, researchers said on August 6, 2020.“The hypothesis of our study was that cleaning tools may become contaminated with bacterial pathogens and cross-contaminate other surfaces,” Sujata A. Sirsat, Ph.D., an assistant professor at the Conrad N. Hilton College of Hotel and Restaurant Management at the University of Houston, located in Texas, told Healio.These Houston researchers found that E. coli, Salmonella, and S. aureus survived for up to 16 days on the sponges and up to 13 days on microfiber towels that were washed with sterile water."},
{"date_time": "Aug 9, 2020 • 6:40 am CDT", "title": "Serena Confronts NYC's Coronavirus and the 'Court'", "content": "After the coronavirus pandemic paused the women's tennis tour during March 2020, Serena Williams is returning to the competition in Lexington, Kentucky on August 10, 2020. However, Serena is really revving up for the U.S. Open, which is scheduled to start in combative New York City (NYC).With several women tennis players announcing they will skip the U.S. Open out of concerns over NYC's mandatory 2-week quarantine, and catching the SARS-CoV-2 coronavirus while visiting NYC, the USA's epicenter for the COVID-19 pandemic with 23,575 related fatalities, Serena's attendance is an emotional game-changer.At 38 years of age, and after winning 24 major tournament titles, Serena has her eyes focused on equalling the all-time tennis champion, Margaret Court, who holds 24 Grand Slam singles titles and 21 in mixed doubles, which are records for both genders.With the clocking ticking away, and as the new generation of tennis players rise, winning the U.S. Open on September 13, 2020, would be a tremendous milestone.But, perhaps Serena's finest achievement in life is her daughter Olympia, who has a keen interest in another sport. With a hearty laugh, Serena commented to SI on July 25th: \"Our daughter loves soccer - I hate to say it! Every time she starts kicking a ball, I get this jealous look in my eyes and I give her a tennis racquet.\""},
{"date_time": "Aug 9, 2020 • 5:54 am CDT", "title": "COVID-19 Vaccine Development Race: Challenges and Opportunities", "content": "In the race to produce safe and effective vaccines against the SARS betacoronavirus disease that is causing COVID-19 disease, pharmaceutical formulation science is playing a critical role throughout the development phases, said researchers in a new study published on August 5, 2020.This study offers a review of the vaccine candidates currently being tested in clinical trials and provided in-depth insight into the various types of vaccines, their compositions, advantages, and potential limitations."},
{"date_time": "Aug 9, 2020 • 5:45 am CDT", "title": "Yale's Experimental Test Empowering the NBA's Coronavirus Bubble", "content": "To determine if the innovative and inexpensive SalivaDirect test can accurately detect asymptomatic cases, the Yale School of Public Health team partnered with the National Basketball Association (NBA) as they hope to finish their disrupted season while ensuring the health of players and staff. This partnership is enabling the Surveillance with Improved Screening and Health (SWISH) study by testing samples collected from NBA players and staff using a standard nasal/oral test for SARS-CoV-2 and SalivaDirect.On August 4, 2020, the Yale researchers published the SWISH study's initial results, which found 'when comparing paired nasopharyngeal swabs and saliva specimens using the authorized ThermoFisher Scientific TaqPath COVID-19 combo kit and our SalivaDirect protocol, we found high-agreement in testing outcomes (>94%).'To meet an ever-expanding coronavirus testing need, the U.S. FDA has authorized 207 coronavirus diagnostic tests, which include 168 molecular tests, 37 antibody tests, and 2 antigen tests, as of August 7, 2020. Several of these tests can be ordered online at UltaLabs."},
{"date_time": "Aug 8, 2020 • 7:05 pm CDT", "title": "Charles Barkley Says 'Coronavirus Time-Out Is Good for Golden State'", "content": "Charles Barkley said on August 7, 2020, he thinks Golden State will have a leg up on its competitors in 2020-21, mostly because the Warriors aren't participating in the restarted NBA season, reported NBCSports. And most importantly, the Warriors star players have avoided the NBA's SARS-CoV-2 bubble in Orland, and no Golden State players have been diagnosed with COVID-19 disease.\"I think they're gonna have a huge advantage next season because they're gonna get rest and get Klay (Thompson) and Steph (Curry) back,\" Barkley said."},
{"date_time": "Aug 8, 2020 • 6:25 pm CDT", "title": "Over 200 Coronavirus Tests Now Authorized", "content": "As of August 7, 2020, the U.S. FDA had authorized 207 coronavirus diagnostic tests, which include 168 molecular tests, 37 antibody tests, and 2 antigen tests.COVID-19 Antibody (IgG), Immunoassay tests are sponsored by UltaLabs."},
{"date_time": "Aug 8, 2020 • 10:28 am CDT", "title": "Fatalities Continue to Decline in the USA", "content": "As of August 5, 2020, the U.S. CDC reported 235,992 fatalities involving 'COVID-19, Pneumonia, and Influenza', which have been declining most weeks since April 18, 2020.This data indicates a .1% fatality rate, based on about 237 million residents in the USA."},
{"date_time": "Aug 8, 2020 • 9:47 am CDT", "title": "Should Coronavirus Vaccines Launch Human Challenge Trials?", "content": "About 32,665 people have already volunteered to participate in 'human challenge clinical trials' for COVID-19 vaccine candidates. This process involves intentionally exposing people to SARS-CoV-2 coronavirus in an attempt to accelerate vaccine development. This process has been previously used for influenza, malaria, typhoid, dengue fever, and cholera vaccine development.On July 15, 2020, a new company, 1Day Sooner, published an open-letter addressed to Dr. Francis Collins, with the National Institutes of Health, which highlighted this innovative approach.Currently, no coronavirus vaccine trials are using this process."},
{"date_time": "Aug 8, 2020 • 8:59 am CDT", "title": "California's Gov. Newsom Ordered Full Investigation Into 250,000 Missing Health Records", "content": "California Health and Human Services Secretary Dr. Mark Ghaly announced on August 7, 2020, 'there are over 250,000 unprocessed health records in California, and many of them contain COVID-19 test results.'Californian Health Department believes the COVID-19 trends reported by Governor Gavin Newsom over the past few weeks ... remain consistent. Newsom has ordered a full investigation of the issue, Dr. Ghaly stated on Youtube."},
{"date_time": "Aug 8, 2020 • 8:46 am CDT", "title": "Sweden's Anders Tegnell Says 'Open Schools'", "content": "Over the past 6-weeks, Sweden's health officials are seeing if its light-touch approach to defeating the COVID-19 pandemic is working. Furthermore, Sweden's chief epidemiologist, Anders Tegnell, told Fortune on August 5, 2020, 'school kids are low-risk virus vectors who ought to be in classrooms, not at home distance-learning.“Keeping schools open is quite possible to do without having any negative effects.\""},
{"date_time": "Aug 8, 2020 • 7:40 am CDT", "title": "Travel Recommendations by Country", "content": "On August 7, 2020, the U.S. CDC published a color-coded ' map ' that highlights which country travelers should avoid during the COVID-19 disease pandemic."},
{"date_time": "Aug 7, 2020 • 12:32 pm CDT", "title": "4th US Military Fatality Report During COVID-19 Pandemic", "content": "A 4th US service member fatality related to COVID-19 disease was reported by the Department of Defense, as of August 7, 2020. This new fatality is the first reported since May. The other 2 military deaths were a National Guard member from Pennsylvania and a sailor who was aboard the USS Theodore Roosevelt reported Stripes.Recently, the U.S. DoD announced an agreement with the Janssen Pharmaceutical Companies of Johnson & Johnson, to demonstrate large-scale manufacturing and delivery of the company’s COVID-19 vaccine candidate, Ad26.COV2-S. Under the terms of the agreement, the federal government will own the resulting 100 million doses of vaccine."},
{"date_time": "Aug 7, 2020 • 9:33 am CDT", "title": "DeWine Celebrates 2nd Test Result", "content": "Late on August 6, 2020, Ohio governor Mike DeWine announced on Twitter that his initial coronavirus test result, which was positive, was been superseded by a 2nd test, which produced a negative result. Which means, the governor is not infected with the SARS-CoV-2 coronavirus.As of August 6th, the national average for positive tests in the USA during 2020 is 9%, reports the CDC.However, a recent Washington Post article concluded 'The faster test gives a result within 24 hours. It had a very low false-positive rate, but a 20% false-negative rate, meaning that if the result was positive, a person almost certainly had COVID-19. But if the result came back negative, a person still had a 20% chance of having the disease.'Some would say that antigen tests just aren’t accurate enough. But the alternative is people not being tested at all. Catching 80% of asymptomatic cases is a lot better than catching zero,' concluded the Washington Post."},
{"date_time": "Aug 7, 2020 • 5:38 am CDT", "title": "England's 2nd Coronavirus Wave May Arrive in December 2020", "content": "England’s contact-tracing system should immediately improve to avoid a 2nd COVID-19 disease wave when schools reopen in September 2020, concluded a study published in The Lancet on August 3, 2020.Assuming 68% of contacts could be traced, we estimate that 75% of individuals with symptomatic infection would need to be tested and positive cases isolated if schools return full-time in September, or 65% if a part-time rota system were used. If only 40% of contacts could be traced, these figures would increase to 87% and 75%, respectively.However, without these levels of testing and contact tracing, reopening of schools together with the gradual relaxing of the lockdown measures are likely to induce a second wave that would peak in December 2020."},
{"date_time": "Aug 7, 2020 • 5:17 am CDT", "title": "COVID-19 Found in Hotel Rooms", "content": "A new study posted in a September 2020 early release by the U.S. CDC found that people infected with the coronavirus shed it on pillowcases, duvet covers, sheets, and light switches, as well as on the bathroom door and faucet handles. The researchers detected SARS-CoV-2 RNA on 8 (36%) of 22 surfaces.However, no clear evidence of infection caused by contact with the contaminated environment was found.The detection of SARS-CoV-2 RNA in these surfaces highlights the importance of proper handling procedures when changing or laundering used linens of SARS-CoV-2 patients. Thus, to minimize the possibility of dispersing virus through the air, we recommend that used linens not be shaken upon removal and that laundered items be thoroughly cleaned and dried to prevent additional spread, suggested these researchers."},
{"date_time": "Aug 6, 2020 • 7:22 pm CDT", "title": "Pediatrics Study: Infants with SARS-CoV-2 Infection Generally Have Mild Presentations", "content": "A new study published by the American Academy of Pediatrics on August 1, 2020, observed 7 febrile infants aged ≤60 days with confirmed SARS-CoV-2 infection, none had severe outcomes. Our result, although based on small numbers, suggests that infants with SARS-CoV-2 generally have mild presentations, similar to typical viral illness with other coronaviruses.Furthermore, no infant had severe outcomes, including the need for mechanical ventilation or ICU level of care. Two infants had concurrent urinary tract infections, which were treated with antibiotics."},
{"date_time": "Aug 6, 2020 • 3:49 pm CDT", "title": "US Governor Tested Positive For COVID-19 Disease", "content": "On August 6, 2020, Ohio Governor Mike DeWine announced on Twitter he has tested positive for COVID-19 disease and is not displaying symptoms, at this time"},
{"date_time": "Aug 6, 2020 • 3:38 pm CDT", "title": "Traveling to Europe... Check This Website First", "content": "Information for Travelers Going to Europe:If you are planning to visit or travel through Europe, the US Department of State is urging Americans to check this website of the relevant U.S. embassies or consulates for information on restrictions, foreign quarantine policies, and urgent health information provided by relevant authorities.The State Department said on August 6, 2020, 'some European countries currently prohibit entry by tourists and other non-essential travelers. We recommend that you visit the websites of those countries' embassies in the United States for additional information including entry/exit restrictions and permissible categories of travel.'And when returning to the USA from the United Kingdom, Ireland, and the European Schengen area, U.S. citizens and legal permanent residents are required to travel through select U.S. airports with enhanced screening procedures. FAQs on travel are available on this website."},
{"date_time": "Aug 6, 2020 • 2:31 pm CDT", "title": "China Coronavirus Vaccine Producer May Produce 200 Million Doses in 2021", "content": "Shenzhen Kangtai Biological Products announced on August 6, 2020, it may produce up to 200 million doses of AstraZeneca coronavirus prevention vaccine candidate AZD1222, in mainland China, by the end of 2021, reported Reuters."},
{"date_time": "Aug 6, 2020 • 9:33 am CDT", "title": "'Buy American\" Rules May Impact COVID-19 Vaccine Purchases", "content": "The US President is expected to sign an executive order requiring the federal government to purchase certain drugs from U.S. manufacturers, rather than from overseas companies, reported USAToday on August 6, 2020.Peter Navarro, director of the White House Office of Trade and Manufacturing Policy said the pending executive order \"establishes 'Buy American' rules for our government agencies, strips away regulatory barriers to domestic pharmaceutical manufacturing.\"This order may impact coronavirus vaccine purchase decisions in the USA."},
{"date_time": "Aug 6, 2020 • 9:19 am CDT", "title": "Hot-Air Hand Dryers Spread Infectious Bacteria", "content": "A previous study reported in 2018 found evidence that bathroom hand dryers can disperse bacteria from hands or deposit bacteria on surfaces, including recently washed hands, and, within buildings, bacteria may travel between rooms. While COVID-19 disease is spread by a coronavirus, this risk hand dryer risk is applicable today.Peter Setlow, a biochemist at the University of Connecticut, told Tom Bartlett with Wired, 'Sorry, hand-dryer industry, my personal opinion is that they shouldn’t be used.'"},
{"date_time": "Aug 6, 2020 • 8:54 am CDT", "title": "FDA Approved 166 Molecular Tests For Coronavirus Detection", "content": "As of August 5, 2020, the U.S. FDA has authorized 203 coronavirus diagnostic tests under EUAs, which include 166 molecular tests, 35 antibody tests, and 2 antigen tests."},
{"date_time": "Aug 6, 2020 • 5:38 am CDT", "title": "Is Your Face-Mask Working?", "content": "Which cloth face masks work best in reducing aerosol transmission of the coronavirus when speaking, coughing, and sneezing? According to a limited case study published by MedpageToday on August 5, 2020, compared with wearing no mask at all ... the efficacy was highest for a 3-layer surgical mask, followed by a 2-layer cloth mask, and a 1-layer cloth mask."},
{"date_time": "Aug 6, 2020 • 5:22 am CDT", "title": "Insureance Company Returns $101 Million", "content": "On August 5, 2020, Blue Cross Blue Shield of Massachusetts announced that it will return $101 million in premium refunds and anticipated rebates to its customers and members as a result of ... lower than anticipated health care costs ... during the COVID-19 disease pandemic.The new refunds are in addition to the $116 million Blue Cross previously invested to support its members, customers, clinical partners, and the community throughout the pandemic, bringing the company's COVID-related financial commitments to more than $217 million."},
{"date_time": "Aug 5, 2020 • 7:44 pm CDT", "title": "Police Checkpoints Launch to Enforce NYC Coronavirus Quarantine Orders", "content": "New York City (NYC) Mayor de Blasio announced on August 5, 2020, the Sheriff’s Office, in coordination with other law enforcement agencies, will operate traveler registration checkpoints at major bridge and tunnel crossings beginning August 6th.Travelers to NYC who have visited 35 designated states or territories with high COVID-19 disease transmission rates are required to complete the Department of Health traveler form. Individuals who refuse to fill out the travel form are subject to a $2,000 fine.Furthermore, visitors who fail to quarantine for a period of 14-days upon entering NYC are subject to a $10,000 fine."},
{"date_time": "Aug 5, 2020 • 5:58 pm CDT", "title": "Can Melbourne Learn From New South Wales Schools?", "content": "Schools in the Australian state of New South Wales successfully mitigated their COVID-19 disease risks during the initial 'wave' of coronavirus infections, reported a new study published in The Lancet on August 3, 2020. These researchers found children and teachers did not contribute significantly to SARS-CoV-2 transmission via attendance in educational settings.This lessons-learned by be needed in the southern city of Melbourne.Under the newly imposed \" stage 4\" restrictions, Melbourne's millions of residents are now under very strict 'lockdown measures, which includes access to school."},
{"date_time": "Aug 5, 2020 • 3:50 pm CDT", "title": "Cruise Ships Delayed Until Halloween", "content": "Royal Caribbean, Carnival, Disney, and other cruise lines announced they will not offer voyages out of US ports until at least October 31, 2020. The Cruise Lines International Association published this statement on August 5, 2020.Previously, the Norwegian shipping company Hurtigruten announced on August 3, 2020, it has halted all expedition cruises and conceded it failed to follow its own disease-prevention guidelines.And, the U.S. CDC continues to recommend that everyone avoid all non-essential international travel because of the COVID-19 disease pandemic."},
{"date_time": "Aug 5, 2020 • 11:52 am CDT", "title": "J&J Charges $10 Per Coronavirus Vaccine Dose", "content": "Johnson & Johnson and Janssen announced on August 5, 2020, they would produce 100 million doses of the Ad26.COV2-S vaccine candidate for the U.S. government, for about $1 billion dollars. This pricing indicates an average cost per vaccine dose of $10.However, these J&J vaccines would be offered to US residents for free, subject to vaccine administration fees."},
{"date_time": "Aug 5, 2020 • 10:13 am CDT", "title": "Texas Warns Doctors Regarding 'COVID-19 Cures'", "content": "The Texas Medical Board said on July 31, 2020, 'In the past week there was a widely published claim of a “cure” for COVID-19 disease. As we are all aware the medical community is still learning, researching, and gaining an understanding of the virus. While there are therapies being used to treat COVID-19, there is no definitive cure at this time.'The Texas Board does not issue endorsements of the use of any specific drugs or treatments for COVID-19, but any treatment decision must be made with full, proper, and accurate disclosure by a physician.Physicians should refer to laws and Board rules, including those for complementary and alternative medicine (such as Plaquenil / Hydroxychloroquine) when considering potential treatments and medical decisions regarding COVID-19."},
{"date_time": "Aug 5, 2020 • 9:37 am CDT", "title": "Canada Selects Another Coronavirus Vaccine Partner", "content": "Pfizer Canada and BioNTech SE announced an agreement with the Government of Canada on August 5, 2020, to supply the BNT162 mRNA-based vaccine candidate against SARS-CoV2, subject to clinical success and Health Canada approval.Assuming clinical success, these Companies may seek regulatory review for BNT162b2 as early as October 2020 and, if regulatory authorization or approval is obtained, plan to supply up to 100 million doses worldwide by the end of 2020 and approximately 1.3 billion doses by the end of 2021."},
{"date_time": "Aug 5, 2020 • 7:56 am CDT", "title": "Coronavirus Test Results in Just 30 Minutes ... From Saliva Sample", "content": "Sorrento Therapeutics announced on July 29, 2020, it entered into a licensing agreement with Columbia University for the rights to a rapid, one-step diagnostic test that detects SARS-CoV-2 coronavirus... in as little as 30 minutes ... from a sample of saliva.Unlike other commercially available test diagnostic products, the COVI-TRACE holds all of the testing materials in a single tube and requires no specialized laboratory equipment, making it easily deployable for point of care, on-site, or potentially at-home testing.A recent study shows the sensitivity and specificity of COVI-TRACE is 97% and 100%, respectively."},
{"date_time": "Aug 5, 2020 • 5:15 am CDT", "title": "Scotland's Vaccine Facility Ready For Inspection", "content": "A vaccine manufacturing facility in Livingston, West Lothian, Scotland, is leading the UK's efforts to produce a coronavirus vaccine - VLA2001 - thanks to a multi-million-pound investment by the UK government to secure early access to 60 million doses of Valneva’s promising vaccine candidate.If Valneva’s VLA2001 vaccine is proven to be safe and effective in clinical trials, the expanded Livingston facility could potentially supply up to 100 million vaccine doses to the UK and internationally, announced the UK on August 5, 2020."},
{"date_time": "Aug 5, 2020 • 4:27 am CDT", "title": "COVID-19 Vaccine Candidates:  As of August 5, 2020", "content": "The U.S. FDA has not approved any preventive vaccines for use against either MERS or SARS-CoV-2 coronaviruses. However, there over 300 clinical studies seeking participants to evaluate experimental coronavirus vaccines.Update vaccine candidate listing as of August 5, 2020."},
{"date_time": "Aug 5, 2020 • 3:55 am CDT", "title": "COVID-19 Disrupts Tuberculosis Vaccinations", "content": "Across 106 countries, a survey found disruptions to tuberculosis (TB) service delivery as a result of the COVID-19 pandemic: 78% of TB programs reported disruption to BCG vaccination services (17% with high or very high disruptions).The WHO’s latest Global TB Report says that 1.5 million people died from TB in 2018."},
{"date_time": "Aug 4, 2020 • 3:23 pm CDT", "title": "COVID-19 Pandemic Lockdowns Caused Cancer Diagnosis Delays", "content": "A new letter published in JAMA on August 4, 2020, indicates a significant decline in newly identified patients with 6 common types of cancer... since COVID-19 restrictions were implemented.These delays mirror other countries such as the Netherlands, which has seen as much as a 40% decline in cancer incidence, and the UK has experienced a 75% decline in referrals for suspected cancer. These delays in diagnosis will likely lead to presentation at more advanced stages and poorer clinical outcomes said these researchers."},
{"date_time": "Aug 4, 2020 • 3:10 pm CDT", "title": "Columbia Students Take COVID-19 Pledge ... Or Leave Campus", "content": "Many new restrictions and regulations are outlined in Columbia University's Community Health Compact to ensure the well-being of all students, faculty, and staff as they return to campus. But before arriving on campus, all students must sign a 'compact to demonstrate their commitment to upholding its regulations.'Furthermore, those who do not adhere to the new policies ... will be asked to leave campus, according to the University's compact."},
{"date_time": "Aug 4, 2020 • 2:42 pm CDT", "title": "What Causes the Loss of Smell When Infected With COVID-19 Disease?", "content": "A study published in Science Advances on July 24, 2020, found that olfactory sensory neurons do not express the gene that encodes the ACE2 receptor protein, which SARS-CoV-2 uses to enter human cells. Instead, ACE2 is expressed in cells that provide metabolic and structural support to olfactory sensory neurons, as well as certain populations of stem cells and blood vessel cells.The findings suggest that infection of non-neuronal cell types may be responsible for anosmia, the loss of smell, in COVID-19 disease patients.In a letter published in JAMA on July 16, 2020, the authors do not claim that the opacification of the olfactory clefts is the cause for the patient’s anosmia; rather it is an observation made of a patient who has COVID-19 disease."},
{"date_time": "Aug 4, 2020 • 12:06 pm CDT", "title": "Antibody Treatment Study Launches For Hospitalized COVID-19 Patients", "content": "A new antibody treatment study in the US National Institutes of Health’s Accelerating COVID-19 Therapeutic Interventions and Vaccines (ACTIV) program launched on August 4, 2020.Patients admitted with COVID-19 disease at select hospitals in the USA may now volunteer to enroll in a clinical trial to test the safety and efficacy of a potential new treatment for the disease.This Phase 3 randomized, controlled trial is known as ACTIV-3, and as a “master protocol,” it is designed to expand to test multiple different kinds of monoclonal antibody treatments. It also can enroll additional volunteers in the middle of the trial, if a specific investigational treatment shows promise, says the NIH."},
{"date_time": "Aug 4, 2020 • 11:38 am CDT", "title": "Coronavirus Pandemic Disrupts HPV Vaccinations", "content": "In an effort to boost public health and help keep vaccinations on track in the midst of the coronavirus pandemic, the American Cancer Society announced on August 3, 2020, that it is renewing Mission: HPV Cancer Free, a campaign to eliminate HPV-related cancers, starting with cervical cancer.The ongoing COVID-19 disease pandemic has created unprecedented challenges. One outcome from the past few months is dramatic declines in vaccination. A recent study by the Commonwealth Fund showed a 71% drop in healthcare visits for 7-17-year-olds.These are the ages when HPV vaccines are administered."},
{"date_time": "Aug 4, 2020 • 9:18 am CDT", "title": "Over 11,000 Nursing Homes Begin Weekly COVID-19 Testing", "content": "On July 22, 2020, the US Centers for Medicare and Medicaid Services announced that it would begin 'requiring, rather than recommending, that all nursing homes in states with a 5% coronavirus positivity rate or greater, test all nursing home staff each week.” If implemented, 11,640 nursing homes would be required to conduct such weekly testing, which is listed here."},
{"date_time": "Aug 4, 2020 • 6:59 am CDT", "title": "Europe Scrambles to Stop Second COVID-19 Pandemic Lockdown", "content": "According to VOA video reporting on August 3, 2020, pandemic lockdown measures are being re-imposed in various European nations, which were among the hardest hit by the SARS-CoV-2 virus in March and April, prompting strict measures to control the spread of the disease. Scientists are warning that hard choices lie ahead for many countries."},
{"date_time": "Aug 3, 2020 • 9:05 pm CDT", "title": "Taiwan's Brain Navi Develops Robot That Performs Nasal Swab Tests", "content": "Brain Navi Biotechnology Co. announced on July 31, 2020, the developed a new robot to perform nasal swab tests autonomously to prevent cross infections. With the Brain Navi Nasal Swab Robot's assistance, users can test safely around the clock, so as to spare healthcare workers from the high-risk environment when sample collecting."},
{"date_time": "Aug 3, 2020 • 7:00 pm CDT", "title": "198 Coronavirus Tests Authorized in the USA", "content": "The U.S. FDA has authorized 198 coronavirus diagnostic tests which include 161 molecular tests, 35 antibody tests, and 2 antigen tests, as of August 3, 2020."},
{"date_time": "Aug 3, 2020 • 6:32 pm CDT", "title": "Melbourne Significantly Tightens Coronavirus Lockdown", "content": "The premier of Victoria, Daniel Andrews, announced on August 2, 2020, an overnight curfew would be implemented across Melbourne — Australia's 2nd largest city — from 8 p.m. to 5 a.m. after he declared a state of disaster in the entire state.Under the newly imposed \"stage 4\" restrictions, Melbourne 4.9 million residents will be allowed to shop and exercise only within 5 kilometers of their homes. And, just 1 person from each household will be allowed to shop at a time, and only once a day.Additionally, Andrews announced Stage 3 restrictions will be launched in Regional Victoria late on Wednesday, August 5, 2020."},
{"date_time": "Aug 3, 2020 • 2:00 pm CDT", "title": "Pregnant Women Excluded From These Coronavirus Vaccine Studies", "content": "The initial two COVID-19 vaccine candidates to enter large-scale U.S. trials will not be tested in pregnant women during 2020, researchers told Reuters on July 31, 2020. Traditionally, U.S. regulators require vaccine producers to conduct safety studies in pregnant animals ... before vaccine candidates are tested in pregnant women ... to ensure they don’t harm the fetus or lead to miscarriage.Doctors may want to see even more data for completely new vaccine technologies, such as those used by Moderna and Pfizer, compared with known technologies that have already been evaluated in pregnant women, said Reuters."},
{"date_time": "Aug 3, 2020 • 12:59 pm CDT", "title": "Oxford Study: Antibody Test Detects 11% Fewer Coronavirus Cases", "content": "A recent Oxford University study of more than 9,000 healthcare workers found significant numbers of people were getting 'negative' antibody test results, despite probably having had the SARS-CoV-2 coronavirus. The results suggest these were around 11% less sensitive than is currently believed, in part, because the tests were developed using samples from symptomatic, often hospitalized patients, reported the Telegraph on August 1, 2020.Of the people who tested positive for antibodies on one test, 47% reported a loss of their sense of taste or smell. But among those whose test results fell just below the threshold for a positive antibody test result, meaning that they would currently be classed as not having had the virus, 30% also reported a loss of sense of taste or smell.And, 387 people also tested just below the threshold in terms of antibodies for a positive test, but did not have symptoms. They may have been asymptomatic coronavirus patients, but the researchers could not say with confidence that they had the virus."},
{"date_time": "Aug 3, 2020 • 8:56 am CDT", "title": "Preventive Antibody Launches Phase 3 Study in Nursing Homes", "content": "Eli Lilly announced on August 3, 2020, the initiation of BLAZE-2, a Phase 3 trial studying LY-CoV555 for the prevention of SARS-CoV-2 infection in residents and staff at long-term care facilities in the USA. LY-CoV555 is a neutralizing antibody against SARS-CoV-2, the virus that causes COVID-19.LY-CoV555 is a potent, neutralizing IgG1 monoclonal antibody (mAb) directed against the spike protein of the SARS-CoV-2 betacoronavirus. It is designed to block viral attachment and entry into human cells, thus neutralizing the virus, potentially preventing and treating COVID-19 disease."},
{"date_time": "Aug 3, 2020 • 8:17 am CDT", "title": "Serious COVID-19 Patients Rapidly Recovered With New Treatment", "content": "On August 2, 2020, NeuroRx, Inc., and Relief Therapeutics Holdings announced hospitalized patients on ventilators and extracorporeal membrane oxygenation, with COVID-19 disease and severe medical comorbidities, recovered after 3-days of treatment with RLF-100, which is known as Aviptadi.Aviptadil is being developed as the first COVID therapeutic to ... block replication of the SARS-CoV-2 coronavirus in human lung cells and monocytes."},
{"date_time": "Aug 3, 2020 • 7:44 am CDT", "title": "Immunity Certificates Not Supported by Scientific Evidence", "content": "The World Health Organization (WHO) announced updated travel guidance on July 30, 2020, stating 'travel bans can't stay in place indefinitely.' However, a debate regarding the clinical relevance of immunity passports in the context of COVID-19 disease pandemic.The WHO's new guidance says the use of 'Immunity certificates are not supported by scientific evidence ... therefore they not recommended by the WHO.'"},
{"date_time": "Aug 3, 2020 • 4:01 am CDT", "title": "USA Orders 100 Million COVID-19 Vaccine Doses for $2.1 Billion", "content": "The U.S. government, Sanofi, and GSK announced late on July 31, 2020, funding of up to $2.1 billion for the development and delivery of 100 million doses of a SARS-CoV-2 recombinant protein-based vaccine."},
{"date_time": "Aug 2, 2020 • 2:12 pm CDT", "title": "Cruise Ship Spreads Coronavirus On-Board and On-Shore", "content": "Hurtigruten announced on August 2, 2020, that 36 of the crew and 3 of the passengers on the two voyages of its MS Roald Amundsen had tested positive for SARS-CoV-2 coronavirus. Furthermore, the current outbreak was discovered when the Hurtigruten ship had docked in Tromso, the largest town in northern Norway, on July 29, 2020.Of 158 staff on board the Roald Amundsen, four who had been isolated due to other symptoms subsequently tested positive for coronavirus and were admitted to hospital in Tromso. Further tests uncovered another 32 infections among employees, and the rest of the staff are now isolated on the ship.The fact that additional passengers are infected shows that all passengers on both voyages must be in quarantine and should be tested, says department director at the National Institute of Public Health Line Vold, who has notified 69 municipalities to follow up on just under 400 passengers"},
{"date_time": "Aug 2, 2020 • 12:34 pm CDT", "title": "BCG Vaccinations Could Have Flattened COVID-19's Curve", "content": "A study published by Sciences Advances on July 31, 2020, estimated that very few US residents would likely have died from COVID-19 disease if the USA had instituted various BCG vaccination programs ... several decades ago."},
{"date_time": "Aug 2, 2020 • 11:40 am CDT", "title": "Study:  Pre-Existing Immunity From Common Cold Coronaviruses", "content": "A study published in the journal Nature on July 7, 2020, concluded saying 'it is now established that SARS-CoV-2 coronavirus pre-existing immune reactivity ... exists to some degree in the general population. It is hypothesized, but not yet proven, that this might be due to immunity to common cold coronaviruses."},
{"date_time": "Aug 2, 2020 • 11:23 am CDT", "title": "Updated Coronavirus Considerations When Swimming at the Beach", "content": "The U.S. CDC published updated various considerations as some communities in the USA consider opening public beaches. On July 30, 2020, the CDC stated 'evidence suggests that COVID-19 cannot be spread to humans through most recreational water.'And on June 12, 2020, the US Department of Homeland Security Science and Technology (S&T) Directorate added a new calculator that estimates the natural decay of the SARS-CoV-2 virus in the air, such as when visiting a beach.S&T research also found the coronavirus was least stable in the presence of sunlight. S&T research has been featured in the Oxford Academic Journal of Infectious Diseases, with the most recent – Airborne SARS-CoV-2 is Rapidly Inactivated by Simulated Sunlight."},
{"date_time": "Aug 2, 2020 • 10:57 am CDT", "title": "FBI Issued Warning For Central Texas Coronavirus Tests", "content": "The FBI San Antonio office issued a notice on August 1, 2020, seeking to warn members of the public who were tested for COVID-19 at Living Health Holistic Healthcare in New Braunfels, Texas, in the last several weeks. Authorities have reason to suspect the COVID-19 tests administered at the facility should not have been used to ... diagnose or rule out ... an active SARS-CoV-2 infection.Individuals who were tested for COVID-19 disease at this facility are asked to contact the FBI by calling (210) 225-6741, prompt #1, or online at tips.fbi.gov."},
{"date_time": "Aug 2, 2020 • 8:07 am CDT", "title": "Russia's Initial Coronavirus Vaccine Completes Clinical Study", "content": "Russian Health Minister Mikhail Murashko told reporters on August 1, 2020, \"Clinical trials of the Gam-COVID-Vac coronavirus vaccine developed by the Gamaleya center are over, paperwork is underway for the vaccine’s registration,' reported TASS."},
{"date_time": "Aug 1, 2020 • 10:17 am CDT", "title": "194 Coronavirus Diagnostic Tests Authorized in the USA", "content": "As of July 31, 2020, the U.S. FDA had authorized 194 coronavirus diagnostic tests, which include 159 molecular tests, 33 antibody tests, and 2 antigen tests."},
{"date_time": "Aug 1, 2020 • 8:12 am CDT", "title": "Antibiotic Prescribing Increased in Spain During Coronavirus Pandemic", "content": "Spanish researchers reported in Infection Control & Hospital Epidemiology on July 30, 2020, there were 2 specific phases of antibiotic use during the coronavirus pandemic. The before-and-after cross-sectional study compared antibiotic prescribing data at the hospital from two periods: Jan 1 to Apr 30, 2019 (pre-COVID), and Jan 1 to Apr 30, 2020 (COVID).The analysis found antibiotic usage increased significantly during March and April 2020, compared with the pre-COVID period.\"Our data supports the WHO's recent change in its guidelines discouraging empirical antibiotics in COVID-19.\""},
{"date_time": "Aug 1, 2020 • 7:51 am CDT", "title": "Philadelphia's Coronavirus Infection Rate 4 Times Lower Than Estimates", "content": "As of June 29, 2020, there were 23,160 confirmed cases of COVID-19 disease in the city of Philadelphia, Pennsylvania, which has a population size of nearly 1.6 million people. A new study's results suggest an infection rate of approximately 1.4%, which is more than 4 times lower than the estimates based on a local research team's serological data."},
{"date_time": "Aug 1, 2020 • 7:36 am CDT", "title": "Self-Isolation Counseling Payments Now Authorized", "content": "The US Centers for Medicare and Medicaid Services and the CDC announced on July 30, 2020, that payment is now available to healthcare providers to counsel patients, at the time of coronavirus disease 2019 (COVID-19) testing, about the importance of .... self-isolation..... after they are tested and prior to the onset of disease symptoms."},
{"date_time": "Jul 31, 2020 • 3:27 pm CDT", "title": "Texas Improves COVID-19 Fatality Reporting", "content": "On July 27, 2020, the Texas Department of State Health Services announced it will now be reporting fatalities due to COVID-19 disease by identifying them through the cause of death listed on death certificates. A fatality is counted as due to COVID-19 when the medical certifier, usually a doctor with direct knowledge of the patient, determines COVID-19 disease directly caused the death.This new method does not include .... deaths of people who had COVID-19 ... but died of an unrelated cause.Based on this new counting methodology, the state of Texas had reported a total of 6,274 fatalities related to COVID-19 during 2020. This data indicates a fatality rate of .0002%, based on Texas's 29.9 million residents, as of July 30, 2020."},
{"date_time": "Jul 31, 2020 • 1:59 pm CDT", "title": "Did Sweden's Non-Lockdown Succeed?", "content": "Despite never implementing a country-wide lockdown, Sweden has managed to flatten its COVID-19 disease fatality curve, prompting its health leadership to declare an early victory. Sweden relied on individual responsibility ... instead of governmental coercion to achieve results.A study published on June 29, 2020, indicates that public immunity to COVID-19 disease in Sweden is probably significantly higher than antibody tests have suggested,” said Professor Hans-Gustaf Ljunggren, at the Center for Infectious Medicine, Karolinska Institutet.And, If flattening the fatality curve was the primary goal, Sweden was largely a success said Fee.org. As of July 31, 2020, Sweden had confirmed 5,733 COVID-19 related fatalities. But the rate has rapidly declined over the past month.Meanwhile, Anders Tegnell, Sweden’s top infectious disease expert, stated: “I’m looking forward to a more serious evaluation of our work, as there is no way of knowing how this ends.”"},
{"date_time": "Jul 31, 2020 • 1:17 pm CDT", "title": "An Inside Story of Britain’s COVID-19 Battle", "content": "For 3-months, over 1,800 doctors, nurses, and paramedics in London fought the most devastating pandemic for a century. This is what they told the Economist on July 26, 2020."}
]