[
{"date_time": "Aug 13, 2020 • 3:40 pm CDT", "title": "Oregonians Remain At Risk for Coronavirus", "content": "Data published by the U.S. CDC on August 14, 2020, suggest that a substantial number of COVID-19 cases in Oregon have gone undiagnosed --- was approximately 10 times the measured cumulative COVID-19 incidence obtained by nucleic acid testing --- and that a large portion of Oregon’s population remains susceptible to COVID-19 infection.These findings are similar to those reported in a recent survey in the neighboring state of Idaho."},
{"date_time": "Aug 13, 2020 • 2:18 pm CDT", "title": "Europe Trails the USA's Coronavirus Vaccine Purchases", "content": "The European Commission (EC) announced on August 13, 2020, that it has concluded exploratory talks with Johnson & Johnson (J&J) to purchase a potential vaccine against COVID-19 being produced by Janssen Pharmaceutical research teams. The EC said it anticipates that once the J&J Ad26.COV2-S preventive vaccine candidate has proven to be safe and effective, the EC would have a contractual framework in place for the initial purchase of 200 million doses on behalf of all Member States, and could further purchase up to an additional 200 million vaccine doses from J&J.These 400 million vaccine doses trail the U.S. government's aggregated purchase commitments which have reached about 800 million, as of August 12, 2020."},
{"date_time": "Aug 13, 2020 • 9:27 am CDT", "title": "Composer Andrew Lloyd Webber Tests Experimental Vaccine", "content": "Historic composer Andrew Lloyd Webber announced on Twitter on August 12, 2020, \"I am excited that tomorrow (Aug. 13th) I am going to be vaccinated for the Oxford COVID-19 vaccine trial,\" he wrote. \"I'll do anything to prove that theatres can re-open safely.\""},
{"date_time": "Aug 13, 2020 • 9:16 am CDT", "title": "South Korea Secures Access to SARS-CoV-2 Vaccine", "content": "The Republic of Korea’s Ministry of Health and Welfare announced it has signed a letter of intent with Novavax, Inc. and SK bioscience on August 13, 2020, to work toward broad and equitable access in South Korea to the coronavirus vaccine candidate NVX-CoV2373."},
{"date_time": "Aug 13, 2020 • 3:53 am CDT", "title": "Latin America Gains Access to COVID-19 Vaccine", "content": "Argentine President Alberto Fernandez announced on August 13, 2020, the countries of Argentina and Mexico will produce the AstraZeneca COVID-19 vaccine and supply it to most of Latin America, except for Brazil, reported Reuters.The agreement between AstraZeneca and the biotechnology company mAbxience of the INSUD Group includes a transfer of technology to initially produce 150 million doses of the vaccine, which is expected to be delivered in the first half of 2021.The AZD1222 vaccine candidate is made from a virus (ChAdOx1), which is a weakened version of a common cold virus that causes infections in chimpanzees, that has been genetically changed so that it is impossible for it to grow in humans. A preliminary report of the phase 1/2 study published on July 20, 2020, showed a single dose of AZD1222 resulted in a 4-fold increase in antibodies to the SARS-CoV-2 virus spike protein in 95% of participants one month after injection."},
{"date_time": "Aug 13, 2020 • 3:07 am CDT", "title": "210 Coronavirus Tests Now Authorized by the U.S. FDA", "content": "As of August 12, 2020, the U.S. FDA had authorized 210 coronavirus diagnostic tests, which include 173 molecular tests, 37 antibody tests, and 2 antigen tests. And, the FDA issued new Emergency Use Authorizations to LumiraDx UK Ltd., for its LumiraDx SARS-CoV-2 RNA STAR, and Biomeme, Inc., for its Biomeme SARS-CoV-2 Real-Time RT-PCR Test."},
{"date_time": "Aug 13, 2020 • 3:00 am CDT", "title": "Consumer Update: Slow the Spread of Coronavirus", "content": "The U.S. FDA published an online Consumer Update on August 12, 2020, with some simple steps to help slow the spread of the coronavirus disease and protect ourselves and our families. Furthermore, the CDC recommends wearing cloth masks or face coverings – not surgical masks or N95 respirators – when in public settings."},
{"date_time": "Aug 13, 2020 • 2:54 am CDT", "title": "U.S. FDA: There is no evidence coronavirus is transmitted through food", "content": "As of August 12, 2020, the U.S. FDA says the food supply is safe and there is no evidence the coronavirus is transmitted through food, food containers, or food packaging."},
{"date_time": "Aug 12, 2020 • 3:31 pm CDT", "title": "LabCorp Offers No-Cost Coronavirus Tests", "content": "To expand the number of blood plasma donations, LabCorp announced on August 11, 2020, details of a no-charge antibody testing program. For the next 3-months, LabCorp will perform the high-affinity coronavirus antibody test at no-charge to patients, insurance companies, or the government.And when patients are receiving other medically necessary blood tests as part of a medically necessary exam or treatment, this program enables providers to add the SARS-CoV-2 Antibodies Test to the same order, at no charge.The no-charge high-affinity antibody testing program will use the Roche Elecsys® Anti-SARS-CoV-2 and does not apply to other COVID-19 antibody tests, such as the IgG test. Patients will be able to access their results through the LabCorp Patient™ portal and through their doctor."},
{"date_time": "Aug 12, 2020 • 2:56 pm CDT", "title": "Kaiser's J-Shaped Correlational Identifies Obesity's Relationship With COVID-19 Fatalities", "content": "Kaiser Permanente in Southern California reported that there was a J-shaped association between BMI and the risk for COVID-19 disease death from February 13, 2020, to early May 2020, even after adjustment for obesity-related comorbidities.This study was published on August 12, 2020, and concluded saying 'obesity plays a profound role in risk for death from COVID-19, particularly in male patients and younger populations, and provides actionable insights for early interventions.'"},
{"date_time": "Aug 12, 2020 • 2:43 pm CDT", "title": "England Over-Counted Coronavirus Fatalities During 2020", "content": "As of August 12, 2020, the United Kingdom's official COVID-19 disease-related fatality calculation has been reduced by more than 5,000 following a review by the Department of Health and Social Care. Previous COVID-19 deaths were included for anyone who had died following a positive SARS-CoV-2 coronavirus test, at any point.The new daily measure provides a UK-wide count of deaths under a consistent methodology for England, Northern Ireland, Scotland, and Wales that has been endorsed by an external review. The measure will be based on a 28-day limit between the date of a positive lab-confirmed test and date of death.Deaths that occur more than 28 days after a positive test will not be included in the headline count, stated the UK government.The latest number of coronavirus tests, cases, and COVID-19 related fatalities in the UK is published on this webpage."},
{"date_time": "Aug 12, 2020 • 2:29 pm CDT", "title": "Houston's Surge Testing Sites To Remain Open", "content": "Texas Governor Greg Abbott announced on August 12, 2020, that the U.S. Department of HHS has extended operations for 4 temporary COVID-19 surge testing sites in Harris County, which includes the city of Houston. These testing sites will remain open through August 29th.These testing sites are located in Houston, Pasadena, and Kingwood, and began operations on August 10th. Each location is able to process 1,250 tests per day or a total of 60,000 tests across the sites.\"As we address surges in COVID-19 cases across the state of Texas, increasing testing is essential to detecting and mitigating the spread of this virus,\" said Governor Abbott on August 7th. \"I thank Secretary Azar, Admiral Giroir, and all of our partners at HHS for providing our communities with the additional resources they need to combat COVID-19.\"As of August 12, 2020, Harris County has reported about 1,600 COVID-19 disease-related fatalities, which, based on the 4 million residents, indicates a case fatality rate of less than 1% during 2020."},
{"date_time": "Aug 12, 2020 • 1:11 pm CDT", "title": "Veklury (remdesivir) Submitted New Drug Application to the U.S. FDA", "content": "Gilead Sciences announced on August 10, 2020, that it has submitted a New Drug Application to the U.S. FDA for Veklury (remdesivir), an investigational antiviral for the treatment of hospitalized patients with severe COVID-19. Veklury has been approved by multiple regulatory authorities around the world, including in the European Union and Japan."},
{"date_time": "Aug 12, 2020 • 10:29 am CDT", "title": "LeBron's Guests Welcome in the Orlando Bubble", "content": "The NBA announced it will be expanding the 'Bubble' around the players living in Orlando, Florida, on August 12, 2020. The NBA is now authorizing 4 guests per player, plus children.This opportunity to bring guests into the Bubble located at Walt Disney World will be only for NBA teams advancing to the 2nd round of the playoffs, and the earliest any guest could satisfy quarantine rules and be reunited with a player is August 31, 2020, reported the AP.“I miss the hell out of my family,” Los Angeles Lakers forward LeBron James said last week. “My wife, my kids, my mother, and so on, and so on. So, it’s a huge challenge.”"},
{"date_time": "Aug 12, 2020 • 8:14 am CDT", "title": "Nursing Home Residents Receiving Dialysis Need Better COVID-19 Protection", "content": "An August 11, 2020, report by the U.S. CDC highlights how nursing homes have been among the hardest-hit care facilities during the SARS-CoV-2 pandemic of 2020. This CDC report, based on an outbreak at a Maryland facility, investigators found that around 20% of residents tested positive for SARS-CoV-2. And, 72% were asymptomatic at the time of testing.This nursing home identified a significantly higher prevalence of coronavirus infection among residents receiving dialysis (47%), which indicates nursing home residents who undergo dialysis are a particularly vulnerable population.Nursing Home fatality data can be found using this CDC Search map, which identifies the states of New Jersey, New York, and Pennsylvania as reporting about 38% of all COVID-19 disease-related fatalities during 2020."},
{"date_time": "Aug 12, 2020 • 7:50 am CDT", "title": "'Karen' Caused Connecticut Co-Worker $2,000 Travel Violation Fine", "content": "The State of Connecticut issued $2,000 fines on August 10, 2020, for violations of the new requirements for travelers returning from COVID-19 disease hotspot states. The travel advisory violators both refused to fill out the travel advisory questionnaire, resulting in $1,000 fine each. One of those travelers did not quarantine, resulting in a second $1,000 fine for that person.According to the State, no COVID-19 cases have been linked to these out-of-state travelers.The violations were issued as the result of tips - from a co-worker - sent to the Department of Public Health that resulted in an investigation, Chief Operating Officer Josh Geballe said, report the CT Post. Geballe said there are additional investigations currently underway concerning possible violators, reported the AP."},
{"date_time": "Aug 12, 2020 • 3:21 am CDT", "title": "Reused N95 Masks Found Very Protective", "content": "Researchers recently tested fitted filtration efficiencies (FFEs) of 29 different fitted face mask alternatives for virus particle penetration, worn when performing a series of repeated movements to recreate typical occupational activities of healthcare teams. On August 11, 2020, JAMA published these results which concluded saying 'N95 masks that are past their expiration date or have been used and resterilized, can be acceptable alternatives to a standard, new single-use N95 masks.'Which is good news, from a cost perspective.However, the most effective face mask achieved only 79.7% FFE in this study."},
{"date_time": "Aug 12, 2020 • 3:05 am CDT", "title": "California's San Quentin State Prison Reports Increasing COVID-19 Fatalities", "content": "The situation unfolding at San Quentin State Prison over the last 2-months has become the latest of several cautionary tales that show how any effort to achieve coronavirus 'herd immunity' before a vaccine becomes available would come with enormous costs in terms of illness, reported the LA Times on August 11, 2020. There had been more than 2,200 SARS-CoV-2 cases and 25 COVID-19 disease-related fatalities, among the San Quentin population of more than 3,260 people during 2020.This new LA Times data indicates a virus fatality rate of about 1% at this northern-San Francisco based prison."},
{"date_time": "Aug 12, 2020 • 2:40 am CDT", "title": "FDA Issues Additional Coronavirus Test Authorizations", "content": "As of August 11, 2020, the U.S. FDA had authorized 210 coronavirus diagnostic tests, which include 171 molecular tests, 37 antibody tests, and 2 antigen tests. The new Emergency Use Authorizations were issued to Solaris Diagnostics, for its molecular Solaris Multiplex SARS-CoV-2 Assay, and, Alpha Genomix Laboratories, for its molecular Alpha Genomix TaqPath SARS-CoV-2 Combo Assay."},
{"date_time": "Aug 11, 2020 • 5:19 pm CDT", "title": "Coronavirus Prevention Phase 3 Study Seeks Healthy Adults", "content": "The U.S. NIAID announced on August 10, 2020, two Phase 3, randomized, placebo-controlled, double-blind clinical trials testing whether experimental monoclonal antibodies (mAbs) can prevent infection by SARS-CoV-2 coronavirus are now enrolling healthy adults at clinical trial sites in the USA. Many of the trial sites are part of the recently launched COVID-19 Prevention Network.Monoclonal antibodies are laboratory-made versions of proteins naturally produced by the immune system in response to invading viruses or other pathogens. Neutralizing antibodies, whether natural or monoclonal, can bind directly to portions of viruses that they use to attach to and enter cells, preventing them from initiating the infection cycle. Monoclonal antibodies may provide short-term protection from the SARS-CoV-2 coronavirus."},
{"date_time": "Aug 11, 2020 • 3:42 pm CDT", "title": "Sputnik V Vaccine Launches Against Coronavirus", "content": "Announced by the Russian Direct Investment Fund (RDIF) on August 11, 2020, the Russian vaccine “Sputnik V” has been launched becoming the world’s first registered COVID-19 vaccine and evoking memories of the 1957 launch of a Soviet satellite, which opened space to exploration by humans.Based on an innovative technological platform of adenovirus-based vectors, which make it easier and faster to create new vaccines by modifying the initial carrier vector with genetic material from new emerging viruses. Such vaccines provoke a strong response from a human body in order to build immunity while the overall process of vector modification and pilot-scale manufacturing takes only a few months.Since the start of the COVID-19 disease pandemic in late 2019, Russian vaccine researchers decided to use this already proven technology instead of going into uncharted territory, said the RDIF."},
{"date_time": "Aug 11, 2020 • 3:28 pm CDT", "title": "COVID-19 Disease Defeats The Big Ten in 2020", "content": "The Big Ten Conference announced on August 11, 2020, the postponement of the 2020-21 fall sports season due to ongoing health and safety concerns related to the COVID-19 pandemic. This decision includes all regular-season contests and Big Ten Championships and Tournaments.\n“Our primary responsibility is to make the best possible decisions in the interest of our students, faculty, and staff,” commented Morton Schapiro, Chair of the Big Ten Council of Presidents/Chancellors and Northwestern University President."},
{"date_time": "Aug 11, 2020 • 11:38 am CDT", "title": "Will Children Carry Coronavirus to Kindergarten?", "content": "Research published on July 30, 2020, suggests that children can carry at least as much of the SARS-CoV2- coronavirus in their noses and throats as adults do, even if they have only mild or moderate symptoms. This study prompted fears that students may spread the virus when attending class this fall.However, a large study from South Korea published by the U.S. CDC for an October 2020 report, offers an answer: Children younger than 10 years old transmit much less of this virus than adults do. But the risk of transmission is not zero.These researchers found the highest COVID-19 infection rate (18.6%) for household contacts of school-aged children... and the lowest (5.3%) for household contacts of children 0–9 years."},
{"date_time": "Aug 11, 2020 • 11:25 am CDT", "title": "MIT Professor Calculated Very, Very Low Coronavirus Risk While Flying ", "content": "If you decide to fly, the odds that you will pick up the coronavirus that causes COVID-19 disease are very low, according to a non-peer-reviewed study published on August 2, 2020. Professor Arnold Barnett, at the Massachusetts Institute of Technology (MIT) approximated the probability that an airline traveler in coach will contract COVID-19 on a US domestic flight that is 2-hours long, are 1 in 4,300 for full flights, and 1 in 7,700, when middle seats are kept empty."},
{"date_time": "Aug 11, 2020 • 9:25 am CDT", "title": "California Testing Llama Nanobodies Against COVID-19", "content": "Researchers at the University of California, San Francisco (UCSF) say they have synthesized a molecule inspired by llama antibodies called nanobodies for potential COVID-19 disease treatment. The UCSF team hasn’t published research yet, so this science has not been peer-reviewed, reported BioSpace on August 11, 2020.These antibodies are approximately 25% of the size of human antibodies and from other animals, stated the U.S. NIH, on May 19, 2020. In addition, nanobodies are extremely stable, which means they can be turned into a dry powder and aerosolized, which would make them much easier to administer than the human monoclonal antibodies."},
{"date_time": "Aug 11, 2020 • 5:26 am CDT", "title": "President Putin's Daughter Tested COVID-19 Vaccine Candidate", "content": "The Russia Federation's President Vladimir Putin reported on August 11, 2020, the registration in Russia of the first vaccine against the coronavirus infection. \"As far as I know, this morning for the first time in the world a vaccine against the novel coronavirus infection was registered,\" the president said in a TASS article.President Putin also stated that 'one of his daughters had tested the Russian COVID-19 vaccine on herself and that she is feeling well.'Putin further noted that after the first vaccine shot, his daughter had a 38°C fever, and on the next day, a fever slightly higher than 37°C. 'And then, after the 2nd shot, she had a slight fever again, and then everything was fine. She is feeling well and has a high [antibody] count.'The Russian COVID-19 vaccine candidate Gam-COVID-Vac, is an adenoviral-based vaccine against the SARS-CoV-2 coronavirus, developed by the Gamaleya National Research Center for Epidemiology and Microbiology. Gam-COVID-Vac uses a weakened virus to deliver small parts of a pathogen and stimulate an immune response. And, is a vector vaccine based on adenovirus DNA, in which the SARS-CoV-2 coronavirus gene is integrated.Recently, the clinical trials of the Gam-COVID-Vac vaccine were declared 'over' by the Russian Healthcare Ministry."},
{"date_time": "Aug 11, 2020 • 4:56 am CDT", "title": "After 102 Days, New Zealand Confirms Locally-Transmitted Coronavirus Case", "content": "On August 11, 2020, New Zealand's Ministry of Health reported 1 new case of COVID-19 disease in a man in his 20s. He has been in managed isolation at the Grand Millennium and tested negative for COVID-19 around day 3 of his stay. He has tested positive around day 12 of his stay and has been transferred to the Auckland quarantine facility.It has been 102 days since the last case of COVID-19 was acquired-locally from an unknown source in New Zealand."},
{"date_time": "Aug 11, 2020 • 4:39 am CDT", "title": "Study: 5 Predictive Humoral Immune Response Markers in COVID-19", "content": "A study published online in Immunity on August 6, 2020, identifies 5 immune response markers which, collectively, were able to correctly classify both convalescent COVID-19 patients and those who did not survive the disease.The study was led by Ragon Group Leader Galit Alter, Ph.D., Professor of Medicine at Harvard Medical School, and Helen Chu, M.D., University of Washington School of Medicine. Dr. Alter’s team used her systems serology technique, an approach that relies on 60+ assays to create a detailed profile of the immune response, to compare the immune responses of those who had survived to those who had not.“By looking at the overall profile of the immune response, we can begin to truly understand how the immune system responds to COVID-19 and then use that knowledge to prevent the worst outcomes of this disease,” said Dr. Alter, in an August 7th press statement."},
{"date_time": "Aug 11, 2020 • 4:08 am CDT", "title": "Ethiopia Receives 250 Ventilators From the USA", "content": "The U.S. government announced the donation of 250 state-of-the-art ventilators and other critical care equipment to assist the Federal Democratic Republic of Ethiopia with its response to the COVID-19 disease pandemic on August 4, 2020.“This donation is a critical addition to the billions of dollars in resources and expertise that the American people have invested in Ethiopia’s health system in recent years,\" said U.S. Ambassador Michael Raynor at the handover event."},
{"date_time": "Aug 10, 2020 • 8:36 pm CDT", "title": "Could Dedicated COVID-19 Clinics Flatten the Curve", "content": "A study published by PLOS on August 6, 2020, concludes that opening clinics dedicated specifically to treating influenza can limit the number of people infected with the incoming flu virus from the Southern Hemisphere and reduce the peak prevalence rate.While this study focused on influenza, the findings are relevant for policymakers seeking to “flatten the curve\" of the ongoing COVID-19 pandemic. “COVID-19 is more infectious than H1N1 and has a higher mortality rate. So I would expect the positive effect of using 'dedicated clinics' to be larger for COVID-19.\" said these researchers."},
{"date_time": "Aug 10, 2020 • 7:45 pm CDT", "title": "College Co-Eds Conduct Coronavirus Tests in College Dorms", "content": "Elon University is requiring that all students, faculty, and staff returning to campus in the Fall 2000 semester get tested for the SARS-CoV-2 virus, encouraging students to use an online service that enables individuals to test themselves at home or dorm rooms with a non-invasive nasal swab test. When the sample is collected, it is shipped directly to the laboratory via FedEx, with the test results securely accessed online.On August 5, 2020, North Carolina based Elon clarified that this test is a polymerase chain reaction, or PCR test, which allows the coronavirus testing of individuals even without symptoms."},
{"date_time": "Aug 10, 2020 • 3:15 pm CDT", "title": "Wearing Neck Fleece or Bandanas Offer Reduced Virus Protection", "content": "A study published on August 7, 2020, demonstrated a simple optical method to evaluate the efficacy of masks to reduce the transmission of respiratory droplets during a regular conversation. In proof-of-principle studies, these researchers found neck fleece or bandanas, offer very little virus protection.A further area of interest is the comparison of mask performance between solid particles and droplets, motivated by the observed liquid droplet breakup in the neck fleece and mask saturation by droplets."},
{"date_time": "Aug 10, 2020 • 9:09 am CDT", "title": "Bikers To Be Blocked At Cheyenne River Reservation", "content": "Thousands of bikers attending the 10-day Sturgis Motorcycle Rally will not be allowed through Cheyenne River Sioux checkpoints, a spokesman for the Native American group told The Guardian on August 9, 2020. The tribe’s checkpoint rules say 'non-residents driving non-commercial out-of-state vehicles are never allowed through the reservation.But they say non-residents in non-commercial South Dakota vehicles are allowed through .... as long as they are not coming from a SARS-CoV-2 virus 'hot-spot'.As of August 7th, residents were informed they may travel at their own risk and are recommended to quarantine for 10-days upon returning to the Reservation from a hot-spot. Non-residents traveling for non-essential reasons coming from a hot-spot ... will be turned around.At the end of the day on August 9, 2020, there were 15 active cases of COVID-19 disease on the Cheyenne River Reservation."},
{"date_time": "Aug 10, 2020 • 8:39 am CDT", "title": "Oral COVID-19 Vaccine Application Filed With the U.S. FDA", "content": "Vaxart announced on August 10, 2020, that its oral COVID-19 vaccine Investigational New Drug application has been filed with the U.S. FDA. Andrei Floroiu, chief executive officer of Vaxart, said in a press statement: “We expect our upcoming Phase I study to generate data that will further differentiate our oral vaccine from injectable vaccines by substantiating the importance of activating both systemic and mucosal immunity in protecting against COVID-19 disease."},
{"date_time": "Aug 10, 2020 • 7:15 am CDT", "title": "Paris Announces 135 Euro Fines For Mask-Less Adults ", "content": "The wearing of a face mask in Paris transitioned from being fashionable to compulsory for those over 11 years of age on all public transport on August 10, 2020. And anyone failing to comply with this new mandate is subject to a fine of 135 euros. The new policy is in response to coronavirus infections in France surpassing those reported in May 2020.This new rule applies to densely crowded city zones such as tourist spots said the Paris mayor’s office in a statement. See this map of Paris for details.According to ParisInfo.com, most restaurants, cafes, night clubs, and sports facilities remain closed for an indefinite period. Even the French Riveria's Saint-Tropez resort is requiring masks to be worn outdoors, reported EuroNews."},
{"date_time": "Aug 10, 2020 • 6:40 am CDT", "title": "Dr. Francis Collins Shares His Vaccine-Hesitancy Concerns", "content": "Amid the coronavirus pandemic, the 16th leader of the National Institutes of Health, Francis S. Collins, M.D., Ph.D., finds hope in his evangelical beliefs and the altruism of medical researchers. Dr. Collins spoke to the Wall Street Journal on August 7, 2020, about his concerns over vaccine hesitancy and health disparities spotlighted by the COVID-19 disease pandemic."},
{"date_time": "Aug 10, 2020 • 6:30 am CDT", "title": "NIH Study:  Monoclonal Antibodies May Reduce Coronavirus Spreading in the Body", "content": "Eli Lilly, in collaboration with the U.S. National Institutes of Health, announced on August 5, 2020, they're testing a lab-engineered treatment called 'monoclonal antibodies' to reduce the new coronavirus from spreading in the body. This is a Phase 3 clinical trial studying LY-CoV555.\"Monoclonal antibodies stick right to the part of this spike protein that represents the part that binds to the human cell and lets the virus get inside. So you cover that up and the virus has nowhere to go,\" said the NIH's 16th director, Dr. Francis S. Collins.'In contrast to the convalescent plasma taken from survivors' blood, monoclonal antibodies can be manufactured in large amounts in a lab.'"},
{"date_time": "Aug 10, 2020 • 6:16 am CDT", "title": "Canada's Coronavirus-Positive Rate Drops to 1%", "content": "Dr. Theresa Tam, Canada's Chief Public Health Officer, issued the following statement on August 9, 2020: 'Over the past week, an average of 48,360 people were tested daily, with 1% testing positive for SARS-CoV-2, the coronavirus causing COVID-19 disease in people."},
{"date_time": "Aug 10, 2020 • 12:42 am CDT", "title": "How Long is the Coronavirus Infection Incubation Period?", "content": "While the common wisdom among health authorities is that the average incubation period is about 5-days, rising to a maximum of about 2-weeks, researchers from the Chinese CDC, the U.S. NIAID, and Peking University, say the mean value could be higher, reported the SCMP on August 9, 2020. The incubation period of an infectious disease is the time elapsed between virus infection and the appearance of symptoms.This study found the mean incubation time was 8.29 days, while the median value was 7.76 days. Compared with previous research, the incubation period estimated in our study is significantly longer, stated these researchers.This data may influence the duration of mandatory quarantine time frames."},
{"date_time": "Aug 10, 2020 • 12:21 am CDT", "title": "United Arab Emirates Successfully Enrolled 5,000 Clinical Trial Participants", "content": "A leading Phase III clinical trial of the New Crown COVID-19 inactivated vaccine being held in the United Arab Emirates has reached a major milestone with over 5,000 volunteers who have received their 1st vaccination, as of August 6, 2020.This large study follows previous trials conducted by Sinopharm in China, which is reported to have resulted in 100% of the volunteers generating antibodies to the SARS-CoV-2 coronavirus, after 2-doses in 28 days.In the USA, there are numerous vaccine clinical studies seeking participates, such as this NIH study."},
{"date_time": "Aug 9, 2020 • 7:05 pm CDT", "title": "Georgia High School to 'Zoom' Again ", "content": "A letter obtained by NBC News on August 9, 2020, reveils Georgia's Paulding County School District Superintendent Brian Otott informed the parents of North Paulding High School's 2,000 students, they will use a “digital learning” model while the school undergoes deep cleaning after 9 students tested positive for the SARS-CoV-2 coronavirus.The letter also reiterates that school district guidelines require any students or staff who are confirmed with COVID-19, along with any who were in close contact with them, must be quarantined for at least 14-days.In addition to the 9 known cases - 3 staff members and 6 additional students - are pending virus test results."},
{"date_time": "Aug 9, 2020 • 2:22 pm CDT", "title": "Coronavirus Antibodies Found in NYC's Hospital Staff", "content": "As the COVID-19 pandemic struck New York City (NYC), it became the USA's epicenter and healthcare personnel (HCP) working in NYC had a high exposure risk to the SARS-CoV-2 virus. One leading health system, Northwell, has treated about 55,000 virus patients. The good news is a new study published in JAMA on August 6, 2020, found a 13.7% prevalence of SARS-CoV-2 antibodies in the Northwell / HCP cohort.A previous study in the Mount Sinai Health System found 36% of HCWs had IgG antibodies to SARS-CoV-2, reflecting the high exposure of inpatient and ambulatory frontline staff.'While we continue to recommend standard protective precautions for everyone, HCWs with SARS-CoV-2 IgG may become our safest frontline providers as we learn if IgG antibodies confer immunity to protect against reinfection.Knowing IgG antibody status may ease concerns regarding personal risk as this pandemic continues,' commented these researchers on June 3, 2020."},
{"date_time": "Aug 9, 2020 • 1:19 pm CDT", "title": "How Does Our Immune System React to this Coronavirus?", "content": "The human immune system’s response to COVID-19 disease is one of the biggest questions of the 2020 pandemic. Understanding it is key to bringing an end to the global spread of the SARS-CoV-2 virus. The problem is that the human immune system is wildly complicated, and this new betacoronavirus seems to interact with it in some unusual ways, stated an insightful article published in The Atlantic on August 5, 2020."},
{"date_time": "Aug 9, 2020 • 12:57 pm CDT", "title": "India Picks Speed Over Coronavirus Testing Accuracy", "content": "India's Prime Minister Narendra Modi recently committed to increase SARS-CoV-2 testing to 1-million per day to tackle an ongoing COVID-19 disease outbreak. Beginning August 1st, about 500,000 tests were being delivered each day across India, according to the international comparison site, Our World in Data.To meet PM Modi's goal, the BBC reported on August 8, 2020, Indian authorities have been switching over to a quicker method called a 'rapid antigen test', which can give a result in about 20 minutes. But, these tests are less reliable, with an accuracy rate in some cases as low as 50%.Dr. Anupam Singh, a public health expert in India, says 'there are some advantages to the rapid tests: \"It allows a faster detection process and means you can quickly detect highly infectious individuals with a high viral load who might be so-called super-spreaders.'But, he also has concerns about this strategy, which can potentially miss many infections."},
{"date_time": "Aug 9, 2020 • 7:53 am CDT", "title": "Study: SARS-CoV-2 Viral Load Can Predict COVID-19 Disease Mortality", "content": "A study published in The Lancet on August 6, 2020, shows an independent relationship between high viral load of the SARS-CoV-2 coronavirus and mortality. These researchers say 'transforming qualitative testing into a quantitative measurement of a viral load will assist clinicians in risk-stratifying patients and choosing among available therapies and trials.'Furthermore, 'viral load might also affect quarantine - isolation tactics on the basis of infectivity risk.'"}
]